{
    "born": "The born event is related to life and someone is given birth to.",
    "marry": "The marry event is related to life and someone is married.",
    "divorce": "The divorce event is related to life and someone was divorced.",
    "injure": "The injure event is related to life and someone is injured.",
    "die": "The die event is related to life and someone died.",
    "transport": "The transport event is related to movement. The event occurs when a weapon or vehicle is moved from one place to another.",
    "transfer ownership": "The transfer ownership event is related to transaction. The event occurs when an item or an organization is sold or gave to some other.",
    "transfer money": "The transfer money event is related to transaction. The event occurs when someone is giving, receiving, borrowing, or lending money.",
    "start organization": "The start organization event is related to a new organization being created.",
    "merge organization": "The merge organization event is related to two or more organization coming together to form a new organization.",
    "declare bankruptcy": "The declare bankruptcy event is related to some organization declaring bankruptcy.",
    "end organization": "The end organization event is related to some organization ceasing to exist.",
    "attack": "The attack event is related to conflict and some violent physical act.",
    "demonstrate": "The demonstrate event is related to a large number of people coming together to protest.",
    "meet": "The meet event is related to a group of people meeting and interacting with one another face-to-face.",
    "phone write": "The phone write event is related to people phone calling or messaging one another.",
    "start position": "The start position event is related to a person begins working for an organization or a hiring manager.",
    "end position": "The end position event is related to a person stops working for an organization or a hiring manager.",
    "nominate": "The nominate event is related to a person being nominated for a position.",
    "elect": "The elect event is related to a candidate wins an election.",
    "arrest jail": "The arrest jail event is related to a person getting arrested or a person being sent to jail.",
    "release parole": "The release parole event is related to an end to someone's custody in prison.",
    "trial hearing": "The trial hearing event is related to a trial or hearing for someone.",
    "charge indict": "The charge indict event is related to someone or some organization being accused of a crime.",
    "sue": "The sue event is related to a court proceeding that has been initiated and someone sue the other.",
    "convict": "The convict event is related to someone being found guilty of a crime.",
    "sentence": "The sentence event is related to someone being sentenced to punishment because of a crime.",
    "fine": "The fine event is related to someone being issued a financial punishment.",
    "execute": "The execute event is related to someone being executed to death.",
    "extradite": "The extradite event is related to justice. The event occurs when a person was extradited from one place to another place.",
    "acquit": "The acquit event is related to someone being acquitted.",
    "appeal": "The appeal event is related to someone appealing the decision of a court.",
    "pardon": "The pardon event is related to someone being pardoned."
}