{
    "Know": "The event is related to cognition and someone adding a phenomenon to their model of the world. It is similar to coming-to-believe words, except the latter generally involve reasoning from evidence.",
    "Warning": "The event is related to communication. The event occurs when a speaker warns an addressee by giving a message that describes an undesirable situation that may affect the addressee. The warning may alternatively be described as about a topic pertaining to the undesirable situation or issued via a specific medium.",
    "Catastrophe": "The event is related to an Undesirable_event which negatively affects the Patient. No agent is involved. The event involves a disastrous trade war with Holland. The event is sad and involves making a living by grubbing around in the dirt of a national calamity. The result of the event is catastrophic.",
    "Placing": "The event is related to movement. The event occurs when an agent, without overall (translational) motion, places a theme at a location, the goal, which is profiled. In this frame, the theme is under the control of the agent/cause at the time of its arrival at the goal.",
    "Causation": "The event is related to cause and effect relationships. The event occurs when a cause leads to an effect. Additionally, an actor, who is a participant in the cause, may be substituted as the cause. The entity affected by the causation may represent the overall effect situation or event.",
    "Arriving": "The event is related to movement. An object Theme moves in the direction of a Goal. The Goal may be expressed or it may be understood from context, but it is always implied by the verb itself.",
    "Commerce_money-transfer": "The event is related to transaction. The event occurs when money is transferred from a buyer to a seller in exchange for goods.",
    "Sending": "The event is related to movement. The event occurs when a Sender plans the Path (along with Source and Goal) of a Theme and places it in circumstances such that it travels along this Path under the power of some entity other than the Sender. This frame also has a Recipient distinct from the Goal, as both can be present.",
    "Protest": "The event is related to a large number of people coming together to express their disagreement or objection towards something. An Arguer presents a Content, along with Support, to an Addressee. The Content may refer to a course of action or a proposition that the Addressee is to believe. Some lexical units (e.g. prove) indicate the speaker's belief about the Content. Jan argued that the evidence was inadmissible. Jan argued against the admissibility of the evidence. Jan proved that the evidence was inadmissible.",
    "Preventing_or_letting": "The event is related to an action taken by a potential hindrance or an agent that stops another event from happening. The potential hindrance or agent can actively prevent the event from taking place or choose not to do so. If the event is not prevented, lexical units such as 'allow' indicate a negative outcome. Some lexical units, like 'avert' and 'avoid', suggest that the potential hindrance or agent would have been affected if the event had occurred.",
    "Motion": "The event is related to movement. Some entity (Theme) starts out in one place (Source) and ends up in some other place (Goal), having covered some space between the two (Path). Alternatively, the Area or Direction in which the Theme moves or the Distance of the movement may be mentioned.",
    "Temporary_leave": "The event is related to a person taking leave from their routine activity (such as work or school) for a duration of time. The duration can be any length of time, as long as the absence is temporary.",
    "Damaging": "The event is related to causing harm or altering the state of a patient or an object. The agent performs an action that results in the patient or object ending up in a non-canonical or undesirable state. Some lexical units in this frame indicate the means by which the alteration occurs (e.g., scrape.v), while others specify the detailed effect on the patient or object (e.g., score.v, chip.v). Some lexical units simply indicate the general act of causing harm or damage (e.g., damage.v). Negative semantic type may be used to indicate that the patient is negatively affected.",
    "Destroying": "The event is related to destruction. The event occurs when a conscious entity or an event affects the Patient negatively, resulting in the nonexistence of the Patient. An example of this event is when an asteroid obliterated the dinosaurs.",
    "Death": "The event is related to life and the death of a protagonist. The cause of death may also be expressed obliquely.",
    "Perception_active": "The event is related to perception and involves intentional attention directed by a perceiver towards an entity or phenomenon, with the purpose of having a perceptual experience. In this context, the role of the perceiver is referred to as Perceiver_agentive.",
    "Presence": "The event is related to existence. An entity is observed to exist at a specific location and time, as perceived by an implicit observer. A depiction and/or duration phrase is often associated with the event.",
    "Influence": "The event is related to the interaction between an Agent, Situation, or Entity and a Cognizer. The influence can be of a general nature, where the Cognizer is affected by the Agent, Situation, or Entity. Alternatively, the influence can manifest in the Cognizer taking action as a result of the influence. Furthermore, the Cognizer can be influenced in how they conduct a specific Behavior. Additionally, the influence can be observed in the production or design of a Product, which was influenced by the Cognizer's experience with the Situation or Entity.",
    "Receiving": "The event is related to transaction. The event occurs when a Recipient comes into possession of the Theme as a result of the joint action of the Donor and the Recipient. The event requires that the Donor initially has possession of the Theme and that following the transfer, the Donor no longer has the Theme and the Recipient does.",
    "Check": "The event is related to inspection. The event occurs when an inspector attains a degree of certainty in the unconfirmed_content, generally by inspecting some evidence.",
    "Hostile_encounter": "The event is related to conflict and confrontation. It involves opposing forces (Side_1 and Side_2) engaging in a hostile encounter. This encounter may be motivated by a disputed Issue or in order to achieve a specific Purpose.",
    "Killing": "The event is related to life and someone's death caused by a killer or a cause.",
    "Conquering": "The event is related to conflict and an entity or territory losing its independence or control after being successfully invaded by a conqueror. The conquered entity may also suffer physical damage or destruction as a consequence of the invasion.",
    "Releasing": "The event is related to someone in captivity being set free or released from a place of confinement. The release is carried out by the captor and is in accordance with their plans.",
    "Attack": "The event is related to conflict and some violent physical act. An Assailant physically attacks a Victim (which is usually but not always sentient), causing or intending to cause the Victim physical damage. A Weapon used by the Assailant may also be mentioned, in addition to the usual Place, Time, Purpose, Explanation, etc. Sometimes a location is used metonymically to stand for the Assailant or the Victim, and in such cases the Place FE will be annotated on a second FE layer.",
    "Earnings_and_losses": "The event is related to financial transactions between an Earner and a Buyer. The Earner receives Earnings by providing Goods to the Buyer. The provision of Goods may involve a cost, which can be included or excluded from the consideration. This event emphasizes the impact on the Earner and can apply to multiple transactions with different parties. Some lexical units primarily refer to the Earnings received, while others focus on the difference between Earnings and costs, highlighting either a net loss or net gain.",
    "Choosing": "The event is related to decision-making. The event occurs when a cognizer selects a chosen item or course of action from a set of possibilities. The cognizer may have an inherent purpose or a larger purpose for the chosen.",
    "Traveling": "The event is related to movement. An agent matches location with an entity in order to fulfill some purpose.",
    "Recovering": "The event is related to life and someone's vigor and strength being restored to an earlier state after an action by an agent or the occurrence of a cause event.",
    "Using": "The event is related to an Agent manipulating an Instrument in order to achieve a Purpose.",
    "Coming_to_be": "The event is related to creation and an entity coming into existence at a specific place and time. The event may have a certain duration of endstate, be caused by something, or be formed from components.",
    "Cause_to_be_included": "The event is related to a new member being added to a group. The action is caused by an agent or cause, and the group may be represented by an existing member if it implies the existence of a set of members.",
    "Process_start": "The event is related to the start of a process. It occurs at a specific time and place. The reason for the start of the process may also be indicated. Please refer to the Event frame for more information.",
    "Change_event_time": "The event is related to altering the timing of another event. This event occurs when an agent or cause changes the scheduled time of an event, causing it to take place at a different time designated as the destination time or in relation to another event called the destination event. This change in timing can be accomplished using specific means, in a particular manner, or to a certain degree.",
    "Reporting": "The event is related to communication and providing information to authorities about illegal or improper behavior. The event occurs when an informer reports the wrongdoing of a person or group to the authorities. For example, Tony reported Michael to the police for breaking into his car. Another example is the teacher reporting the act of bathroom vandalism. DNI.",
    "Bodily_harm": "The event is related to life and someone is injured. The event occurs when an agent or cause causes harm or injury to a victim. The body part of the victim that is most directly affected may also be mentioned in the event, and the victim is often indicated as a genitive modifier of the body part.",
    "Suspicion": "The event is related to justice. The event occurs when a person or group, the Authority, believes that another person, the Suspect, is a participant in a criminal Incident.",
    "Statement": "The event is related to communication. The event occurs when a Speaker addresses a Message to an Addressee using language. A Medium can also be mentioned instead of a Speaker. A Topic can be stated instead of a Message. The event can be performative, such as declaring or insisting.",
    "Claim_ownership": "The event is related to transaction. The event occurs when a claimant asserts his or her right to possession of a piece of property (either real, such as land, or private). The claimant may be acting on behalf of a beneficiary.",
    "Cause_change_of_position_on_a_scale": "The event is related to a change in the position of an item on a scale. The change is caused by an agent or a cause, and it results in the item's value transitioning from an initial value (Value_1) to an end value (Value_2). The direction of the change (Path) and the magnitude of the change (Difference) can also be indicated.",
    "Coming_to_believe": "The event is related to the mind and belief. The event occurs when a person (the Cognizer) comes to believe something (the Content), sometimes after a process of reasoning. This change in belief is usually initiated by a person or piece of Evidence. Occasionally words in this domain are accompanied by phrases expressing Topic, i.e. that which the mental Content is about.",
    "Expressing_publicly": "The event is related to communication. The event occurs when a communicator publically communicates some difficult-to-express content which they (or a social group of which they are a member) have had for some time. The content may not have been previously communicated due to inability or social stricture. In cases where the individuals addressed are a smaller group than the public at large, a separate addressee may be expressed.",
    "Request": "The event is related to communication. In this frame, a Speaker asks an Addressee for something or to carry out some action.",
    "Control": "The event is related to someone or something exerting control over another person, situation, or variable. The controlling entity, controlling situation, or controlling variable has the power to determine the actions, behavior, or outcome of the dependent entity, dependent situation, or dependent variable.",
    "Self_control": "The event is related to an agent actively (yet not always with success) attempting to keep themselves from participating in an event. The agent is usually pushed to the event because of an internal urge.",
    "Supporting": "The event is related to assistance. A Supporter assists to strengthen the Supported by lending itself in material aid (or abstract assistance in the case of metaphorical uses).",
    "Defending": "The event is related to conflict. The event occurs when a defender responds to an assailant's attack on a victim by directly, and usually violently, countering it.",
    "Building": "The event is related to construction or assembly actions. The event occurs when an Agent joins Components together to form a Created_entity. The Created_entity is then profiled and becomes the object of the verb.",
    "Military_operation": "The event is related to conflict and involves the military of a possessor (either a nation, institution, or private individual) conducting large-scale activities in a specific area with the aim of achieving military or combined military/non-military goals.",
    "Self_motion": "The event is related to movement. The event occurs when a living being, referred to as the Self_mover, moves under its own direction along a Path. Additionally, an Area, Direction, Source, or Goal for the movement may be mentioned.",
    "GetReady": "The event is related to preparation. It occurs when the protagonist is in an initial state, before beginning to be involved in an activity, but all pre-conditions for performance of the activity have been satisfied. In many cases, the protagonist is an intentional agent, but there are other uses in which the agent is deprofiled, and the protagonist is an entity which is essential to the activity.",
    "Forming_relationships": "The event is related to interaction and social dynamics. The event occurs when Partner_1 engages with Partner_2 (also collectively expressible as Partners) to change their social relationship.",
    "Becoming_a_member": "The event is related to social groups and someone becoming a member of a socially-constructed group.",
    "Execute_plan": "The event is related to an agent acting according to a plan, carrying it out (or taking steps to carry it out). In some cases, the agent is a focal participant in the plan, although a separate focal participant may also be mentioned. The plan may be specified for the duration for which it is in effect.",
    "Action": "This is an abstract frame for acts performed by sentient beings. It exists mostly for FE inheritance.",
    "Removing": "The event is related to movement. The event occurs when an Agent causes a Theme to move away from a location, the Source. The Source is profiled by the words in this frame, just as the Goal is profiled in the Placing frame.",
    "Surrendering": "The event is related to justice. The event occurs when a fugitive presents himself or herself to the authorities to be subject to the criminal process. For example, the bank robber surrendered to Berkeley police. Another instance is when Norte is expected to surrender to police tomorrow on tax fraud charges.",
    "Surrendering_possession": "The event is related to possession transfer. The event occurs when a Surrenderer is compelled to transfer a Theme to a Recipient.",
    "Agree_or_refuse_to_act": "The event is related to communication. The event occurs when a speaker either agrees to or refuses to engage in a proposed action, proposed by an interlocutor.",
    "Participation": "The event is related to multiple participants coming together. The event can be presented symmetrically with equal prominence given to all participants or asymmetrically with greater prominence given to one participant over another. If the event is engaged in intentionally, there is typically a shared purpose between the participants. However, it is possible that an expressed purpose only applies to one participant.",
    "Deciding": "The event is related to cognition. The event occurs when a Cognizer makes a Decision, which may be about an entity or a course of action.",
    "Education_teaching": "The event is related to education and teaching. The event occurs when a student comes to learn either about a subject, a skill, a precept, or a fact as a result of instruction by a teacher.",
    "Emptying": "The event is related to removing the contents of containers or clearing areas of substances or items. The containers or areas can be the direct object and are designated as the Source because they are the source of motion for the action. As the nuclear argument in this frame, the containers or areas are also affected in a significant way, unlike the Source in other frames. Some words in this frame, such as empty, can also be used with expressions indicating the Path or Goal, for example.",
    "Getting": "The event is related to ownership or possession. The event occurs when a recipient initially does not have the theme in their possession, but then acquires it. The source from which the theme came is logically necessary, and the focus is on the changing relationship between the recipient and the theme.",
    "Besieging": "The event is related to conflict and the Assailant, a group of armed forces, surrounding the Victim, a military location and the people within it, in an attempt to cut the Victim off from the outside. The goal is to either force their surrender or weaken them so that an invasion would be successful. A successful siege is often followed by the Assailant taking control of (the land held by) the Victim.",
    "Creating": "The event is related to creation. The event occurs when a cause leads to the formation of a created entity.",
    "Process_end": "The event is related to a process reaching its conclusion.",
    "Body_movement": "The event is related to movement. The event occurs when an agent performs a motion or action using some part of his/her body.",
    "Expansion": "The event is related to a change in physical size. An agent or non-human cause causes an item to expand along all dimensions, unless a specific dimension of expansion is indicated. The size change of the item may be explicitly indicated or characterized in terms of initial size and/or result size.",
    "Telling": "The event is related to communication. The event occurs when a Speaker addresses an Addressee with a Message, which may be indirectly referred to as a Topic. Instead of (or in addition to) a Speaker, a Medium may also be mentioned.",
    "Change": "The event is related to modification. An agent or cause makes an entity undergo a change, either in its category membership or in terms of the value of an attribute. If the entity changes its category, an initial category and a final category may be expressed. If the entity changes its attribute value, an initial value and a final value can be specified.",
    "Cause_change_of_phase": "The event is related to a cause or agent causing a patient to undergo a change of phase. The result of the change may be given, along with the initial state and the circumstances under which the change can occur. Note that this frame contrasts with Cause_change_of_consistency in that this frame describes causation of a change of a patient between different phases (i.e. solid to liquid or frozen to unfrozen). Bob melted the butter. Sally defrosted the chicken to eat for dinner.",
    "Legal_rulings": "The event is related to legal proceedings. The event occurs when an authority with the power to make decisions hands down a finding over a question presented in a formal or informal case.",
    "Bearing_arms": "The event is related to conflict and someone having or not having a weapon. The degree to which the person is armed may also be described. The person involved in the event is usually a human but may also be a device that has subsidiary weapons.",
    "Giving": "The event is related to transaction. The event occurs when a Donor transfers a Theme from a Donor to a Recipient. This frame includes only actions that are initiated by the Donor (the one that starts out owning the Theme). Sentences (even metaphorical ones) must meet the following entailments: the Donor first has possession of the Theme. Following the transfer, the Donor no longer has the Theme and the Recipient does. Barney gave the beer to Moe. $300 was endowed to the university to build a new performing arts building.",
    "Name_conferral": "The event is related to communication and involves speakers conferring names to entities.",
    "Arranging": "The event is related to organization and someone puts a complex theme into a particular configuration, which can be a proper order, a correct or suitable sequence, or a spatial position.",
    "Making_arrangements": "The event is related to preparation and planning. The event occurs when an agent performs a series of unspecified tasks to plan for an event to take place at a scheduled time and place.",
    "Use_firearm": "The event is related to conflict and an agent causes a firearm to discharge. The projectile is usually directed from the barrel of the firearm (the source) along a path and to a goal.",
    "Committing_crime": "The event is related to conflict and someone intentionally does something that goes against the laws of society.",
    "Assistance": "The event is related to providing help or support to someone. A helper benefits a benefited party by enabling the culmination of a goal that the benefited party has. A focal entity that is involved in reaching the goal may stand in for it.",
    "Surrounding": "The event is related to spatial relations. The event occurs when a Figure surrounds a Ground. The Ground location is presented as more likely to be a known location than the location of the Figure. Some lexical units entail more-or-less complete surrounding in two or three dimensions (e.g. surround.v), while others entail surrounding on only two sides (e.g. astride.prep, straddle.v). Like other locative relations, the Figure may be any of a movable entity, an immovable entity, or an event.",
    "Quarreling": "The event is related to conflict and involves a group of individuals, referred to as Arguer1 and Arguer2, expressing incompatible opinions or beliefs about an Issue.",
    "Expend_resource": "The event is related to an Agent using a Resource. During the event, the Resource is consumed and becomes unavailable for future use.",
    "Motion_directional": "The event is related to movement. The event occurs when a Theme moves in a certain Direction which is often determined by gravity or other natural, physical forces. The Theme is not necessarily a self-mover.",
    "Bringing": "The event is related to movement. The event occurs when an Agent, which can be a person or other sentient entity, controls the shared Path by moving the Theme during the motion. The Agent has overall motion in directing the motion of the Theme. The Carrier may be a separate entity or the Agent's body. The Constant_location may be a subregion of the Agent's body or a subregion of a vehicle that the Agent uses.",
    "Communication": "The event is related to communication. It involves a communicator conveying a message to an addressee. The topic and medium of the communication may also be expressed. This event does not specify the method of communication, such as speech, writing, or gesture. The medium and manner of communication can be elaborated in various ways, such as mentioning the language used, the platform used (radio program, letter), or the style of communication (babble, rant, shout, whisper). There are related events that inherit some or all of the features of this communication event, but may have variations in the roles of the communicator and addressee, such as in a conversation where they alternate roles and are often referred to as a single, plural noun phrase.",
    "Containing": "The event is related to a physical object or space. The event occurs when a container holds contents within its boundaries.",
    "Manufacturing": "The event is related to production and a producer creates a product from a resource for commercial purposes.",
    "Social_event": "The event is related to social interaction and gathering. It occurs when attendees come together to conduct a social function or joint activity. The event can be a party or celebration where people gather to honor someone (the Honoree) or to celebrate a specific occasion. The event is often hosted by a particular individual (the Host) who provides the venue for the attendees to gather.",
    "Robbery": "The event is related to conflict and a situation where a Perpetrator wrongs a Victim by taking something (Goods) from them. The robbery can be done in a particular Manner (for example, forcefully) and via a specific Means (for example, by threatening the Victim). The Source location from which the Goods were taken can be used to metonymically refer to the Victim.",
    "Competition": "The event is related to competition and participants engaging in an organized and rule-governed activity. The purpose of the competition is to achieve an advantageous outcome, often referred to as the prize. The degree of achievement of the advantageous outcome is judged based on criteria such as rank and score.",
    "Writing": "The event is related to creation and communication. The event occurs when an author creates a text, either written or spoken, that contains meaningful linguistic tokens. The text may have a particular addressee in mind and may include information about its topic, although the latter is not a focus element in this frame.",
    "Rescuing": "The event is related to a person or entity, referred to as the Agent, taking action to save another person or entity, referred to as the Patient or an Asset, from a harmful situation.",
    "Judgment_communication": "The event is related to communication. The event occurs when a Communicator communicates a judgment of an Evaluee to an Addressee. The judgment may be positive (e.g. praise) or negative (e.g. criticize), and this is indicated by the semantic types Positive and Negative attached to the lexical units. This frame does not contain words where the Evaluee and the Addressee are necessarily the same.",
    "Change_tool": "The event is related to the action of an Agent changing Tools. The change involves moving from the Old_tool to a New_tool. The Tools involved may include vehicles, service providers, or more typical implements.",
    "Hold": "The event is related to an agent manipulating an entity without deeply or permanently physically affecting it or moving it from one place to another.",
    "Being_in_operation": "The event is related to a device or machine being in (or out of) service. Note that being broken or functional is a separate issue from being turned on or off. This event is concerned with the device's state of being turned on or off. The event can specify the time and place where the device is in use, as well as the purpose a backgrounded human user had in turning the device on or off.",
    "Recording": "The event is related to a person or entity documenting or preserving information about an occurrence or the attributes of an entity.",
    "Carry_goods": "The event is related to transaction. The event occurs when a Distributor sells, lends, or otherwise distributes a class of Goods. In the prototypical case, the Distributor is a retailer who generally keeps some type of Goods on site for the purpose of selling it to a buyer. Extensions include lending Goods (e.g., libraries, movie rental outlets), organization-internal distribution (as in a hospital), or other non-commercial distribution centers. The Goods are constrained to be a type of item (e.g., canned goods, antique dressers) rather than a particular or unique item (e.g., Smith's last self-portrait, that guitar I saw here last week). Note that a Distributor may carry some particular goods, but may not have it on hand at that exact moment.",
    "Cost": "The event is related to transaction. The event occurs when a Payer gives up (or potentially gives up) the use of an Asset (generally money) in order to achieve an Intended_event. This event is often more specifically described as gaining possession of some Goods or receiving a Service. In the majority of cases, the Payer is described generically (INI), and the situation depicted answers the question of how much of an Asset would have to be given up to receive the Goods or bring about the Intended_event.",
    "Departing": "The event is related to movement. The event occurs when an object (the Theme) moves away from a Source. The Source may be expressed or it may be understood from context, but its existence is always implied by the departing word itself.",
    "GiveUp": "The event is related to transaction. The event occurs when an agent leaves behind a theme effectively rendering it no longer within their control or of the normal security as one's property.",
    "Change_of_leadership": "The event is related to a change of leadership, specifically the appointment of a new leader or the removal from office of an old leader. The event is initiated by a selector who brings about the change by either electing or overthrowing a leader. Some words used in this context describe the successful removal of a leader from office, such as 'depose' or 'oust', while others describe the attempt to remove a leader, such as 'uprising' or 'rebellion'.",
    "Escaping": "The event is related to movement. The event occurs when a self-moving escapee departs from an undesirable location.",
    "Aiming": "The event is related to an action where an Agent adjusts an Instrument to enable it to interact directly with a difficult-to-access Target_location. Usually, there is a Targeted entity at the Target_location which is mentioned in its place.",
    "Hindering": "The event is related to obstruction and involves a hindrance that makes it more difficult for a protagonist to complete their intended action. It can also involve a hindrance directly affecting an action, which can be a natural act or the actions of many individuals in a collective endeavor. It is important to note that this event does not imply that the protagonist was unable to complete the action or that the action did not occur. The hindrance may indicate a lack of enablement or an obstacle on the natural progression of the protagonist or action.",
    "Preserving": "The event is related to preventing decay. The event occurs when an agent preserves a patient using a medium. Examples include Bill mummifying John and Tess pickling the beets in vinegar. The Smiths dried the apples.",
    "Create_artwork": "The event is related to art and creativity. The event occurs when a Creator produces an artifact that is typically a visual representation of an actual or imagined entity or event. The representation may also be symbolic or metaphorical, conveying an idea or concept without necessarily resembling anything specific.",
    "Openness": "The event is related to accessibility. A useful location becomes accessible to some theme, despite a potential barrier, or remains inaccessible due to the barrier.",
    "Connect": "The event is related to physical contact between a Figure and a Ground. The Figure is fully or partially supported by the Ground (e.g. on). However, in some cases, the support relation is denied (e.g. to, as in she put her hand to the wall) or unspecified (e.g. against). Some versions of the event also specify a direction in which to find the Figure from the Ground (e.g. atop).",
    "Reveal_secret": "The event is related to communication and the act of a Speaker disclosing previously unknown or secret Information to an Addressee. The Information being revealed may have been kept hidden and its disclosure may have potential negative effects on the reputation of the Speaker. It is possible for a Medium to be involved in the communication process. Alternatively, instead of specifying the Information being disclosed, a Topic of discussion may be mentioned. It is worth noting that certain words or phrases associated with this event suggest that the Addressee has already been made aware of the Information prior to this event.",
    "Response": "The event is related to an action performed by an agent in response to a trigger event. In many cases, a non-agentive responding entity causes the response after the trigger occurs.",
    "Court_examination": "The event is related to a court procedure. The event occurs when a Questioner asks a Witness (or defendant) questions in the context of a court procedure.",
    "Scrutiny": "The event is related to observation and analysis. The event occurs when a cognizer pays close attention to a ground, in order to discover and note its salient characteristics. The cognizer may be interested in a particular characteristic or entity, the phenomenon, that belongs to the ground or is contained in the ground (or to ensure that such a property or entity is not present).",
    "Lighting": "The event is related to the emission of light from a source. It involves the motion of a beam of light along a path or towards a goal. The frame denotes the representation of the movement of the beam.",
    "Criminal_investigation": "The event is related to justice. The event occurs when an authority, called the Investigator, conducts an inquiry to determine the circumstances surrounding an Incident committed by a Suspect.",
    "Hiding_objects": "The event is related to someone causing a hidden object to become perceptually inaccessible. This is accomplished by placing the object in a hiding place or by putting in place an obstruction that screens the object.",
    "Confronting_problem": "The event is related to a person becoming involved in a problem which has negative consequences for them. The person will normally respond to resolve the problem.",
    "Renting": "The event is related to transaction. The event occurs when a Lessee gains the use of Goods owned by a Lessor by payment to the Lessor.",
    "Breathing": "The event is related to life and an agent causing air to move in a direction, usually specifying either in or out of the body.",
    "Patrolling": "The event is related to movement. The event occurs when an individual or group moves through and examines a ground in order to ensure that it is in a generally desired state of affairs, particularly that it is safe and contains no dangerous unwanted entity. Rather than moving through the ground, the patrol may simply move such that all the relevant portions of ground can be observed and checked.",
    "Arrest": "The event is related to justice. The event occurs when authorities charge a Suspect, who is under suspicion of having committed a crime (the Charges), and take him/her into custody. The police arrested Harry on charges of manslaughter.",
    "Convincing": "The event is related to persuasion and someone successfully convinces another person to believe or plan to execute a specific idea or action. The persuasion is typically related to a course of action and implies that the person being convinced has formed an intention to act in accordance with the idea or action. This event does not imply that the person actually acts upon the intention formed. The act of convincing can involve the adoption of a belief, which may be expressed as a that-clause or as an of-PP complement.",
    "Commerce_sell": "The event is related to transaction. The event occurs when a seller exchanges goods for money with a buyer. The typical patterns for this event include the seller selling goods to the buyer for money.",
    "Cure": "The event is related to life and involves a Healer treating and curing an Affliction (the injuries, disease, or pain) of the Patient. It may also mention the use of a specific Treatment or Medication. This event differs from Medical_intervention in that it specifically focuses on cases where the Patient is completely cured of the Affliction, rather than just being treated for it.",
    "Temporary_stay": "The event is related to someone staying temporarily at a location that is not their permanent residence. The person staying is often a guest and the location is typically the permanent residence of a host.",
    "Dispersal": "The event is related to movement. The event occurs when an agent or a cause disperses or scatters individuals from a source, a relatively confined space, to the goal area, a broader space.",
    "Collaboration": "The event is related to a partnership between Partner_1 and Partner_2, or a group of Partners, who work together in some Undertaking. The Partners are considered to be of equal status, even when expressed separately.",
    "Extradition": "The event is related to justice. The event occurs when a suspect in a current jurisdiction is forced by authorities (of the current jurisdiction) to go to the crime jurisdiction, i.e. the jurisdiction which requested that the suspect be handed over for trial for a crime which he or she is suspected to have committed in the crime jurisdiction. The purpose or reason for the extradition may also be expressed.",
    "Change_sentiment": "The event is related to an intentional action where an Agent seeks to bring about an internal mental or emotional state in the Experiencer. This event frame is closely related to Experiencer_obj.",
    "Commitment": "The event is related to communication. The event occurs when a speaker makes a commitment to an addressee to carry out some future action. This action may be desirable (as with a promise) or not desirable (as with a threat) to the addressee. This event allows for the expression of an addressee.",
    "Commerce_pay": "The event is related to transaction. The event occurs when buyers pay money for goods. In this event, the money is the direct object and is mapped to the theme of the transfer.",
    "Filling": "The event is related to pouring or placing a substance into a container or covering an area. The act of filling can be done with one or multiple things, referred to as the Theme. The container or area being filled is the Goal, as it is the intended destination of the substance. The Goal is also affected in a significant way as a result of the filling, distinguishing it from goals in other events.",
    "Becoming": "The event is related to a change in an entity's characteristics or qualities. The entity ends up with a new fact or meets the conditions to be classified as a member of a final category.",
    "Achieve": "The event is related to the Agent's efforts towards a Goal. After a certain period of time, the Agent successfully manages to attain the Goal, which may be a desired state or conceptualized as an event.",
    "Practice": "The event is related to an agent enacting an action that is intended to be performed again at one or more later occasions. The goal of practicing is to ensure that the action at the later occasion(s) comes off flawlessly.",
    "Cause_change_of_strength": "The event is related to an Agent causing a change in the strength of a Patient, often resulting in something that is more secure and safe.",
    "Supply": "The event is related to transaction. The event occurs when a Supplier gives a Theme to a Recipient to fulfill a need or purpose (Imposed_purpose) of the Recipient.",
    "Cause_to_amalgamate": "The event is related to the formation of a whole entity by combining different parts. The process involves an agent joining the parts together, resulting in the loss of individuality of the parts in the whole entity.",
    "Scouring": "The event is related to searching. The event occurs when a Searcher looks all over a Ground in order to find a Sought_entity. The Sought_entity is not presupposed to exist. The search activity is not concerned with the state of the Ground, which is the case in the Inspecting frame, but only with the finding of the Sought_entity, which is desirable.",
    "Violence": "The event is related to conflict and some violent physical act. The act is characterized by causing injury or harm to a victim or multiple aggressors causing harm to each other.",
    "Reforming_a_system": "The event is related to change and improvement. The event occurs when an agent or a non-agentive cause takes steps to modify the structure of a complex entity with interdependent parts, such as an institution or a system of laws. The degree of change is typically gradual and partial, aiming to enhance the functioning of the entity. The entity undergoing reform can be explicitly mentioned or implied when it is the same as the agent involved.",
    "Come_together": "The event is related to a group of individuals meeting and forming a configuration. The individuals or the configuration may be expressed as the external argument of the predicates in this event. In this event, it is ambiguous whether or not the individuals intentionally come together. In an alternative perspective, a grammatically more prominent party congregates with another party, expressed as an oblique phrase. If this asymmetric perspective is chosen, purpose relates only to the first party.",
    "Wearing": "The event is related to appearance and clothing. The words in this frame refer to what clothing the wearer (or a specific body part of the wearer) has on.",
    "Cause_to_make_progress": "The event is related to someone or something working on a specific project with the intention of advancing it and making it more desirable.",
    "Legality": "The event is related to the status of an action with respect to a code of laws or rules. An object may also be in violation or compliance of the code by virtue of its existence, location, or possession.",
    "Employment": "The event is related to a person being employed by an organization. The event occurs when an employee is given a position to work in a particular field or on a specific task, and in return, the employer provides compensation to the employee.",
    "Rite": "The event is related to religious or traditional rituals.",
    "Publishing": "The event is related to communication and sharing of information. It occurs when a Publisher makes a Work of an Author (or authors) available to some public Audience for general enjoyment, examination, and reference. The Medium of a Work can vary, such as books, TV programs, movies, and radio shows. Publication normally involves a number of other events, such as editing and advertising of the Work, and mass production and sales of a representation of the Work. In the most elaborated version of publication, there are a number of other potential roles, such as editor, publicist/advertizer, distributor, printer, etc., but none of these show up as separate, syntactically distinguished roles for the LUs in this frame.",
    "Adducing": "The event is related to communication. The event occurs when a Speaker mentions a Specified_entity filling a Role, thereby providing information which supports a point of the Speaker.",
    "Exchange": "The event is related to transaction. The event occurs when two parties, the Exchangers, each give and receive from the other Themes. The parties are also construable separately as Exchanger_1 and Exchanger_2, in which case the Themes may be construed separately, too, as Theme_1 and Theme_2.",
    "Exchange_currency": "The event is related to transaction. The event occurs when a Money_owner exchanges Sum_1 in the Source_currency for Sum_2 in the Target_currency at some Exchange_service.",
    "Ratification": "The event is related to a decision made by a Ratifier. The Ratifier responds to a Proposal constructed by another party to make it binding over the Ratifier's jurisdiction or constituency.",
    "Sign_agreement": "The event is related to a person, known as the Signatory, signing an Agreement document. By signing the Agreement, the Signatory voluntarily takes on a commitment that is specified in the Agreement.",
    "Commerce_buy": "The event is related to a commercial transaction. The event occurs when a buyer purchases goods or services from a seller in exchange for money. This event is viewed from the perspective of the buyer. The verb BUY is commonly used to describe this event, with variations in the patterns of frame element realization.",
    "Imposing_obligation": "The event is related to the imposition of a duty on a responsible party. This duty is imposed according to a principle that regulates how the responsible party should respond to a situation. The situation may be expressed metonymically by reference to an obligator, whose action invokes the principle. It is only rarely the case that the principle and the situation/obligator are both expressed overtly.",
    "Rewards_and_punishments": "The event is related to an agent (the punisher or rewarder) taking a specific action (response action) towards an evaluee in response to the evaluee's actions or beliefs. This action is taken for a specific reason. Means and instruments used in this event may also be indicated.",
    "Institutionalization": "The event is related to health and the placement of a patient in a medical facility by a proper authority. Whether or not the patient consents to their placement, the authority determines that it is in the best interest of the patient or their environment for them to receive treatment in the facility.",
    "Testing": "The event is related to evaluating the functionality and performance of a product. A tester uses the product to determine its effectiveness and any flaws or unwanted characteristics it may have. The testing is conducted under specific circumstances that are relevant to the product's functioning.",
    "Examination": "The event is related to education and knowledge assessment. It involves an examiner conducting a test or examination to evaluate an examinee's knowledge or skills in a specific area. The purpose of the examination is to determine the examinee's qualification for a privilege or to assess their level of expertise. This can be done through the examinee demonstrating skills or by writing responses to questions.",
    "Ingestion": "The event is related to life and involves an Ingestor consuming food or drink (Ingestibles). The act entails putting the Ingestibles in the mouth for delivery to the digestive system. This event may also involve the use of an Instrument. Sentences that describe the provision of food to others are NOT included in this frame.",
    "Labeling": "The event is related to communication. The event occurs when a speaker uses a label to refer to an entity. The label is not a conventional name for the entity but a description categorizing the entity and thereby expressing a judgment.",
    "Kidnapping": "The event is related to conflict and involves a Perpetrator forcibly carrying off and holding the Victim against their will.",
    "Submitting_documents": "The event is related to paperwork and an individual, referred to as the 'Submittor', provides official documents to an 'Authority'. These documents are intended to be used in an application, evaluation, or any other bureaucratic or official process, where they will be reviewed and processed.",
    "Prison": "The event is related to penal institutions. It is run by an operator and may be intended to hold certain kinds of inmates. Penal institutions may have a special name and their location may also be indicated.",
    "Justifying": "The event is related to a Judge evaluating an Agent's Act, omission, or the obtaining of a State_of_affairs, which is deemed to be a violation of an obligation or moral guideline. The Agent provides a Reason to justify why the Act, omission, or State_of_affairs was legally permissible despite initial appearances.",
    "Emergency": "The event is related to a situation or state of affairs where immediate action is required to prevent an undesired event from occurring. The focus of this event is often on an entity that is affected by the undesired event, rather than the event itself, and this entity is mentioned in its place.",
    "Terrorism": "The event is related to conflict and some violent or harmful act committed by a terrorist upon a victim. The act is carried out with the intention of coercing or terrorizing a government or populace and may be motivated by political or ideological reasons. It is primarily directed towards civilians rather than government or military officials. This event is a violation of one or many laws.",
    "Vocalizations": "The event is related to communicating through vocal sounds made by animate entities using their vocal tracts. This can include sounds produced by animals, humans, or any other living creatures. This frame also includes descriptions of sounds produced by artifacts that imitate or simulate vocalizations, as well as figurative language that refers to vocalizing actions.",
    "Risk": "The event is related to an Agent performing an Action which is considered imprudent. This frame is distinct from Attempt in that the danger that the Agent puts themselves in by performing the Action is profiled. The danger is not spelled out, but generally the Action has a possibility or likelihood of causing social or physical harm to the Agent.",
    "Resolve_problem": "The event is related to problem-solving. The event occurs when an agent or a non-agentive cause finds a solution, explanation, or answer to an outstanding problem. The means, degree, time, and place of the resolution may also be expressed.",
    "Revenge": "The event is related to conflict and the infliction of punishment in return for a wrong suffered. The event occurs when an Avenger performs a Punishment on an Offender as a consequence of an earlier action by the Offender, the Injury. The Avenger inflicting the Punishment need not be the same as the Injured Party who suffered the Injury, but the Avenger does have to share the judgment that the Offender's action was wrong. The judgment that the Offender had inflicted an Injury is made without regard to the law.",
    "Limiting": "The event is related to an agent or cause imposing restrictions on a range of options, determining the acceptable types or quantities of the options. The degree of limitation may also be mentioned.",
    "Research": "The event is related to knowledge acquisition. The event occurs when a researcher, individual, group, or institution attempts to answer a question by consulting literature, conducting experiments, or making observations in a particular field that is relevant to the question. The question may be underspecified and presented as a topic.",
    "Having_or_lacking_access": "The event is related to a Theme having access to a Useful_location or being blocked from it by a Barrier.",
    "Theft": "The event is related to crime and involves a perpetrator taking goods from a victim or a source. The event may involve the use of certain means to accomplish the theft.",
    "Incident": "The event is related to a state or event that holds or occurs, and is presented as being causally independent of other (implicit) states or events that might otherwise have been expected to be causally related to the event. The Time or Place may also be mentioned.",
    "Award": "The event is related to recognition or acknowledgement. The event occurs when a state of affairs exists that justifies a specific action. The agent who is justified in taking the suggested action is not physically present at the immediate scene."
}