{
  "Know": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"Words in this frame have to do with a Cognizer adding some Phenomenon to their model of the world. They are similar to Coming-to-believe words, except the latter generally involve reasoning from Evidence.\"",
    "Response": [
      "In this frame, the words pertain to a Cognizer incorporating a Phenomenon into their perception of the world. These words are alike Coming-to-believe words, but the latter usually entail logical deductions based on Evidence.",
      "The words within this framework relate to a Cognizer including a Phenomenon in their understanding of the world. Similar to Coming-to-believe words, except the latter often involve logical reasoning derived from Evidence.",
      "Within this context, the words are associated with a Cognizer integrating a Phenomenon into their worldview. They resemble Coming-to-believe words, though the latter typically require deductive reasoning based on Evidence.",
      "The words contained within this context revolve around a Cognizer incorporating a Phenomenon into their conceptualization of the world. Comparable to Coming-to-believe words, except the latter frequently involve inferential reasoning from Evidence.",
      "In this particular scenario, the words correlate with a Cognizer adding a Phenomenon to their model of the world. They share similarities with Coming-to-believe words, although the latter generally require logical deliberation based on Evidence."
    ]
  },
  "Warning": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Speaker warns an Addressee by giving a Message that describes an undesirable situation that may affect the Addressee. The warning may alternatively be described as about Topic pertaining to the undesirable situation, or issued via a specific Medium.\"",
    "Response": [
      "The Addressee is warned by the Speaker through a Message that details an unfavorable scenario that could impact the Addressee.",
      "The Speaker sends a warning to the Addressee by conveying a Message that illustrates an undesirable situation that might have consequences for the Addressee.",
      "By delivering a Message outlining an unfavorable situation, the Speaker gives a warning to the Addressee about a matter that concerns the same situation.",
      "The Speaker issues a warning to the Addressee, either directly through a Message or indirectly through a specific Medium, by describing an undesirable situation that could potentially affect the Addressee.",
      "In order to caution the Addressee, the Speaker describes an undesirable situation through a Message that highlights the possible consequences, which can also be seen as a warning about the particular Topic or conveyed through a specific Medium."
    ]
  },
  "Catastrophe": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"The words in this frame involve an Undesirable_event which affects the Patient negatively.  No agent need be involved.  The first calamity was a disastrous trade war with Holland.  It is sad to have to make a living by grubbing around in the dirt of a national calamity.  The result has been catastrophic.\"",
    "Response": [
      "An Undesirable_event that has a negative impact on the Patient is depicted by the words contained in this frame. There is no necessity for an agent to be involved. The initial calamity manifested as a trade war gone wrong with Holland. Earning a livelihood through dealing with the aftermath of a national calamity is disheartening. The outcome has been utterly catastrophic.",
      "The words in this frame illustrate a negative event that is deemed undesirable, impacting the Patient in an adverse manner. It does not require any involvement from an agent. The disastrous trade war with Holland served as the first calamity. It is truly saddening to rely on self-sustenance earned from grappling with the consequences of a national calamity. The overall result has been nothing short of catastrophic.",
      "The words enclosed in this frame pertain to an Unfavorable_occurrence, leading to a negative impact on the Patient. No agent's intervention is necessary. The initial calamity arose as a result of a disastrous trade war with Holland. Wallowing in the misfortune of a national calamity while earning a living is disheartening. The outcome has been catastrophic.",
      "An Undesirable_event that adversely affects the Patient is depicted through the words present in this frame. The involvement of an agent is not required. The first calamity unfolded in the form of a disastrous trade war with Holland. It is disheartening to make a livelihood by engaging with the aftermath of a national calamity. The effect has been catastrophic overall.",
      "The words contained within this frame describe an Unfavorable_event that has a detrimental impact on the Patient. There is no necessity for participation from an agent. The primary calamity was a disastrous trade war with Holland. Engaging in activities to sustain oneself amidst the consequences of a national calamity is a disheartening reality. The ultimate outcome has been catastrophic."
    ]
  },
  "Placing": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"Generally without overall (translational) motion,  an Agent places a Theme at a location, the Goal, which is profiled.  In this frame, the Theme is under the control of the Agent/Cause at the time of its arrival at the Goal.\"",
    "Response": [
      "An Agent normally places a Theme at a profiled location, the Goal, without any overall (translational) movement. During this process, the Agent/Cause has control over the Theme as it reaches the Goal.",
      "In the absence of any overall (translational) motion, a Theme is positioned by an Agent at a specific location, referred to as the Goal, which is highlighted. In this scenario, the Agent/Cause holds authority over the Theme until it reaches the Goal.",
      "Without any general (translational) movement, an Agent is responsible for placing a Theme at a location known as the Goal, which is portrayed. As per this perspective, the Theme remains under the control of the Agent/Cause until it arrives at the Goal.",
      "Typically, there is no overall (translational) motion involved when an Agent positions a Theme at a specified location, the Goal, which is made prominent. The Agent/Cause, during this process, maintains control over the Theme until it reaches the Goal.",
      "When there is no prevailing (translational) motion, an Agent places a Theme at a designated location, the Goal being profiled. In this framework, the Agent/Cause exercises control over the Theme at the moment of its arrival at the Goal."
    ]
  },
  "Causation": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Cause causes an Effect.  Alternatively, an Actor, a participant of a (implicit) Cause, may stand in for the Cause.  The entity Affected by the Causation may stand in for the overall Effect situation or event.\"",
    "Response": [
      "An Effect is caused by a Cause. In another scenario, a participant known as an Actor may substitute for the Cause, which is implicit. The entity that is Affected by the Causation can represent the entire situation or event of the Effect.",
      "When a Cause occurs, it leads to an Effect. However, the Cause can be replaced by an Actor who is involved in the Cause. Moreover, the entity that is Affected by the Causation can be a representation of the overall situation or event caused by the Effect.",
      "The occurrence of a Cause brings about an Effect. Alternatively, an Actor can take the place of the Cause as a participant. Furthermore, the entity that is impacted by the Causation can act as a substitute for the overall situation or event resulting from the Effect.",
      "An Effect is the result of a Cause. However, in certain cases, an Actor may replace the Cause as a participant. Additionally, the entity Affected by the Causation can be a stand-in for the entire situation or event caused by the Effect.",
      "Cause and Effect go hand in hand. On the other hand, an Actor can act as a substitute for the Cause, which is implied. The entity Affected by the Causation can also be a representation of the overall Effect situation or event."
    ]
  },
  "Arriving": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An object Theme moves in the direction of a Goal. The Goal may be expressed or it may be understood from context, but its is always implied by the verb itself.\"",
    "Response": [
      "The object Theme progress towards a Goal as it moves. The Goal could either be stated or inferred based on the context, but it is always implied by the verb itself.",
      "A Goal is implied by the verb itself as an object Theme moves in its direction. The Goal may either be explicitly expressed or deduced from the context.",
      "In the process of moving, an object Theme is directed towards a Goal. The Goal can be either explicitly stated or inferred based on the verb itself.",
      "The movement of an object Theme is always accompanied by a Goal towards which it progresses. This Goal can be understood either through explicit expression or inferred from the surrounding context.",
      "As an object Theme moves, it inherently harbors a Goal in the direction of which it advances. The Goal can be expressed directly or subtly implied based on the verb itself."
    ]
  },
  "Commerce_money-transfer": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"The subframe of the Commercial_transaction frame which involves the transfer of Money from the Buyer to the Seller (in exchange for the Goods).\"",
    "Response": [
      "The transfer of money from the Buyer to the Seller in exchange for the Goods is part of the subframe of the Commercial_transaction frame.",
      "In the Commercial_transaction frame, the subframe includes the transfer of Money from the Buyer to the Seller as a form of exchange for the Goods.",
      "The subframe within the Commercial_transaction frame pertains to the transfer of Money from the Buyer to the Seller in return for the Goods.",
      "As part of the Commercial_transaction frame, the subframe encompasses the exchange of Money from the Buyer to the Seller for the Goods.",
      "Within the Commercial_transaction frame, the subframe focuses on the transfer of Money from the Buyer to the Seller as payment for the Goods."
    ]
  },
  "Sending": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Sender plans the Path (along with Source and Goal) of a Theme and places it in circumstances such that it travels along this Path under the power of some entity other than the Sender.  This frame also has a Recipient distinct from the Goal, as both can be present:\"",
    "Response": [
      "The Path of a Theme is planned by a Sender, along with the Source and Goal, and it is then placed in circumstances where it travels under the control of a different entity than the Sender. Additionally, this frame includes a distinct Recipient alongside the Goal, as both can coexist.",
      "In planning the Path of a Theme, a Sender carefully considers the Source, Goal, and circumstances in which it will travel. The Theme is then entrusted to an external entity for its journey, while a distinct Recipient is also accounted for, alongside the Goal.",
      "When determining the Path of a Theme, a Sender takes into account the Source, Goal, and appropriate circumstances. Subsequently, the Theme is set in motion with the assistance of another entity, while both the Goal and a separate Recipient can be simultaneously involved.",
      "The Path of a Theme is charted by a Sender, who also considers the Source and Goal, and then situates it in specific circumstances. This allows the Theme to be propelled forward by an entity other than the Sender, while still maintaining a separate Recipient in addition to the Goal.",
      "A Sender carefully plans the Path of a Theme, in conjunction with the Source and Goal, and creates circumstances that facilitate its movement under the influence of an external entity. Notably, there is also a distinct Recipient present, alongside the Goal."
    ]
  },
  "Protest": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Arguer presents a Content, along with Support, to an Addressee.  The Content may refer elliptically to a course of action or it may refer to a proposition that the Addressee is to believe.  Some lexical units (e.g. \"prove\") indicate the speaker's belief about the Content.Jan argued that the evidence was inadmissable.Jan argued against the admissability of the evidence.Jan proved  that the evidence was inadmissable.\"",
    "Response": [
      "The Arguer, presenting a Content to an Addressee, provides Support alongside it. The Content could either indirectly suggest a course of action or refer to a proposition that the Addressee should believe. Certain words, such as \"prove,\" express the speaker's belief about the Content. For example, Jan argued that the evidence was inadmissible.",
      "In the act of arguing, an individual known as the Arguer conveys a Content to an Addressee, accompanied by Support. The Content may be phrased in a way that indirectly points towards a specific action, or it may ask the Addressee to accept a particular proposition. The speaker's belief about the Content can be inferred from certain words used, like \"prove.\" An instance of this is Jan arguing against the admissibility of the evidence.",
      "When engaged in an argument, the Arguer presents a Content to an Addressee, providing Support along with it. The Content could either allude to a suggested course of action or a proposition aimed at convincing the Addressee. The Arguer's belief about the Content can sometimes be deduced from certain lexical units, such as the word \"prove.\" For example, Jan proved that the evidence was inadmissible.",
      "The act of arguing involves the Arguer offering a Content and Support to an Addressee. The Content may contain an indirect reference to a particular course of action or a proposition that the Addressee is expected to believe. Specific words, like \"prove,\" reveal the speaker's belief about the Content. For instance, Jan argued against the admissibility of the evidence.",
      "In an argument, the Arguer puts forward a Content to the Addressee, elaborating it with Support. The Content might indirectly indicate a recommended action or a proposition intended to be accepted by the Addressee. The speaker's belief about the Content can be inferred from selected lexical units, such as the term \"prove.\" An illustration of this is Jan arguing that the evidence was inadmissible."
    ]
  },
  "Preventing_or_letting": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Potential_hindrance or an Agent (via their actions) keeps an Event from taking place, or despite the possibility of prevent the Event, do not do so. Lexical units which indicate that the event is not prevented, e.g. allow.v, are marked with the semantic type \"Negative\".  Some lexical units, like avert and avoid indicate that the Potential_hindrance or Agent would have been affected if the Event occurred.\"",
    "Response": [
      "An Event may be prevented by a Potential_hindrance or an Agent through their actions.",
      "The Event is not allowed to occur despite the possibility of prevention.",
      "Lexical units marked with the semantic type \"Negative\" indicate that the Event is not prevented.",
      "Some lexical units, such as avert and avoid, suggest that the Potential_hindrance or Agent would have been impacted if the Event had happened.",
      "The Event is either hindered by a Potential_hindrance or Agent, or their actions prevent it. However, some lexical units with the semantic type \"Negative\" indicate that the Event is not prevented. In addition, there are lexical units like avert and avoid that imply the Potential_hindrance or Agent would be affected by the Event if it were to occur."
    ]
  },
  "Motion": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"Some entity (Theme) starts out in one place (Source) and ends up in some other place (Goal), having covered some space between the two (Path). Alternatively, the Area or Directionin which the Theme moves or the Distance of the movement may be mentioned.\"",
    "Response": [
      "The Theme begins its journey in a particular Source and ultimately arrives at a different Goal, having traversed a distance between the two locations along a Path. Additionally, the passage may include reference to the Area or Direction in which the Theme is moving or the Distance it travels.",
      "From a certain Source, the Theme embarks on a journey and eventually reaches a distinct Goal, having traversed a specific Path that spans a certain distance. Alternatively, the passage may provide information about the Area or Direction of the Theme's movement.",
      "Starting from one location (Source), an entity (Theme) undergoes a transition and concludes its journey in another place (Goal), covering a specific distance along a Path. Alternatively, the passage may acknowledge the Area or Direction of the Theme's movement.",
      "A particular Theme commences its trajectory at a designated Source and eventually arrives at a distinct Goal, after moving across an intermediate distance along a specified Path. Alternatively, the passage may allude to the Area or Direction of the Theme's movement.",
      "The Theme initiates its expedition from a given Source and eventually arrives at a separate Goal, having traversed a distance between the two locations along a designated Path. Additionally, the passage may mention the Area or Direction in which the Theme is moving or the Distance it covers."
    ]
  },
  "Temporary_leave": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Person takes leave from his or her routine Activity (such as work or school) for a Duration of time.  The Duration can be any length of time, as long as the absence is temporary.\"",
    "Response": [
      "An individual temporarily takes a break from their usual daily tasks, be it work or school, for a certain period of time.",
      "People often opt for a break from their regular commitments, whether it's work or school, to step away for a specific duration.",
      "Taking a leave from one's routine activities, such as work or school, is a temporary absence that can vary in length.",
      "Individuals occasionally require a pause from their customary tasks, like work or school, for a specific duration, as long as it is not a permanent absence.",
      "A person may need to temporarily step away from their regular activities, such as work or school, for any period of time, as long as it is not a permanent departure."
    ]
  },
  "Damaging": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Agent affects a Patient in such a way that the Patient (or some Subregion of the Patient) ends up in a non-canonical state.  Often this non-canonical state is undesirable, and some lexical units (marked with the Negative semantic type) specifically indicate that the Patient is negatively affected.  Some lexical units of this frame indicate by what means the Patient is altered (e.g., scrape.v) and in some cases give some indication of the detailed effect on the Patient (e.g., score.v, chip.v), and in other cases, both are specified (tear.v). For another set of lexical units, the action and its result are much less specified (e.g., damage.v).\"",
    "Response": [
      "The Patient (or some Subregion of the Patient) ends up in a non-canonical state as a result of the Agent's impact, which is often undesirable. Some lexical units specifically marked with the Negative semantic type indicate that the Patient is negatively affected.",
      "The Patient (or a portion of the Patient) is affected by an Agent, resulting in a non-canonical state. Usually, this non-canonical state is undesirable, and certain lexical units, marked with the Negative semantic type, indicate that the Patient is negatively impacted.",
      "In such a way that the Patient (or some Subregion of the Patient) ends up in a non-canonical state, an Agent influences the Patient. The non-canonical state is often undesirable, and the Negative semantic type identifies certain lexical units that indicate the negative impact on the Patient.",
      "The Patient (or some Subregion of the Patient) is placed in a non-canonical state by an Agent. This non-canonical state is frequently undesirable, and lexical units with the Negative semantic type specifically convey that the Patient is negatively affected.",
      "A non-canonical state is attained by the Patient (or some Subregion of the Patient) through the impact of an Agent. Often, this non-canonical state is undesirable, and the Negative semantic type designates certain lexical units that signify the Patient's negative impact."
    ]
  },
  "Destroying": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Destroyer (a conscious entity) or Cause (an event, or an entity involved in such an event) affects the Patient negatively so that the Patient no longer exists.  An asteroid obliterated the dinosaurs.\"",
    "Response": [
      "The Patient ceases to exist due to the negative impact of a Destroyer or Cause, be it an event or entity involved in said event. The extinction of dinosaurs was caused by an asteroid.",
      "The Patient is eliminated as a result of the adverse influence exerted by either a Destroyer or a Cause, which can be an event or an entity associated with the event itself. The dinosaurs were eradicated by an asteroid.",
      "By negatively affecting the Patient, a Destroyer (a conscious entity) or a Cause (an event or entity implicated in such an event) causes the elimination of the Patient. The extinction of dinosaurs was a consequence of an asteroid impact.",
      "The Patient ceases to exist due to the detrimental influence caused by either a Destroyer or a Cause, which can be an event or an entity involved in that event. The dinosaurs were obliterated by an asteroid.",
      "The elimination of the Patient occurs as a result of the adverse impact caused by a Destroyer or Cause, whether it is an event or an entity engaged in such event. An asteroid caused the extinction of dinosaurs."
    ]
  },
  "Death": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"The words in this frame describe the death of a Protagonist.  A Cause of death may also be expressed obliquely.\"",
    "Response": [
      "The death of a Protagonist is described by the words in this frame, with the possibility of expressing a Cause of death in an indirect manner.",
      "Within this frame, the death of a Protagonist is depicted through the words, occasionally implying the Cause of death indirectly.",
      "Words within this frame are utilized to portray the demise of a Protagonist, allowing for the potential of hinting at the Cause of death in a roundabout manner.",
      "The description of the death of a Protagonist is conveyed through the words contained within this frame, offering the opportunity to subtly express the Cause of death as well.",
      "The words enclosed in this frame serve to illustrate the passing of a Protagonist, permitting the inclusion of an indirectly expressed Cause of death."
    ]
  },
  "Perception_active": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"This frame contains perception words whose perceivers intentionally direct their attention to some entity or phenomenon in order to have a perceptual experience.  For this reason we call the perceiver role in this frame Perceiver_agentive.\"",
    "Response": [
      "In order to have a perceptual experience, the perceivers intentionally direct their attention towards a specific entity or phenomenon, which is why we refer to the role of the perceiver in this frame as Perceiver_agentive.",
      "The Perceiver_agentive role in this frame refers to those who intentionally focus their attention on a particular entity or phenomenon, aiming to have a perceptual experience.",
      "The frame in question contains perception words, where the individuals deliberately choose to direct their attention towards a specific entity or phenomenon, with the purpose of having a perceptual experience. Hence, the role of the perceiver in this frame is called Perceiver_agentive.",
      "The individuals in this frame deliberately shift their attention towards a particular entity or phenomenon, with the goal of experiencing it perceptually. This is why we refer to the role of the perceiver as Perceiver_agentive.",
      "Perceiver_agentive is the term used to describe the role of individuals in this frame who intentionally focus their attention on a specific entity or phenomenon, with the aim of having a perceptual experience."
    ]
  },
  "Presence": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Entity exists at a particular Location, at a particular Time, as observed by an implicit observer. A Depictive and/or Duration phrase is often found.\"",
    "Response": [
      "At a specific moment in time, an Entity is present in a particular Location, observed by an implicit observer, typically accompanied by a Depictive and/or Duration phrase.",
      "An implicit observer notices that at a certain Time, an Entity exists in a specific Location, oftentimes described by a Depictive and/or Duration phrase.",
      "A particular Entity is observed by an implied observer to be in a specific Location at a given Time, frequently accompanied by a Depictive and/or Duration phrase.",
      "The presence of an Entity in a specific Location at a particular Time is acknowledged by an implicit observer, with a Depictive and/or Duration phrase often included.",
      "An implicit observer perceives the existence of an Entity at a specific Time and Location, commonly with a Depictive and/or Duration phrase."
    ]
  },
  "Influence": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Agent, Situation or Entity has an influence on a Cognizer. The influence may be general; or it may be manifested in the Cognizer's engaging in an Action as a consequence of the influence; or the Cognizer may be influenced in how they carry out a Behavior that they are engaged in already. Alternatively, a Product may be specified whose production or design was influenced by the Cognizer's experience of the  Situation or Entity.\"",
    "Response": [
      "A Cognizer can be influenced by an Agent, Situation, or Entity. The influence can be general or lead to the Cognizer engaging in an Action. It can also affect how the Cognizer carries out a Behavior. On the other hand, a Product's production or design may be influenced by the Cognizer's experience of the Situation or Entity.",
      "The Cognizer can be affected by an Agent, Situation, or Entity. This influence can be broad or specifically result in the Cognizer taking an Action. It can also impact how the Cognizer executes a Behavior. Alternatively, the Cognizer's encounter with the Situation or Entity can influence the production or design of a specific Product.",
      "The Cognizer may experience an influence from an Agent, Situation, or Entity. This influence can be general or lead to the Cognizer undertaking an Action. It can also alter how the Cognizer carries out a Behavior. Conversely, the Cognizer's interaction with the Situation or Entity may influence the production or design of a particular Product.",
      "An Agent, Situation, or Entity can exert influence over a Cognizer. This influence can be broad or result in the Cognizer engaging in an Action. It can also impact how the Cognizer performs a Behavior. On the other hand, the Cognizer's encounter with the Situation or Entity can influence the production or design of a specific Product.",
      "A Cognizer can be impacted by an Agent, Situation, or Entity. Such impact can be general or lead to the Cognizer's involvement in an Action. It can also influence how the Cognizer carries out a Behavior. Alternatively, the Cognizer's experience of the Situation or Entity can influence the production or design of a particular Product."
    ]
  },
  "Receiving": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Recipient comes into possession of the Theme as a result of the joint action of the Donor and the Recipient.  The Receiving frame like the Giving frame requires that the Donor first has possession of the Theme and that following the transfer, the Donorno longer has the Theme and the Recipient does.\"",
    "Response": [
      "The Theme is obtained by the Recipient through the combined efforts of the Donor and the Recipient. The Giving frame and the Receiving frame share the same requirement that the Donor must initially possess the Theme. After the transfer, the Donor no longer possesses the Theme while the Recipient does.",
      "As a result of the collaboration between the Donor and the Recipient, the Theme falls into the possession of the Recipient. Both the Giving frame and the Receiving frame necessitate that the Donor possesses the Theme initially. Once the transfer occurs, the Donor relinquishes possession of the Theme while the Recipient gains it.",
      "The Theme is acquired by the Recipient through the joint actions of the Donor and the Recipient. Similar to the Giving frame, the Receiving frame mandates that the Donor has initial possession of the Theme. Subsequently, upon the transfer, the Donor loses possession of the Theme while the Recipient gains it.",
      "Through the collaborative efforts of the Donor and the Recipient, the Theme is obtained by the Recipient. In both the Giving frame and the Receiving frame, it is necessary for the Donor to have possession of the Theme initially. After the transfer, the Donor no longer retains the Theme while the Recipient does.",
      "The joint action of the Donor and the Recipient results in the Recipient coming into possession of the Theme. Similar to the Giving frame, the Receiving frame requires that the Donor initially possesses the Theme. Following the transfer, the Donor loses possession of the Theme while the Recipient gains it."
    ]
  },
  "Check": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Inspector attains a degree of certainty in the Unconfirmed_content, generally by inspecting some evidence.\"",
    "Response": [
      "Generally, an Inspector acquires a level of certainty in the Unconfirmed_content by examining certain evidence.",
      "By inspecting specific evidence, an Inspector typically achieves a certain level of certainty in the Unconfirmed_content.",
      "Usually, by examining evidence, an Inspector obtains a degree of certainty in the Unconfirmed_content.",
      "The Unconfirmed_content often becomes more certain as an Inspector inspects relevant evidence.",
      "In general, an Inspector establishes a level of certainty in the Unconfirmed_content through the inspection of evidence."
    ]
  },
  "Hostile_encounter": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"This frame consists of words that describe a hostile encounter between opposing forces (Side_1 and Side_2, collectively conceptualizable as Sides) over a disputed Issue and/or in order to reach a specific  Purpose.\"",
    "Response": [
      "To reach a specific purpose, this frame involves words that describe a hostile encounter between opposing forces, collectively known as Sides 1 and 2, who are engaged in a dispute over an issue.",
      "The description of a hostile encounter between opposing forces (Side 1 and Side 2), collectively referred to as Sides, is framed by words in order to achieve a specific purpose or resolve a dispute.",
      "Words are used in this frame to depict a hostile confrontation between opposing forces (known as Sides 1 and 2), which occurs either due to a disputed issue or with the intention of accomplishing a particular goal.",
      "Describing a contentious encounter between opposing forces, referred to as Sides 1 and 2, this frame utilizes words to either resolve a dispute or achieve a specific purpose.",
      "This frame utilizes words to portray a hostile encounter between opposing forces (Side 1 and Side 2), collectively known as Sides, either over a disputed issue or in pursuit of a specific purpose."
    ]
  },
  "Killing": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Killer or Cause causes the death of the Victim.\"",
    "Response": [
      "The death of the Victim is caused by a Killer or Cause.",
      "The Victim is killed by either a Killer or Cause.",
      "Either a Killer or Cause brings about the death of the Victim.",
      "When a Killer or Cause is present, it results in the death of the Victim.",
      "The Victim's death is a consequence of either a Killer or Cause."
    ]
  },
  "Conquering": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"This frame describes a Theme losing its autonomy and perhaps sustaining material damage as the result of a successful invasion on the behalf of a Conqueror.\"",
    "Response": [
      "A successful invasion by a Conqueror results in a Theme losing its autonomy and possibly suffering material damage, as described in this frame.",
      "The autonomy of a Theme is compromised and it may incur material damage when a Conqueror invades, as depicted in this frame.",
      "In this frame, we see a Theme losing its autonomy and experiencing material damage due to a successful invasion by a Conqueror.",
      "This frame illustrates the consequences of a victorious invasion by a Conqueror, with a Theme losing its autonomy and potentially suffering material damage.",
      "A Conqueror's triumph in invasion leads to a Theme losing its autonomy and potentially enduring material damage, as explained in this frame."
    ]
  },
  "Releasing": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Captor ends the captivity or inhibition of the motion of a Theme from the Location_of_confinement. The release is in accord with the plans of the Captor.\"",
    "Response": [
      "The Captor rescues the Theme from its confinement, putting an end to its captivity and restriction of movement in the Location_of_confinement, all in accordance with their plans.",
      "The Captor frees the Theme from its confinement in the Location_of_confinement, thereby releasing it from captivity and removing any restrictions on its motion, as planned.",
      "In compliance with their intentions, the Captor liberates the Theme from its captivity or limitation of movement in the Location_of_confinement.",
      "The Captor carries out their plans, resulting in the liberation of the Theme from the constraints on its motion in the Location_of_confinement.",
      "With the Captor's plan in mind, the Theme's captivity or suppression of motion in the Location_of_confinement is terminated as the release takes place."
    ]
  },
  "Attack": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Assailant physically attacks a Victim (which is usually but not always sentient), causing or intending to cause the Victim physical damage.   A Weapon used by the Assailant may also be mentioned, in addition to the usual Place, Time, Purpose, Explanation, etc.  Sometimes a location is used metonymically to stand for the Assailant or the Victim, and in such cases the Place FE will be annotated on a second FE layer.\"",
    "Response": [
      "The Victim, who may or may not be sentient, is physically assaulted by an Assailant with the intention of causing physical harm. The usual details such as the Place, Time, Purpose, and Explanation are included, and sometimes a Weapon is mentioned. In certain instances, a location is used as a metonymy for either the Assailant or the Victim, and this will be indicated on a separate FE layer.",
      "When an Assailant physically attacks a Victim, the intended outcome is to cause physical harm. The Victim, although usually sentient, may not always be. To provide more context, the typical details such as Place, Time, Purpose, and Explanation are specified, along with any mention of the Weapon used. Additionally, in some cases, the Place may symbolically represent either the Assailant or the Victim, denoted by the Place FE on a separate layer.",
      "Physical aggression occurs when an Assailant assaults a Victim, who is typically sentient but not always. The Assailant's objective is to inflict physical harm on the Victim. The passage also includes information about the Weapon used, as well as the customary details of Place, Time, Purpose, and Explanation. In specific instances, the Place may be employed metaphorically to represent either the Assailant or the Victim, with the Place FE indicated on a secondary layer.",
      "The intention of an Assailant is to physically attack a Victim, with the aim of causing them harm. Although the Victim is usually sentient, there are exceptions. The passage also provides additional information about the Weapon used, as well as the customary details of Place, Time, Purpose, and Explanation. In certain cases, the Place may be symbolically used to refer to either the Assailant or the Victim, and this will be marked with the Place FE on a second layer.",
      "A physical assault on a Victim by an Assailant is the focal point of the passage. The Assailant's objective is to cause harm to the Victim, who is typically sentient but not always. Along with the usual details of Place, Time, Purpose, and Explanation, the passage also mentions any Weapon used in the attack. Furthermore, there are instances where the Place may represent either the Assailant or the Victim metaphorically, and this is identified through the Place FE on a secondary layer."
    ]
  },
  "Earnings_and_losses": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Earner receives Earnings by providing Goods to a Buyer; providing the Goods also generally entails a cost, which may or may not be included in the consideration.  This frame emphasizes the effect on the Earner and often generalizes across an indefinite number of transactions with various parties.  Some of the LUs (e.g. earn.v) primarily refer to the to the Earnings without reference to cost, others to the amount the Earnings differ from the cost, emphasizing either a net loss (e.g. loss.n) or net gain (e.g. net.n).\"",
    "Response": [
      "Earnings are received by an Earner through the provision of Goods to a Buyer, with the possibility of including the cost within the consideration.",
      "The main focus of this frame is on the impact it has on the Earner, as it applies to multiple transactions with different parties.",
      "Certain LUs such as \"earn.v\" primarily pertain to Earnings without mentioning the cost, while others highlight the difference between Earnings and cost, emphasizing either a net loss (e.g. \"loss.n\") or net gain (e.g. \"net.n\").",
      "By offering Goods to a Buyer, an Earner acquires Earnings, which may or may not include the associated cost in the consideration.",
      "This frame underscores the implications for the Earner and is generally applicable to an indefinite number of transactions involving various parties. Furthermore, some lexical units (e.g. \"earn.v\") specifically denote Earnings, without considering the cost, while others highlight the disparity between Earnings and cost, accentuating either a net loss (e.g. \"loss.n\") or net gain (e.g. \"net.n\")."
    ]
  },
  "Choosing": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Cognizer decides upon the Chosen (either an item or a course of action) out of a set of  Possibilities .  The Cognizer may have an Inherent_purpose or a Larger_purpose for the Chosen.\"",
    "Response": [
      "From a set of Possibilities, a Cognizer makes a decision on the Chosen, which can be either an item or a course of action. The Cognizer's decision may be driven by an Inherent_purpose or a Larger_purpose for the Chosen.",
      "When faced with a set of Possibilities, a Cognizer selects the Chosen, which can be an item or a course of action. The decision-making process can be guided by either an Inherent_purpose or a Larger_purpose for the Chosen.",
      "One of the Possibilities is chosen by a Cognizer, who can decide on either an item or a course of action. The Chosen is determined based on either an Inherent_purpose or a Larger_purpose held by the Cognizer.",
      "Out of a range of Possibilities, a Cognizer makes a choice between the Chosen, which can be either an item or a course of action. The decision-making process is influenced by either an Inherent_purpose or a Larger_purpose associated with the Chosen.",
      "A Cognizer evaluates a set of Possibilities and ultimately selects the Chosen, which can either be an item or a course of action. The decision-making process is driven by either an Inherent_purpose or a Larger_purpose linked to the Chosen."
    ]
  },
  "Traveling": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Agent matches location with an Entity in order to fulfill some  Purpose.\"",
    "Response": [
      "In order to accomplish a certain Purpose, an Agent aligns location with an Entity.",
      "The matching of location with an Entity by an Agent is done to achieve a certain Purpose.",
      "An Entity is matched with a location by an Agent in order to fulfill a particular Purpose.",
      "To fulfill a Purpose, an Agent matches an Entity with a location.",
      "The objective of an Agent is to match location with an Entity for the purpose of fulfillment."
    ]
  },
  "Recovering": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"The action of an Agent or the occurrence of a Cause event returns an Entity to an earlier  state of vigor and strength.\"",
    "Response": [
      "An Agent or a Cause event brings back an Entity to a previous state of vigor and strength.",
      "The Entity's vigor and strength are restored by either an Agent's action or the occurrence of a Cause event.",
      "Returning an Entity to a previous state of vigor and strength is the result of either an Agent's action or the occurrence of a Cause event.",
      "An Entity can regain its previous vigor and strength when an Agent takes action or a Cause event happens.",
      "Vigor and strength of an Entity can be restored to an earlier state by either the action of an Agent or the occurrence of a Cause event."
    ]
  },
  "Using": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Agent manipulates an Instrument in order to achieve a Purpose.\"",
    "Response": [
      "To achieve a Purpose, an Agent manipulates an Instrument.",
      "The manipulation of an Instrument by an Agent is done in order to achieve a Purpose.",
      "An Instrument is manipulated by an Agent with the intention of achieving a Purpose.",
      "The achievement of a Purpose is the result of an Agent manipulating an Instrument.",
      "An Agent's purpose is achieved through the manipulation of an Instrument."
    ]
  },
  "Coming_to_be": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Entity comes into existence at a particular Place and Time which may take a certain Duration_of_endstate, have a Cause, or be formed from Components.\"",
    "Response": [
      "A certain Duration_of_endstate may accompany the emergence of an Entity at a specific Place and Time, caused by its formation from Components.",
      "The formation of an Entity can occur at a particular Place and Time, with the potential for a certain Duration_of_endstate or a Cause.",
      "At a specific Place and Time, an Entity can come into existence, whether it is formed from Components, has a Cause, or takes a certain Duration_of_endstate.",
      "Entities can be formed from Components, have a Cause, or take a certain Duration_of_endstate when they come into existence at a specific Place and Time.",
      "When an Entity is created, it can have a Cause, take a certain Duration_of_endstate, or be formed from Components at a particular Place and Time."
    ]
  },
  "Cause_to_be_included": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Agent or Cause makes a New_member part of  Group. The Group may be represented by an individual Existing_member if it implies the existence of a set of members.\"",
    "Response": [
      "A Group incorporates a New_member due to an Agent or Cause; the Group can be symbolized by an Existing_member if it suggests the presence of other members.",
      "The inclusion of a New_member into a Group is facilitated by an Agent or Cause; if the Group implies the existence of multiple members, it can be portrayed by an individual Existing_member.",
      "When a New_member joins a Group, it is because of an Agent or Cause; if the Group suggests the presence of a collection of members, it can be exemplified by an individual Existing_member.",
      "A Group becomes home to a New_member as a result of an Agent or Cause; if it suggests the existence of various members, it can be represented by an individual Existing_member.",
      "The addition of a New_member to a Group is influenced by an Agent or Cause; if the Group indicates the presence of a set of members, it can be illustrated by an individual Existing_member."
    ]
  },
  "Process_start": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Event begins at a certain Time and Place. Reason may also be indicated.  NB:  Refer to Event frame.\"",
    "Response": [
      "The commencement of an Event occurs at a specific Time and Place, with the possibility of also mentioning the Reason. NB: Make sure to consult the Event frame.",
      "A specific Time and Place mark the initiation of an Event, and there may also be an explanation provided. NB: Take a look at the Event frame.",
      "At a designated Time and Place, an Event commences and there is a potential for indicating the Reason. NB: Please refer to the Event frame.",
      "The start of an Event is set at a particular Time and Place, and it may be accompanied by a Reason. NB: Make sure to refer to the Event frame.",
      "An Event begins when a specific Time and Place are established, and there is also the possibility of indicating the Reason. NB: Please consult the Event frame."
    ]
  },
  "Change_event_time": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"In this frame, an Agent or Cause changes the timing of an Event. The Event will then take place at the Destination_time or with respect to a Destination_event. This can be done with by certain Means, in a certain Manner or to a certain Degree.\"",
    "Response": [
      "An Event can have its timing altered by an Agent or Cause within this framework. The Event will subsequently occur at the Destination_time or in relation to a Destination_event. This can be achieved using specific Means, in a specific Manner, or to a specific Degree.",
      "Within this frame, an Agent or Cause has the ability to modify the timing of an Event. As a result, the Event will either happen at the Destination_time or in relation to a Destination_event. This process can be accomplished through defined Means, in a particular Manner, or to a certain Degree.",
      "When operating within this framework, an Agent or Cause has the power to change the timing of an Event. Consequently, the Event will occur either at the Destination_time or with reference to a Destination_event. The means to achieve this can vary, including specific Means, a certain Manner, or a particular Degree.",
      "The timing of an Event can be shifted by an Agent or Cause in this frame. In turn, the Event will happen at the Destination_time or in relation to a Destination_event. This adjustment can be accomplished through the utilization of specific Means, in a specific Manner, or to a specific Degree.",
      "In this context, an Agent or Cause can manipulate the timing of an Event. In consequence, the Event will occur at either the Destination_time or in correlation to a Destination_event. The implementation of this alteration can be achieved through certain Means, a certain Manner, or a certain Degree."
    ]
  },
  "Reporting": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"In this frame an Informer informs the Authorities of the illegal or otherwise improper Behavior of the Wrongdoer.  Tony reported Michael to the police for breaking into his car.   The teacher reported the bathroom vandalism. DNI\"",
    "Response": [
      "The Informer informs the Authorities in this scenario about the illegal or otherwise improper Behavior of the Wrongdoer.",
      "Tony took the initiative to report Michael to the police after he broke into his car.",
      "The police were informed by Tony about Michael's car break-in.",
      "The Authorities were given information about the illegal actions of the Wrongdoer by the Informer.",
      "An example of this frame is when the teacher reported the bathroom vandalism."
    ]
  },
  "Bodily_harm": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"The words in this frame describe situations in which an Agent or a Cause injures a Victim. The Body_part of the Victim which is most directly affected may also be mentioned in the place of the Victim.  In such cases, the Victim is often indicated as a genitive modifier of the Body_part, in which case the Victim FE is indicated on a second FE layer.\"",
    "Response": [
      "Situations where a Victim is harmed by an Agent or a Cause are described by the words in this frame. The Body_part that is most directly affected by the harm may also be referenced instead of the Victim.",
      "Instances where an Agent or a Cause causes harm to a Victim are depicted in the words within this frame. The Victim's Body_part, which is directly impacted, may also be specified.",
      "The words contained in this frame are used to portray scenarios where an Agent or a Cause inflicts harm upon a Victim. The Victim's Body_part, which experiences the direct impact, can also be mentioned.",
      "Descriptions of situations involving the harming of a Victim by an Agent or a Cause are encompassed within the words in this frame. Alternatively, the specific Body_part affected by the harm may be indicated instead of the Victim.",
      "In this frame, the described scenarios involve the injury of a Victim by an Agent or a Cause. The Victim's Body_part, which is directly impacted, can also be denoted as a genitive modifier of the Body_part, with the Victim FE indicated on a second FE layer."
    ]
  },
  "Suspicion": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A person or group, the Authority, believes that another person, the Suspect is a participant in a criminal Incident.\"",
    "Response": [
      "The Authority, whether it be an individual or a group, suspects that the Suspect is involved in a criminal Incident.",
      "The Suspect is believed by the Authority, whether it is a person or a group, to be a participant in a criminal Incident.",
      "In the eyes of the Authority, whether it is a person or a group, the Suspect is considered to be involved in a criminal Incident.",
      "The Authority holds the belief that the Suspect, whether an individual or a group, is actively participating in a criminal Incident.",
      "Whether it is a group or an individual, the Authority harbors the belief that the Suspect is implicated in a criminal Incident."
    ]
  },
  "Statement": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"This frame contains verbs and nouns that communicate the act of a Speaker to address a Message to some Addressee using language. Instead of (or in addition to) a Speaker, a Medium may also be mentioned. Likewise, a Topic may be stated instead of a Message. A number of the words can be used performatively, such as declare and insist.\"",
    "Response": [
      "The act of a Speaker addressing a Message to an Addressee using language is conveyed by the verbs and nouns found in this frame.",
      "In addition to a Speaker, a Medium can also be mentioned in this frame to convey the act of addressing a Message to an Addressee using language.",
      "Instead of a Message, a Topic can be stated in this frame to communicate the act of a Speaker addressing a Topic to an Addressee using language.",
      "Performatively, various words like declare and insist can be used in this frame to convey the act of a Speaker addressing a Message to an Addressee using language.",
      "The verbs and nouns in this frame serve the purpose of expressing the act of a Speaker communicating with an Addressee by addressing a Message through language, and it may also include a mention of a Medium or a substitution of a Topic. Some of the words in this frame, such as declare and insist, can be used performatively."
    ]
  },
  "Claim_ownership": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Claimant asserts his or her right to possession of a piece of Property (either real, such as land, or private).  The Claimant may be acting on the behalf of a Beneficiary.\"",
    "Response": [
      "The right to possession of a piece of Property (whether real, like land, or private) is asserted by a Claimant, who could be representing a Beneficiary.",
      "In asserting their right to possession of a piece of Property (whether it be real estate or private), a Claimant can act on behalf of a Beneficiary.",
      "When it comes to asserting ownership of a piece of Property, whether real or private, it falls upon the Claimant to do so, possibly acting as a representative for a Beneficiary.",
      "The Claimant is responsible for asserting their entitlement to a specific piece of Property, which might be either real (e.g., land) or private, and this could be done on behalf of a Beneficiary.",
      "The act of asserting one's right to possession of a particular piece of Property (which could be either real, like land, or private) is done by the Claimant, who may possibly be acting in the interests of a Beneficiary."
    ]
  },
  "Cause_change_of_position_on_a_scale": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"This frame consists of words that indicate that an Agent or a Cause affects the position of an Item on some scale (the Attribute) to change it from an initial value (Value_1) to an end value (Value_2). The direction of the change (Path) can be encoded as well as the magnitude of the change (Difference).\"",
    "Response": [
      "The frame contains words that show how an Agent or a Cause impacts the position of an Item on a scale, resulting in a change from an initial value to a final value. The change can be described by its direction and magnitude.",
      "In this frame, words are used to indicate how an Agent or a Cause influences the position of an Item on a scale, causing a transformation from one value to another. The Path and Difference can also be expressed to explain the direction and extent of the change.",
      "An arrangement of words is present in this frame, which highlights the impact of an Agent or a Cause on moving an Item along a scale. This movement results in a transition from an initial value to a final value. The Path and Difference can be specified to convey the direction and amount of the change.",
      "Within this framework, language is employed to show how an Agent or a Cause affects the position of an Item on a scale. This effect causes a shift from the initial value to a new value. Additionally, details such as the Path (direction) and Difference (magnitude) of the change can be included.",
      "The structure presented here consists of words that serve to demonstrate how the position of an Item on a scale is influenced by an Agent or a Cause. This influence leads to a modification from an initial value to a subsequent value. Furthermore, the Path and Difference can be utilized to indicate the direction and extent of the modification."
    ]
  },
  "Coming_to_believe": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A person (the Cognizer) comes to believe something (the Content), sometimes after a process of reasoning. This change in belief is usually initiated by a person or piece of Evidence. Occasionally words in this domain are accompanied by phrases expressing Topic, i.e. that which the mental Content is about.\"",
    "Response": [
      "Sometimes, through a process of reasoning, the Cognizer develops a belief in something, triggered by a person or evidence.",
      "The Content, which is what the Cognizer believes, is often influenced by a person or a piece of Evidence during a process of reasoning.",
      "A change in belief occurs when the Cognizer, through a process of reasoning, comes to believe in something, usually influenced by a person or a piece of Evidence.",
      "Within this domain, words are occasionally accompanied by phrases that express the Topic, or the subject of the mental Content.",
      "The Cognizer forms a belief in something after going through a process of reasoning, typically influenced by a person or a piece of Evidence, and sometimes the mental Content pertains to a specific Topic."
    ]
  },
  "Expressing_publicly": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Communicator publically communicates some difficult-to-express Content which they (or a social group of which they are a member) have had for some time. The Content may not have been previously communicated due to inability or social stricture.  In cases where the individuals addressed are a smaller group than the public at large, a separate Addressee may be expressed.\"",
    "Response": [
      "The Communicator publicly shares Content that is challenging to articulate, something they or their social group have been holding onto for a while. If they couldn't express it before, it might be because they lacked the ability or because of social constraints. Sometimes, when addressing a smaller group, they may choose to direct their message to a specific Addressee.",
      "Difficult-to-express Content, which could not be communicated before due to personal limitations or social restrictions, is publicly presented by a Communicator. This Content has been harbored by either the Communicator or their social group for a considerable period of time. When addressing a smaller audience, a separate Addressee might be acknowledged.",
      "The act of public communication involves the sharing of challenging Content that a Communicator or their social group has been harboring for some time. Inability or societal constraints might have prevented them from expressing this Content earlier. In cases where a smaller audience is being addressed, the Communicator may choose to single out a specific Addressee.",
      "Publicly, a Communicator conveys Content that is difficult to put into words and has been held by either themselves or their social group for an extended period. This Content may not have been communicated earlier due to a lack of ability or societal norms. When addressing a smaller group, the Communicator may express it to a separate Addressee.",
      "In the public sphere, a Communicator openly shares Content that has been challenging to express and has been on their mind, or the mind of their social group, for quite some time. The reason for not communicating this Content previously could either be an inability to do so or the presence of social limitations. In situations where the audience is smaller than the general public, the Communicator might choose to mention a separate Addressee."
    ]
  },
  "Request": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"In this frame a Speaker asks an Addressee for something, or to carry out some action.\"",
    "Response": [
      "The Speaker in this frame seeks a request or action from the Addressee.",
      "A request or action is sought by the Speaker from the Addressee in this frame.",
      "Within this frame, the Speaker requests something or demands an action from the Addressee.",
      "An Addressee is asked for something or requested to perform an action by the Speaker in this frame.",
      "This frame involves the Speaker asking the Addressee for something or instructing them to carry out a specific action."
    ]
  },
  "Control": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Controlling_entity, Controlling_situation, or Controlling_variable control a Dependent_entity, Dependent_situation, or Dependent_variable. The latter, dependent, element or some aspect of it is not just influenced, but determined by the controlling element.\"",
    "Response": [
      "The Dependent_entity, Dependent_situation, or Dependent_variable is controlled by a Controlling_entity, Controlling_situation, or Controlling_variable, whereby the controlling element not only influences but also determines the dependent element or some aspect of it.",
      "Controlling a Dependent_entity, Dependent_situation, or Dependent_variable is achieved by a Controlling_entity, Controlling_situation, or Controlling_variable, where the determining factor is the controlling element rather than mere influence.",
      "In the relationship between a Controlling_entity, Controlling_situation, or Controlling_variable and a Dependent_entity, Dependent_situation, or Dependent_variable, the controlling element holds authority not only to influence but to determine aspects of the dependent element.",
      "A Controlling_entity, Controlling_situation, or Controlling_variable exercises control over a Dependent_entity, Dependent_situation, or Dependent_variable, with the determining factor being the control exerted by the former.",
      "The controlling element, which may be a Controlling_entity, Controlling_situation, or Controlling_variable, has the ability not only to influence but to dictate certain aspects of a Dependent_entity, Dependent_situation, or Dependent_variable."
    ]
  },
  "Self_control": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Agent actively (yet not always with success) attempts to keep themselves from participating in an Event. The Agent is usually pushed to the Event because of an internal urge.\"",
    "Response": [
      "The Agent endeavours, with varying degrees of success, to refrain from engaging in an Event, although they are often compelled to do so due to an inner impulse.",
      "In an effort to avoid involvement in an Event, the Agent actively tries, though not always successfully, to prevent themselves from participating, typically driven by an internal urge.",
      "The Agent makes a conscious effort, sometimes unsuccessful, to distance themselves from taking part in an Event, as they are often compelled to do so due to an internal compulsion.",
      "Despite not always achieving success, the Agent actively endeavors to refrain from participating in an Event, usually due to an inner urge that pushes them towards it.",
      "The Agent strives to avoid participating in an Event, but their attempts are not always fruitful, as they often feel compelled to do so because of an internal drive."
    ]
  },
  "Supporting": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Supporter assists to strengthen the Supported by lending itself in material aid (or abstract assistance in the case of metaphorical uses).\"",
    "Response": [
      "By providing tangible assistance or metaphorical aid, a Supporter helps to bolster the Supported individual or cause.",
      "The Supporter lends physical or abstract support to the Supported party, enhancing their strength and capabilities.",
      "In the case of metaphorical applications, the Supporter offers assistance to the Supported, thereby reinforcing their position.",
      "Through the provision of material aid or abstract assistance, a Supporter contributes to the strengthening of the Supported.",
      "A Supporter plays a role in fortifying the Supported by offering either practical help or symbolic support."
    ]
  },
  "Defending": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Defender responds to an Assailant's attack on a Victim by directly, and usually violently, countering it.\"",
    "Response": [
      "By directly countering it, typically through violent means, a Defender responds to an Assailant's attack on a Victim.",
      "When an Assailant attacks a Victim, a Defender reacts by countering the attack directly, often through violent actions.",
      "The response of a Defender to an Assailant's attack on a Victim is to counter it directly, usually with a violent approach.",
      "Directly countering the attack, which is usually accompanied by violence, is how a Defender responds to an Assailant's assault on a Victim.",
      "In the face of an Assailant's attack on a Victim, a Defender reacts by countering it directly and often violently."
    ]
  },
  "Building": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"This frame describes assembly or construction actions, where an Agent joins Components together to form a Created_entity, which is profiled, and hence the object of the verb.\"",
    "Response": [
      "Agent joins Components together to create a Created_entity, which is described in this frame and becomes the focus of the verb.",
      "The focus of this frame is on assembly or construction actions, where an Agent brings Components together to form a Created_entity, which is then profiled and becomes the direct object of the verb.",
      "Within this frame, the process of assembly or construction is outlined, where an Agent combines Components to generate a Created_entity. The Created_entity is subsequently profiled and serves as the object of the verb.",
      "The main concept presented in this frame pertains to assembly or construction actions, where an Agent merges Components together to produce a Created_entity. This Created_entity is then profiled and serves as the direct object of the verb.",
      "An Agent is involved in joining Components together to construct a Created_entity within this frame. The Created_entity is subsequently profiled and becomes the object of the verb."
    ]
  },
  "Military_operation": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"The Military of a Possessor (either a nation, institution, or private individual) conducts large-scale activities in a Area to accomplish military or combined military/non-military goals.\"",
    "Response": [
      "Military activities are conducted in an Area by a Possessor (whether it's a nation, institution, or private individual) to achieve military or combined military/non-military objectives.",
      "In order to achieve military or combined military/non-military goals, the Military of a Possessor (which could be a nation, institution, or private individual) carries out large-scale activities in an Area.",
      "Large-scale activities are performed in an Area by a Possessor's Military (whether it's a nation, institution, or private individual) to accomplish military or combined military/non-military objectives.",
      "To accomplish military or combined military/non-military goals, the Possessor's Military (whether it's a nation, institution, or private individual) engages in large-scale activities within an Area.",
      "The accomplishment of military or combined military/non-military objectives is the aim of large-scale activities carried out in an Area by the Military of a Possessor (be it a nation, institution, or private individual)."
    ]
  },
  "Self_motion": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"The Self_mover, a living being, moves under its own direction along a Path. Alternatively or in addition to Path, an Area, Direction, Source, or Goal for the movement may be mentioned.\"",
    "Response": [
      "A living being known as the Self_mover moves independently along a Path, and it may also have an Area, Direction, Source, or Goal for its movement.",
      "Along a Path, the Self_mover, which is a living being, moves under its own direction, and it may also have an Area, Direction, Source, or Goal for its movement.",
      "An Area, Direction, Source, or Goal for movement may also be mentioned in addition to the Path that the living being, known as the Self_mover, moves along under its own direction.",
      "The Self_mover, which is a living being, can move under its own direction along a Path, while also having the option of mentioning an Area, Direction, Source, or Goal for the movement.",
      "In addition to mentioning a Path, a living being referred to as the Self_mover can move under its own direction, having the flexibility to include an Area, Direction, Source, or Goal for its movement."
    ]
  },
  "GetReady": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"The Protagonist is in an initial state, before beginning to be involved in the Activity, but all pre-conditions for performance of the Activity have been satisfied.  In many cases, the Protagonist is an intentional agent, but there are other uses in which the agent is deprofiled, and the Protagonist is an entity which is essential to the Activity.\"",
    "Response": [
      "Before initiating the Activity, the Protagonist is in a starting state, yet all necessary conditions for the performance of the Activity have been met.",
      "The Protagonist is not yet engaged in the Activity but meets all the prerequisites for its execution, often serving as an intentional agent.",
      "Prior to becoming involved in the Activity, the Protagonist exists in an initial state, having fulfilled all requirements necessary for its accomplishment.",
      "The Protagonist is at the outset of the Activity, although all conditions needed for its execution have been satisfied. In most cases, the Protagonist acts deliberately, but there are instances where the agent is unrecognized, and the Protagonist is a crucial entity for the Activity.",
      "At the beginning, the Protagonist is not yet participating in the Activity, but all the conditions necessary for its performance have already been met. In certain cases, the Protagonist is an intentional agent, while in others, the agent's identity is diminished, and the Protagonist becomes an indispensable entity for the Activity."
    ]
  },
  "Forming_relationships": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"Partner_1 interacts with Partner_2 (also collectively expressible as Partners) to change their social relationship.\"",
    "Response": [
      "The social relationship between Partner_1 and Partner_2 is changed as they interact with each other.",
      "Changing their social relationship involves the interaction between Partner_1 and Partner_2, who can also be referred to as Partners.",
      "Interacting with Partner_2, Partner_1 changes their social relationship, which can also be described as the relationship between Partners.",
      "The social relationship of partners, Partner_1 and Partner_2, is altered through their interaction.",
      "Partners, namely Partner_1 and Partner_2, engage in interaction to transform their social relationship."
    ]
  },
  "Becoming_a_member": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A New_member becomes a member of a socially-constructed Group.\"",
    "Response": [
      "A member who is new joins a group that has been socially constructed.",
      "Joining a socially-constructed group results in an individual becoming a new member.",
      "When someone becomes a new member, they are joining a group that has been socially constructed.",
      "Membership in a socially-constructed group is obtained by becoming a new member.",
      "An individual becomes a member of a group that has been socially constructed upon joining."
    ]
  },
  "Execute_plan": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Agent acts according to a Plan, carrying it out (or taking steps to carry it out). In some cases, the Agent is a focal participant in the Plan, although a separate Focal_participant may also be mentioned. The Plan may be specified for the Duration for which it is in effect.\"",
    "Response": [
      "The execution of a Plan is done by an Agent who acts accordingly.",
      "An Agent carries out a Plan or takes steps to carry it out.",
      "The Agent can be a key participant in the Plan, but there may also be a separate Focal_participant mentioned.",
      "The Duration for which the Plan is effective can be specified.",
      "When the Plan is put into action, the Agent follows it and takes necessary measures."
    ]
  },
  "Action": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"This is an abstract frame for acts performed by sentient beings. It exists mostly for FE inheritance.\"",
    "Response": [
      "Sentient beings utilize this abstract frame primarily for the purpose of FE inheritance.",
      "The main function of this abstract frame is to facilitate acts performed by sentient beings, with a particular focus on FE inheritance.",
      "For the most part, this abstract frame is designed to support acts executed by sentient beings, predominantly for the purpose of FE inheritance.",
      "FE inheritance is the primary motivation behind the existence of this abstract frame, which serves as a platform for acts performed by sentient beings.",
      "This abstract frame primarily serves as a foundation for acts performed by sentient beings, with a special emphasis on facilitating FE inheritance."
    ]
  },
  "Removing": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Agent causes a Theme to move away from a location, the Source.  The Sourceis profiled by the words in this frame, just as the Goal is profiled in the Placing frame.\"",
    "Response": [
      "The words in this frame profile the Source, which is the location where an Agent causes a Theme to move away.",
      "The Source, which is the location, is profiled by the words in this frame when an Agent causes a Theme to move away.",
      "When an Agent causes a Theme to move away from the Source, the words in this frame profile the Source.",
      "In this frame, the words profile the Source, which is the location where an Agent causes a Theme to move away.",
      "In the Placing frame, the Goal is profiled just as the Source is profiled by the words in this frame when an Agent causes a Theme to move away."
    ]
  },
  "Surrendering": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"In this frame a Fugitive presents himself or herself to the Authorities to be subject to the criminal process.  The bank robber surrendered to Berkeley police.   Norte is expected to surrender to police tomorrow on tax fraud charges .\"",
    "Response": [
      "The Authorities are presented with a Fugitive in this scenario, willingly subjecting themselves to the criminal process. The Berkeley police took in the bank robber who turned himself in. Norte is anticipated to surrender to the police tomorrow for tax fraud allegations.",
      "Presenting themselves to the Authorities, a Fugitive willingly submits to the criminal process in this frame. Berkeley police received the surrender of the bank robber. It is expected that Norte will surrender to the police tomorrow to face tax fraud charges.",
      "A Fugitive takes the initiative to present themselves before the Authorities, submitting to the criminal process within this context. Following their decision, the bank robber surrendered to the Berkeley police. Tomorrow, Norte is projected to surrender to the police, facing charges of tax fraud.",
      "Within this framework, a Fugitive voluntarily comes forward to the Authorities, becoming subject to the criminal process. The bank robber willingly surrendered to the Berkeley police. It is anticipated that Norte will surrender to the police tomorrow, being charged with tax fraud.",
      "In this particular scenario, a Fugitive offers themselves to the Authorities, willingly subjecting themselves to the criminal process. The Berkeley police accepted the surrender of the bank robber. Tomorrow, it is expected that Norte will surrender to the police, facing charges for tax fraud."
    ]
  },
  "Surrendering_possession": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Surrenderer is compelled to transfer a Theme to a Recipient.\"",
    "Response": [
      "The action of transferring a Theme to a Recipient is obligatory for a Surrenderer.",
      "In order to fulfill their duty, a Surrenderer must pass on a Theme to a Recipient.",
      "The act of giving up a Theme and handing it over to a Recipient is mandatory for a Surrenderer.",
      "A Surrenderer has no choice but to transfer a Theme to a Recipient.",
      "It is incumbent upon a Surrenderer to deliver a Theme to a Recipient."
    ]
  },
  "Agree_or_refuse_to_act": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Speaker either agrees to or refuses to engage in a Proposed_action, proposed by an Interlocutor.\"",
    "Response": [
      "The proposed action put forth by an interlocutor can be either accepted or rejected by a speaker.",
      "When an interlocutor suggests a proposed action, a speaker can either agree to it or decline it.",
      "It is up to the speaker to decide whether they will engage in a proposed action suggested by an interlocutor.",
      "An interlocutor proposes an action, and the speaker has the choice to either agree to it or refuse it.",
      "The engagement in a proposed action is at the discretion of the speaker, who can either accept or deny the suggestion made by an interlocutor."
    ]
  },
  "Participation": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Event with multiple Participants takes place. It can be presented either symmetrically with Participants or asymmetrically, giving Participant_1 greater prominence over Participant_2. If the Event is engaged in intentionally, then there is typically a shared Purpose between the Participants. It is, however, possible that an expressed Purpose only applies to Participant_1.\"",
    "Response": [
      "A gathering occurs with multiple individuals involved, either presented symmetrically or asymmetrically to emphasize Participant_1.",
      "In the case of intentionally engaging in an event with multiple participants, there is usually a shared purpose between all involved.",
      "The event can be presented symmetrically or asymmetrically, with Participant_1 having more significance.",
      "If the event is intentional, there is typically a common purpose shared by all participants.",
      "There's a possibility that the stated purpose of the event only pertains to Participant_1, while the others may have different objectives."
    ]
  },
  "Deciding": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Cognizer makes a Decision, which may be about an entity or a course of action.\"",
    "Response": [
      "It is possible for a Cognizer to make a Decision, which could pertain to either an entity or a course of action.",
      "Making a Decision is within the realm of a Cognizer, whether it concerns an entity or a course of action.",
      "When it comes to a Cognizer, decision-making can involve either an entity or a course of action.",
      "The act of making a Decision is something that a Cognizer can do, and it may relate to either an entity or a course of action.",
      "A Decision can be made by a Cognizer, and it has the potential to pertain to either an entity or a course of action."
    ]
  },
  "Education_teaching": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"This frame contains words referring to teaching and the participants in teaching.  A Student comes to learn either about a Subject; a Skill; a Precept; or a Fact as a result of instruction by a Teacher.\"",
    "Response": [
      "Teaching involves words that pertain to instruction and the individuals involved in instruction. Students acquire knowledge from Teachers in order to comprehend a Subject, a Skill, a Precept, or a Fact.",
      "Within this structure, there are terms related to the act of teaching and the individuals engaged in teaching. The process entails a Student gaining understanding in a Subject, a Skill, a Precept, or a Fact through the guidance of a Teacher.",
      "In this framework, there exist words that are connected to teaching and the participants in the teaching process. The outcome of instruction provided by a Teacher is that a Student acquires knowledge about either a Subject, a Skill, a Precept, or a Fact.",
      "Words within this context are related to teaching and those involved in teaching. When a Teacher imparts instruction, a Student learns either about a Subject, a Skill, a Precept, or a Fact.",
      "This structure incorporates vocabulary associated with teaching and the people engaged in teaching. Through instruction from a Teacher, a Student gains knowledge in a particular Subject, Skill, Precept, or Fact."
    ]
  },
  "Emptying": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"These are words relating to emptying containers and clearing areas of some substance or items. The area or container can appear as the direct object with all these verbs, and is designated  Source because it is the source of motion of the Theme. Corresponding to its nuclear argument status, it is also affected in some crucial way, unlike Source in other frames. Some words in this frame, such as empty, may also occur with Path or Goal expressions, e.g.\"",
    "Response": [
      "Words related to the act of emptying containers and clearing areas of certain substances or items are presented here. The direct object in these verbs can be the area or container, labeled as the Source since it is the origin of the motion of the Theme. Unlike Source in other frames, it is affected in a significant manner due to its nuclear argument status. Certain words in this frame, like empty, can also be used with Path or Goal expressions (e.g.).",
      "Emptying containers and clearing areas of substances or items involve the usage of specific words. The area or container, acting as the direct object, is referred to as the Source because it is the starting point of the Theme's motion. Being the nuclear argument, the Source is also affected significantly, unlike in other frames. Some words within this frame, for instance, empty, may also be combined with Path or Goal expressions, such as.",
      "In this frame, various words pertain to the action of emptying containers and clearing areas from substances or items. The area or container, serving as the direct object, is labeled as the Source as it initiates the motion of the Theme. Additionally, due to its nuclear argument status, the Source undergoes a notable impact unlike other frames. Furthermore, certain words in this frame, including empty, can also be used alongside Path or Goal expressions, like.",
      "The extraction of substances or items from containers and the clearing of areas involve the use of specific vocabulary. In this context, the area or container acts as the direct object, referred to as the Source because it provides the motion for the Theme. Unlike other frames, the Source is significantly affected as a result of its nuclear argument status. Moreover, some words within this frame, such as empty, can be combined with Path or Goal expressions, such as.",
      "To describe the action of emptying containers and clearing areas, a range of words are utilized. These verbs consider the area or container as the direct object, recognized as the Source as it determines the motion of the Theme. Unlike Source in other frames, the nuclear argument status of the Source results in a significant impact. Additionally, certain words within this frame, like empty, can also be combined with Path or Goal expressions, such as."
    ]
  },
  "Getting": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Recipient starts off without the Theme in their possession, and then comes to possess it.  Although the Source from which the Theme came is logically necessary, the Recipient and its changing relationship to the Theme is profiled.\"",
    "Response": [
      "The Recipient initially lacks possession of the Theme, but eventually acquires it, while the Source of the Theme remains logically crucial in this scenario, the main focus is on the Recipient and its evolving connection to the Theme.",
      "In the beginning, the possession of the Theme is absent in the Recipient, but later on, it obtains it. Although the Source that provided the Theme is logically indispensable, the main emphasis lies on the Recipient and its dynamic association with the Theme.",
      "The possession of the Theme is initially absent in the Recipient, but through time, it acquires it. While it is important to note the logical necessity of the Source from which the Theme originated, the main focus is on profiling the Recipient and its changing relationship with the Theme.",
      "At the starting point, the Recipient does not possess the Theme, but as it progresses, it comes into possession of it. The logical necessity lies in the Source of the Theme, yet the primary concern is examining the Recipient and its evolving bond with the Theme.",
      "In the beginning, the Recipient lacks the possession of the Theme, but eventually attains it. While it is crucial to acknowledge the logical necessity of the Source from which the Theme originated, the main point of interest lies in outlining the Recipient and its shifting connection to the Theme."
    ]
  },
  "Besieging": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Assailant, a group of armed forces, surrounds the Victim, a military location and the people within it, in an attempt to cut the Victim off from the outside, with the goal of either forcing their surrender or weakening them so that an invasion would be successful. A successful siege is often followed by the Assailant taking control of (the land held by) the Victim.\"",
    "Response": [
      "The Assailant, comprising armed forces, encircles the Victim, a military base and its inhabitants, aiming to isolate the Victim from the outside and compel their surrender or weaken them for a potential invasion. After a victorious siege, the Assailant typically assumes control over the land held by the Victim.",
      "In an act of aggression, a contingent of armed forces forms a ring around the Victim, a military establishment and its occupants, with the objective of disconnecting the Victim from external support. The ultimate aim is either to coerce the Victim into surrendering or to diminish their strength, paving the way for a triumphant invasion. Subsequently, the Assailant usually seizes control over the territory previously held by the Victim.",
      "The Victim, a military site and its populace, find themselves encircled by an Assailant, a collective of armed forces. The Assailant's primary intention is to isolate the Victim from the outside world, either by persuading them to surrender or by weakening their defenses to facilitate a successful invasion. Typically, the Assailant assumes control over the land formerly occupied by the Victim after a siege triumph.",
      "A group of armed forces, known as the Assailant, strategically surrounds the Victim, a military location and its inhabitants. Their main objective is to cut off any external assistance to the Victim, aiming to either compel their surrender or undermine their defenses for a victorious invasion. Once the siege is successful, the Assailant asserts dominance over the land previously held by the Victim.",
      "Surrounding the Victim, a military base and the individuals within it, an Assailant consisting of armed forces stages an assault. The purpose is to isolate the Victim from external support, with the ultimate goal of forcing their surrender or weakening them to facilitate a triumphant invasion. Following a successful siege, the Assailant typically assumes control over the land formerly possessed by the Victim."
    ]
  },
  "Creating": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Cause leads to the formation of a Created_entity.\"",
    "Response": [
      "The formation of a Created_entity is a direct result of a Cause.",
      "A Created_entity is formed as a consequence of a Cause.",
      "The existence of a Created_entity is the outcome of a Cause.",
      "A Cause is responsible for bringing about the formation of a Created_entity.",
      "The formation of a Created_entity is initiated by a Cause."
    ]
  },
  "Process_end": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Process comes to an end.\"",
    "Response": [
      "An end is reached by a process.",
      "The process concludes.",
      "The process reaches its conclusion.",
      "The end of a process is achieved.",
      "The process is terminated."
    ]
  },
  "Body_movement": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"This frame contains words for motions or actions an Agent performs using some part of his/her body.\"",
    "Response": [
      "The words in this frame describe the movements or actions performed by an Agent using a specific body part.",
      "In this frame, you will find words that represent the bodily motions or actions carried out by an Agent.",
      "Within this frame are words that pertain to the various movements or actions an Agent can execute with their body.",
      "Words contained in this frame relate to the actions or motions performed by an Agent using a particular body part.",
      "The words included in this frame express the different actions or movements an Agent can undertake utilizing their body."
    ]
  },
  "Expansion": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An  Agent or non-human Cause causes an Item to change its physical size.  The Size_change of an Item may be explicitly indicated or characterized in terms of Initial_size and/or Result_size.  In the default case, expansion is along all dimensions, but sometimes the Dimension of expansion is incorporated or made explicit.\"",
    "Response": [
      "An Item undergoes a change in its physical size due to an Agent or a non-human Cause. The change in size may be explicitly stated or described using Initial_size and/or Result_size. By default, the expansion occurs in all dimensions, but occasionally, the specific Dimension of expansion is included or made clear.",
      "When an Agent or non-human Cause is involved, an Item experiences a modification in its physical size. This change can be explicitly indicated or defined using Initial_size and/or Result_size. By default, the expansion occurs in all dimensions, but sometimes the expansion is limited to a particular Dimension.",
      "The physical size of an Item is altered by an Agent or non-human Cause. The change in size can be indicated directly or described through Initial_size and/or Result_size. By default, the expansion occurs in all dimensions, but occasionally, the expansion is focused on a specific Dimension.",
      "An Item's physical size is subject to change caused by an Agent or non-human Cause. The change in size can be explicitly mentioned or characterized using Initial_size and/or Result_size. Normally, the expansion occurs in all dimensions, but occasionally, the expansion is tied to a specific Dimension.",
      "An Item's physical size is modified due to the actions of an Agent or non-human Cause. The change in size can be explicitly indicated or explained using Initial_size and/or Result_size. Typically, the expansion occurs in all dimensions, although sometimes, the expansion is expressly linked to a particular Dimension."
    ]
  },
  "Telling": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Speaker addresses an Addressee with a Message, which may be indirectly referred to as a Topic. Instead of (or in addition to) a Speaker, a Medium may also be mentioned.\"",
    "Response": [
      "The Message, which can be indirectly referred to as a Topic, is addressed by a Speaker to an Addressee. A Medium might also be mentioned instead of or in addition to the Speaker.",
      "An Addressee is spoken to by a Speaker, who delivers a Message that may be indirectly referred to as a Topic. Additionally, a Medium might be mentioned instead of or in addition to the Speaker.",
      "In the communication, a Speaker directs a Message to an Addressee, with the possibility of indirectly referring to it as a Topic. Furthermore, a Medium might be mentioned in place of or alongside the Speaker.",
      "The addressee is the recipient of a Message delivered by a Speaker, who may indirectly refer to it as a Topic. Apart from the Speaker, a Medium might also be acknowledged.",
      "The Speaker interacts with an Addressee by conveying a Message, which may be indirectly designated as a Topic. Notably, a Medium may also be cited in addition to or as an alternative to the Speaker."
    ]
  },
  "Change": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Agent or Cause causes an Entity to change, either in its category membership or in terms of the value of an Attribute. In the former case, an Initial_category and a Final_category may be expressed, in the latter case an Initial_value and a Final_value can be specified.\"",
    "Response": [
      "An Entity can be changed either in its category membership or in terms of the value of an Attribute by an Agent or Cause. Expressing an Initial_category and a Final_category is possible in the former case, whereas specifying an Initial_value and a Final_value can be done in the latter case.",
      "The alteration of an Entity, in terms of the value of an Attribute or its category membership, is caused by an Agent or Cause. In the former instance, it is possible to indicate both an Initial_category and a Final_category. On the other hand, in the latter case, it is possible to specify an Initial_value and a Final_value.",
      "When an Entity undergoes a change, it is either the category membership or the value of an Attribute that is modified, caused by an Agent or Cause. In the case of changes in category membership, specifying an Initial_category and a Final_category is allowed. Conversely, in the case of changes in Attribute value, one can specify an Initial_value and a Final_value.",
      "Caused by an Agent or Cause, an Entity can go through a change, which can be either in terms of its category membership or the value of an Attribute. If it pertains to a change in category membership, one can express both an Initial_category and a Final_category. On the other hand, in the case of a change in Attribute value, an Initial_value and a Final_value can be specified.",
      "An Entity can be influenced by an Agent or Cause to undergo a change, either in its category membership or in terms of the value of an Attribute. When it comes to changes in category membership, it is possible to express both an Initial_category and a Final_category. Conversely, when it involves changes in Attribute value, specifying an Initial_value and a Final_value is feasible."
    ]
  },
  "Cause_change_of_phase": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Cause or Agent causes a Patient to undergo a change of phase.  The Result of the change may be given, along with the Initial_state and the Circumstances under which the change can occur.  Note that this frame contrasts with Cause_change_of_consistency in that this frame describes causation of a change of a Patient between different phases (i.e. solid to liquid or frozen to \"unfrozen\").   Bob melted the butter.    Sally defrosted the chicken to eat for dinner.\"",
    "Response": [
      "The Patient undergoes a change of phase due to a Cause or Agent, and the Result of the change, Initial_state, and Circumstances are provided.",
      "This frame differs from Cause_change_of_consistency as it specifically addresses the causation of a Patient transitioning between different phases.",
      "Bob caused the butter to melt.",
      "Sally thawed the chicken in order to have it for dinner.",
      "A change of phase occurs in the Patient when a Cause or Agent is involved, and details such as the Result, Initial_state, and Circumstances are included."
    ]
  },
  "Legal_rulings": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Authority with the power to make decisions hands down a Finding over a question presented in a formal or informal Case.\"",
    "Response": [
      "In a formal or informal Case, a Finding is handed down by an Authority with the power to make decisions over a question presented.",
      "A Finding is presented by an Authority with decision-making power in a formal or informal Case.",
      "The power to make decisions allows an Authority to hand down a Finding over a question presented in a formal or informal Case.",
      "When presented with a question in a formal or informal Case, an Authority with decision-making power will hand down a Finding.",
      "In the context of a formal or informal Case, a Finding is handed down by an Authority with the ability to make decisions regarding a question."
    ]
  },
  "Bearing_arms": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Protagonist has (or does not have) a Weapon.  The Degree to which the Protagonist is armed may also be described.  The Protagonist is normally a human but may be a device that has subsidiary weapons.\"",
    "Response": [
      "It is possible for a Protagonist to possess a Weapon, but it is also possible for them to not have one. Additionally, the level of armament for the Protagonist can be mentioned. Generally, the Protagonist is a human, although they could also be a device equipped with secondary weapons.",
      "The possession, or lack thereof, of a Weapon by the Protagonist can vary. Furthermore, there is a chance to describe the extent of armament the Protagonist possesses. Typically, the Protagonist is human, though they could assume the form of a device armed with subsidiary weaponry.",
      "Whether the Protagonist is armed with a Weapon or not is subject to variation. Additionally, the degree of armament the Protagonist carries can be elaborated upon. As a general rule, the Protagonist is a human entity, although in some cases they may manifest as a device that boasts additional weapons.",
      "The presence or absence of a Weapon in the possession of the Protagonist is open to interpretation. Moreover, the proportion of armament exhibited by the Protagonist can be detailed. Typically, the Protagonist assumes the form of a human, although in certain instances they can be a device fitted with supplementary weapons.",
      "There exists the possibility for the Protagonist to wield a Weapon, but it is not a certainty. Furthermore, it is important to specify the extent to which the Protagonist is armed. Generally speaking, the Protagonist is a human being, although they may also take on the role of a device equipped with auxiliary weapons."
    ]
  },
  "Giving": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Donor transfers a Theme from a Donor to a Recipient.  This frame includes only actions that are initiated by the Donor (the one that starts out owning the Theme).  Sentences (even metaphorical ones) must meet the following entailments: the  Donor first has possession of the Theme.  Following the transfer the Donor no longer has the Theme and the Recipient does. Barney gave the beer to Moe. $300 was endowed to the university to build a new performing arts building.\"",
    "Response": [
      "The transfer of a Theme from a Donor to a Recipient takes place, where the Donor initiates the actions and initially possesses the Theme. After the transfer, the Donor no longer has the Theme, but the Recipient does. Barney transferred the beer to Moe. An endowment of $300 was given to the university for the construction of a new performing arts building.",
      "In this process, a Theme is passed from a Donor to a Recipient, with the Donor being the initiator and initial possessor of the Theme. It is essential that the Donor no longer possesses the Theme after the transfer, but the Recipient does. Moe received the beer from Barney. An amount of $300 was contributed to the university to develop a new performing arts building.",
      "The act described involves the transfer of a Theme from a Donor to a Recipient. The Donor, who initially possesses the Theme, is responsible for initiating the action. Once the transfer occurs, the Donor ceases to possess the Theme, while the Recipient gains possession. Moe was given the beer by Barney. An endowment of $300 was designated for the university to construct a new performing arts building.",
      "In this particular scenario, a Donor transfers a Theme to a Recipient. The Donor, who owns the Theme initially, is the one responsible for initiating the action. Following the transfer, the Donor relinquishes possession of the Theme while the Recipient becomes the new owner. Moe received the beer from Barney. The university received a $300 endowment to support the construction of a new performing arts building.",
      "This passage describes a situation where a Donor transfers a Theme to a Recipient. The Donor, who possesses the Theme at the beginning, is the initiator of the action. Upon completion of the transfer, the Donor no longer possesses the Theme, but it is now in the possession of the Recipient. Barney gave Moe the beer. An endowment of $300 was provided to the university for the purpose of building a new performing arts facility."
    ]
  },
  "Name_conferral": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"This  frame contains words that talk about how Speakers name Entities.\"",
    "Response": [
      "Speakers use this frame to discuss the naming of Entities.",
      "The focus of this frame is on the discussion of how Speakers name Entities.",
      "Within this frame, Speakers address the topic of naming Entities through words.",
      "Words pertaining to naming Entities are discussed in this frame by Speakers.",
      "How Speakers name Entities is the main subject of this frame's content."
    ]
  },
  "Arranging": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Agent puts a complex Theme into a particular Configuration, which can be a proper order, a correct or suitable sequence, or a spatial position.\"",
    "Response": [
      "A specific Configuration is assigned to a complex Theme by an Agent, which may consist of appropriate sequence, proper order, or spatial position.",
      "A complex Theme is arranged into a particular Configuration by an Agent, which can be comprised of suitable sequence, proper order, or spatial position.",
      "The assignment of a specific Configuration to a complex Theme is done by an Agent, which may involve arranging it in proper order, suitable sequence, or a spatial position.",
      "An Agent is responsible for placing a complex Theme into a particular Configuration, which can include proper order, suitable sequence, or spatial position.",
      "A proper order, suitable sequence, or spatial position is established by an Agent when arranging a complex Theme into a specific Configuration."
    ]
  },
  "Making_arrangements": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Agent performs a series of unspecified tasks to plan for an Event to take place at a Scheduled_time and Place.\"",
    "Response": [
      "At a Scheduled_time and Place, an Agent undertakes various undefined tasks to prepare for an Event.",
      "The performance of unspecified tasks by an Agent aims to plan for an Event occurring at a Scheduled_time and Place.",
      "An Event is planned for a specific Scheduled_time and Place, for which an Agent carries out an array of unspecified tasks.",
      "In order for an Event to happen at a Scheduled_time and Place, an Agent is responsible for executing a series of undisclosed tasks.",
      "An Agent is assigned to plan for an upcoming Event set to occur at a Scheduled_time and Place, involving the completion of multiple unspecified tasks."
    ]
  },
  "Use_firearm": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Agent causes a Firearm to discharge, usually directing the projectile from the barrel of the Firearm (the Source), along a Path, and to a Goal.\"",
    "Response": [
      "Typically, the Agent triggers the discharge of a Firearm, propelling the projectile along a Path from the barrel of the Firearm (known as the Source) and towards a Goal.",
      "The act of causing a Firearm to discharge involves an Agent, who guides the projectile's trajectory from the Firearm's barrel (referred to as the Source) towards a specific Goal.",
      "By initiating the discharge, an Agent is responsible for propelling the projectile from a Firearm's barrel (also called the Source) and directing it towards a predetermined Goal along a specified Path.",
      "The discharge of a Firearm is typically instigated by an Agent, leading to the projection of the projectile from the Firearm's barrel (known as the Source) along a designated Path until it reaches a desired Goal.",
      "A Firearm's discharge is brought about by an Agent, who steers the projectile from the barrel of the Firearm (known as the Source) along a designated Path until it successfully reaches the intended Goal."
    ]
  },
  "Committing_crime": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Perpetrator (generally intentionally) commits a Crime, i.e. does something not permitted by the laws of society.\"",
    "Response": [
      "The Crime is committed by a Perpetrator, who usually does it deliberately, meaning they engage in an action that is prohibited by societal laws.",
      "The Act of Crime is typically perpetrated by an individual, with the intention of intentionally violating the regulations set by society.",
      "An individual, known as the Perpetrator, intentionally carries out a Crime, which refers to an action that is forbidden by the laws established in society.",
      "Society's laws are broken when a Perpetrator, intentionally and purposefully, engages in a Crime, indicating an act that is not allowed.",
      "By performing an action that defies the laws of society, a Perpetrator commits a Crime in a deliberate and intentional manner."
    ]
  },
  "Assistance": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Helper benefits a Benefited_party by enabling the culmination of a Goal that the Benefited_party has.  A Focal_entity that is involved in reaching the Goal may stand in for it.\"",
    "Response": [
      "By facilitating the achievement of a desired objective, a Helper provides assistance to a Benefited_party. It is possible for a Focal_entity to represent the Benefited_party in the pursuit of the Goal.",
      "The Benefited_party benefits from a Helper's aid in accomplishing their desired Goal. In certain cases, a Focal_entity can act as a surrogate for the Benefited_party in the process.",
      "Enabling the realization of a Goal for the Benefited_party, a Helper brings about benefits for them. If necessary, a Focal_entity can take on the role of the Benefited_party to achieve the Goal.",
      "The culmination of a Goal that the Benefited_party has is made possible through the assistance of a Helper. In some instances, a Focal_entity can serve as a substitute for the Benefited_party in reaching the Goal.",
      "A Helper assists a Benefited_party in attaining their desired Goal. It is feasible for a Focal_entity to substitute for the Benefited_party in the pursuit of the Goal."
    ]
  },
  "Surrounding": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Figure surrounds a Ground.  The Ground location is presented as more likely to be a known location than the location of the Figure. Some lexical units entail more-or-less complete surrounding in two or three dimensions (e.g. surround.v), while others entail surrounding on only two sides (e.g. astride.prep, straddle.v).  Like other locative relations, the Figure may be any of a movable entity, an immovable entity, or an event.\"",
    "Response": [
      "One format: The location of the Figure is presented as less likely to be a known location than the location of the Ground, creating a surrounding effect.",
      "Second format: Surrounding is formed by a Figure and a Ground, with the Ground being more likely to be a known location than the Figure's location.",
      "Third format: Certain lexical units, like the verb \"surround,\" imply a more comprehensive surrounding effect in two or three dimensions, while others, like the preposition \"astride\" and the verb \"straddle,\" imply a surrounding effect on only two sides.",
      "Fourth format: Similar to other locative relations, the Figure in this context can refer to a movable entity, an immovable entity, or an event.",
      "Fifth format: In a Figure-Ground relationship, the Ground location is more likely to be a known location compared to the Figure's location. Some lexical units, such as the verb \"surround,\" suggest complete surrounding in multiple dimensions, while others, like the preposition \"astride\" and the verb \"straddle,\" imply surrounding on only two sides. Additionally, the Figure can represent any movable entity, immovable entity, or event."
    ]
  },
  "Quarreling": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A group of Arguers (also expressible as Arguer1 and Arguer2) express incompatible opinions or beliefs about an Issue.\"",
    "Response": [
      "Arguer1 and Arguer2, a group of individuals, express differing opinions or beliefs about a particular issue.",
      "A group of individuals, known as Arguer1 and Arguer2, hold conflicting viewpoints or ideologies on a specific matter.",
      "In relation to a particular issue, Arguer1 and Arguer2, forming a group, express contradictory opinions or beliefs.",
      "An assemblage of Arguer1 and Arguer2, collectively expressing divergent opinions or beliefs, discuss a certain issue.",
      "On a given issue, a collection of Arguer1 and Arguer2 express irreconcilable opinions or beliefs."
    ]
  },
  "Expend_resource": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Agent uses a Resource which is consumed and unavailable for future use.\"",
    "Response": [
      "In the context of this passage, a Resource is utilized by an Agent and subsequently rendered unusable for any future purposes.",
      "The consumption of a Resource by an Agent results in its unavailability for any future utilization.",
      "The utilization of a Resource by an Agent renders it consumed and inaccessible for any subsequent usage.",
      "A Resource is employed by an Agent, and once used, it becomes unavailable and cannot be used again in the future.",
      "The utilization of a Resource by an Agent leads to its consumption and inability to be utilized in the future."
    ]
  },
  "Motion_directional": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"In this frame a Theme moves in a certain Direction which is often determined by gravity or other natural, physical forces. The Theme is not necessarily a self-mover.\"",
    "Response": [
      "A Theme, in this particular frame, undergoes movement following a specific Direction, often influenced by gravity or other inherent physical forces. The Theme's movement is not always initiated by itself.",
      "Within this framework, there exists a Theme that experiences movement in a particular Direction, frequently influenced by forces such as gravity or other natural, physical factors. It is important to note that the Theme is not inherently capable of initiating its own movement.",
      "The movement of a Theme within this particular frame is guided by a specific Direction, often determined by external forces like gravity and other natural, physical influences. It is important to recognize that the Theme itself does not possess autonomous motion.",
      "In the context of this frame, a Theme is subject to movement in a particular Direction, primarily influenced by physical forces such as gravity or other natural factors. It should be noted that the Theme does not possess inherent self-propelling capabilities.",
      "Within the confines of this framework, a Theme undergoes movement along a specific Direction, which is typically determined by external forces like gravity or other natural, physical factors. Importantly, the Theme itself is not necessarily characterized by autonomous motion."
    ]
  },
  "Bringing": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"This frame concerns the movement of a Theme and an Agent and/or Carrier.   The Agent, a person or other sentient entity, controls the shared Path by moving the Theme during the motion. In other words, the Agent has overall motion in directing the motion of the Theme.  The Carrier may be a separate entity, or it may be the Agent's body. The Constant_location may be a subregion of the Agent's body or (a subregion of) a vehicle that the Agent uses.\"",
    "Response": [
      "The movement of a Theme and an Agent and/or Carrier is the focus of this framework. The Agent, who can be a person or any other conscious being, is in charge of guiding the shared Path by moving the Theme. Essentially, the Agent has complete control over the motion of the Theme. The Carrier can either be a distinct entity or the body of the Agent. The Constant_location could either be a part of the Agent's body or a part of the vehicle the Agent operates.",
      "In this framework, the main concern is the displacement of a Theme and an Agent and/or Carrier. The Agent, which can be an individual or any other sentient entity, is responsible for managing the common Path by relocating the Theme during the movement. Put simply, the Agent has overall authority in directing the motion of the Theme. The Carrier, on the other hand, can be a separate entity or the physical body of the Agent. The Constant_location may refer to a specific area of the Agent's body or a specific area within a vehicle utilized by the Agent.",
      "This framework focuses on the transfer of a Theme alongside an Agent and/or Carrier. The Agent, whether it is a person or another conscious entity, maintains control over the shared Path by maneuvering the Theme during the process. To put it differently, the Agent possesses overall motion in managing the movement of the Theme. The Carrier could either be a distinct entity or the physical body of the Agent. The Constant_location might constitute a subsection of the Agent's body or a subsection within a vehicle utilized by the Agent.",
      "The primary aspect addressed in this framework is the movement of a Theme in conjunction with an Agent and/or Carrier. The Agent, who can be either a person or some other sentient being, has the responsibility of governing the mutual Path by moving the Theme during the course of action. In simpler terms, the Agent has ultimate control over the motion of the Theme. As for the Carrier, it can either be a separate entity or the physical body of the Agent. The Constant_location may refer to a subregion of the Agent's body or a subregion within a vehicle employed by the Agent.",
      "This framework primarily concerns the motion of both a Theme and an Agent and/or Carrier. The Agent, which may be a person or any other conscious entity, takes charge of the shared Path by propelling the Theme during the movement. Stated differently, the Agent has overall motion in directing the motion of the Theme. The Carrier can either exist as a distinct entity or as the body of the Agent. The Constant_location may be a subsection of the Agent's body or a subsection of a vehicle utilized by the Agent."
    ]
  },
  "Communication": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Communicator conveys a Message to an Addressee; the Topic and Medium of the communication also may be expressed.  This frame includes no specification of the method of communication (speech, writing, gesture, etc.).  This frame and the frames that inherit the general Communication frame can add elaboration to the Medium in a variety of ways (in French, on the radio program, in a letter) or to the Manner of communication (babble, rant, shout, whisper). There are also frames related to Communication that either do not inherit all of the FEs of this frame or do not inherit them in a straightforward manner (such as Conversation, in which Communicator and Addressee alternate roles, and are often expressed by a single, plural NP).\"",
    "Response": [
      "The communication process involves a Communicator sending a Message to an Addressee, where the Topic and Medium of communication may also be specified. The specific method of communication (speech, writing, gesture, etc.) is not mentioned in this frame.",
      "Communication involves a Communicator conveying a message to an Addressee, with the possibility of specifying the Topic and Medium. The method of communication (speech, writing, gesture, etc.) is not specified in this frame.",
      "In the process of communication, a Communicator sends a Message to an Addressee, and the Topic and Medium of communication can be expressed. However, the method of communication (speech, writing, gesture, etc.) is not defined in this frame.",
      "The act of communication includes a Communicator transmitting a Message to an Addressee, with options to express the Topic and Medium of communication. The specific method of communication (speech, writing, gesture, etc.) is not mentioned in this frame.",
      "Communication involves a Communicator delivering a Message to an Addressee, and it is possible to indicate the Topic and Medium of communication. However, this frame does not provide details about the method of communication (speech, writing, gesture, etc.)."
    ]
  },
  "Containing": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"In this frame a Container holds within its physical boundaries the Contents.\"",
    "Response": [
      "The Contents are held within the physical boundaries of a Container within this frame.",
      "Within this frame, the Contents are contained by a physical boundary called the Container.",
      "A Container within this frame contains the Contents within its physical boundaries.",
      "The physical boundaries of a Container hold the Contents within this frame.",
      "Within this frame, the physical boundaries of a Container enclose the Contents."
    ]
  },
  "Manufacturing": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Producer produces a Product from a Resource for commercial purposes.\"",
    "Response": [
      "For commercial purposes, a Product is produced by a Producer using a Resource.",
      "A Product is produced by a Producer for commercial purposes by utilizing a Resource.",
      "The act of producing a Product for commercial purposes is done by a Producer using a Resource.",
      "For commercial purposes, a Producer utilizes a Resource to create a Product.",
      "By employing a Resource, a Producer creates a Product for commercial purposes."
    ]
  },
  "Social_event": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Social_event occurs at which Attendees are present to conduct a social function or joint activity.  The Social_event is often a party or celebration, in which case it is possible to express someone who is being honored (the Honoree) or its function may be to celebrate an Occasion at which Attendees are present. Often, a specific Attendee, the Host, provides a venue for people to gather.\"",
    "Response": [
      "Attendees gather at a Social_event to engage in a social function or joint activity, sometimes as a party or celebration where the Honoree is recognized, or to mark a special Occasion.",
      "The presence of Attendees characterizes a Social_event, wherein individuals come together for social interaction or a collaborative activity. Such events can be parties or celebrations, aimed at honoring someone (known as the Honoree) or commemorating a specific Occasion.",
      "A Social_event takes place, involving the participation of Attendees who come together for a social function or coordinated activity. Typically held as a party or celebration, these events can acknowledge the Honoree or serve as a festivity associated with an Occasion.",
      "During a Social_event, Attendees congregate to partake in a social function or collaborative undertaking. Often manifesting as a party or celebration, these events serve to recognize individuals deserving of honor (Honoree) or to commemorate a particular Occasion in the presence of the Attendees.",
      "Attendees assemble at a Social_event, which serves as an opportunity for social engagement or joint activities. These events are commonly organized as parties or celebrations, where recognition is given to the Honoree, or as occasions where the presence of Attendees is necessary to celebrate a specific Occasion."
    ]
  },
  "Robbery": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"These are words describing situations in which a Perpetrator wrongs a Victim by taking something (Goods) from them.  In some cases, the Source location from which the Goods were taken is used to metonymically refer to the Victim.  The robbery can be done in a particular Manner (for example, forcefully) and via a specific Means (for example, by threatening the Victim).\"",
    "Response": [
      "Situations in which a Perpetrator commits a wrong against a Victim by taking something from them are described by these words. Metonymically, the Source location where the Goods were stolen from is sometimes used to refer to the Victim.",
      "These words are used to describe scenarios where a Perpetrator commits a wrongdoing against a Victim by appropriating something (Goods) from them. At times, the Source location from where the Goods were taken is utilized as a metonymy to identify the Victim.",
      "The passage explains the usage of words to portray situations where a Perpetrator unfairly deprives a Victim of their possessions (Goods). In certain instances, the Source location, symbolically, becomes a representation of the Victim's identity.",
      "To depict scenarios where a Perpetrator commits a wrongdoing against a Victim by seizing something (Goods), specific terms are employed. The Source location from which the Goods were taken is occasionally used as a substitute to refer to the Victim.",
      "Descriptions of situations involving a Perpetrator wronging a Victim by appropriating something (Goods) from them are encompassed by these words. The Victim is occasionally alluded to metaphorically by referring to the Source location from which the Goods were taken."
    ]
  },
  "Competition": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"This frame is concerned with the idea that people (Participant_1, Participant_2, or Participants) participate in an organized, rule-governed activity (the Competition) in order to achieve some advantageous outcome (often the Prize).  Rank and Score are different criteria by which the degree of achievement of the advantageous outcome is judged.\"",
    "Response": [
      "The main focus of this framework is the concept that individuals (Participant_1, Participant_2, or Participants) engage in a structured activity (the Competition) with governing rules to attain a favorable result (typically the Prize). The evaluation of the level of success in achieving the desired outcome is determined by two distinct criteria, Rank and Score.",
      "This framework centers around the notion that individuals (Participant_1, Participant_2, or Participants) take part in an organized activity (the Competition) governed by rules, with the intention of obtaining a beneficial outcome (often the Prize). The evaluation of the extent of success in reaching the desired result is determined by two criteria, Rank and Score.",
      "The primary concern of this framework is the idea that people (Participant_1, Participant_2, or Participants) engage in a well-organized and rule-based activity (the Competition) in order to attain a favorable outcome (usually the Prize). The measurement of the level of achievement of the desired outcome is evaluated based on two criteria, namely Rank and Score.",
      "The central focus of this framework revolves around the concept that individuals (Participant_1, Participant_2, or Participants) partake in an activity (the Competition) that is structured and governed by rules, with the aim of accomplishing a beneficial outcome (often the Prize). The assessment of the degree of success in achieving the desired result is determined using two distinct criteria, Rank and Score.",
      "The essence of this framework lies in the notion that people (Participant_1, Participant_2, or Participants) participate in an organized activity (the Competition) that is regulated by rules, with the ultimate goal of attaining a favorable outcome (typically the Prize). The evaluation of the level of accomplishment of the desired outcome is determined through the utilization of two criteria, Rank and Score."
    ]
  },
  "Writing": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Author creates a Text, either written, such as a letter, or spoken, such as a speech,  that contains meaningful linguistic tokens, and may have a particular Addressee in mind.  The Text may include information about its topic, although the latter is not an FE in this frame.\"",
    "Response": [
      "In this frame, an Author can produce a Text, either in written form like a letter or verbally like a speech, which contains significant linguistic elements and is likely intended for a specific recipient. Regardless, the Text may not necessarily provide information about its subject matter.",
      "A meaningful Text can be constructed by an Author, who may choose to write it down or speak it out as a letter or a speech respectively, and it could be directed towards a specific Addressee. However, the Text may not necessarily present details about its topic as a core feature.",
      "An Author is capable of generating a Text that holds importance, either in written or spoken form such as a letter or a speech, and it might be tailored for a particular Addressee. While the Text may contain details regarding its subject, it is not a fundamental aspect within this framework.",
      "In this context, an Author can compose a Text, which can either be written (like a letter) or spoken (like a speech), and it would encompass significant linguistic components. Moreover, the Text might be intended for a specific recipient, yet the information about its topic is not considered a primary focus.",
      "The act of producing a Text falls upon an Author, who could choose to create it in writing, such as a letter, or orally, such as a speech, and it would consist of meaningful linguistic elements. Importantly, the Text may have a designated Addressee, but the provision of information concerning its subject matter is not an intrinsic part of this particular framework."
    ]
  },
  "Rescuing": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Agent saves a Patient or an Asset from a Harmful_situation.\"",
    "Response": [
      "A Patient or an Asset is saved from a Harmful_situation by an Agent.",
      "From a Harmful_situation, an Agent rescues a Patient or an Asset.",
      "The act of saving a Patient or an Asset from a Harmful_situation is performed by an Agent.",
      "An Agent prevents a Harmful_situation by saving a Patient or an Asset.",
      "Saving a Patient or an Asset from a Harmful_situation is the responsibility of an Agent."
    ]
  },
  "Judgment_communication": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Communicator communicates a judgment of an Evaluee to an Addressee.  The judgment may be positive (e.g. praise) or negative (e.g. criticize), and this is indicated by the semantic types Positive and Negative attached to the lexical units.  This frame does not contain words where Evaluee and the Addressee are necessarily the same .\"",
    "Response": [
      "The act of communication involves a Communicator conveying a judgment about an Evaluee to an Addressee, which can be either positive or negative, represented by the semantic types Positive and Negative associated with the words used. It is important to note that in this context, the Evaluee and the Addressee may not be the same person.",
      "When a Communicator conveys an assessment of an Evaluee to an Addressee, the judgment can either be positive, such as expressing praise, or negative, such as offering criticism. This distinction is indicated by the inclusion of semantic types Positive and Negative connected to specific lexical units. It should be noted that the individuals being evaluated and addressed are not necessarily identical.",
      "In this framework, a judgment of an Evaluee is communicated to an Addressee by a Communicator. This judgment can be characterized as positive, containing words of praise, or negative, involving words of criticism. The semantic types Positive and Negative are used to signify this distinction. It is important to understand that the Evaluee and Addressee in this context are not always the same person.",
      "When conveying a judgment, the Communicator communicates an assessment of an Evaluee to an Addressee. This assessment can either be positive, indicated by the use of words associated with praise, or negative, which is conveyed through words linked to criticism. The presence of the semantic types Positive and Negative helps identify the nature of the judgment. It is worth noting that the Evaluee and Addressee do not necessarily refer to the same individual within this context.",
      "The act of communication within this framework involves a Communicator expressing a judgment about an Evaluee to an Addressee. This judgment may be either positive, involving the use of words related to praise, or negative, involving the use of words related to criticism. The differentiation between positive and negative judgments is established through the semantic types Positive and Negative attached to certain lexical units. It is essential to recognize that the Evaluee and the Addressee may not be the same person in this scenario."
    ]
  },
  "Change_tool": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Agent changes Tools, from the Old_tool to a New_tool.  The Tools may include vehicles, services providers, or more proto-typical implements.\"",
    "Response": [
      "A New_tool replaces the Old_tool in the possession of an Agent, which can be vehicles, service providers, or other more common tools.",
      "The Agent switches from using the Old_tool to the New_tool, with the Tools being either vehicles, service providers, or more typical tools.",
      "Moving from the Old_tool to a New_tool, an Agent adjusts their choice of Tools, which could be vehicles, service providers, or more conventional implements.",
      "When an Agent changes from the Old_tool to a New_tool, the range of Tools they utilize expands to include vehicles, service providers, or other standard tools.",
      "The Tools that an Agent uses, such as vehicles, service providers, or more traditional implements, are subject to change when switching from the Old_tool to a New_tool."
    ]
  },
  "Hold": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"The words in this frame describe the manipulation of an Entity by an Agent.  Generally, this implies that the Entity is not deeply or permanently physically affected, nor is it overall moved from one place to another.\"",
    "Response": [
      "An Agent manipulates an Entity, as described by the words in this frame. The manipulation does not inflict any lasting physical impact on the Entity, nor does it involve relocating the Entity.",
      "This frame contains words that explain how an Entity can be manipulated by an Agent. Generally, this sort of manipulation does not cause any lasting physical changes to the Entity, nor does it involve moving the Entity from one place to another.",
      "The manipulation of an Entity by an Agent is elucidated through the words found in this frame. Typically, this form of manipulation does not result in any significant physical alterations to the Entity, nor does it involve relocating the Entity altogether.",
      "In this frame, you will find words that describe how an Agent manipulates an Entity. As a general rule, this manipulation does not cause any substantial long-term physical effects on the Entity, nor does it involve transferring the Entity from one location to another.",
      "The words contained within this frame elucidate the process of an Agent manipulating an Entity. Generally speaking, such manipulation does not result in any profound or permanent physical changes to the Entity, nor does it entail moving the Entity to a different place."
    ]
  },
  "Being_in_operation": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Device or machine is in (or out of) service. Note that being broken or functional is a separate issue from being turned on or off. This latter notion is what the present frame is concerned with.  The Time when and the Place where the Device is in use may be specified, as may be the Purpose a backgrounded human User had in turning the Device on or off.\"",
    "Response": [
      "The Device or machine can either be in service or out of service, with its functionality being distinct from its power state. The present frame focuses on whether the Device is turned on or off. Additionally, the specific Time and Place of device usage, as well as the underlying Purpose of the user, can be specified.",
      "Whether a Device or machine is operational or non-operational is not contingent on its power status. The present frame primarily concerns itself with whether the Device is switched on or off. Furthermore, it is possible to specify the Time and Place of device utilization, along with the intended Purpose of the individual activating or deactivating it.",
      "The state of being in service or out of service is applicable to Devices or machines, independent of their power condition. The current frame specifically addresses whether the Device is turned on or off. It is also viable to indicate the Time and Place of Device utilization, as well as the underlying Purpose behind the user's decision to toggle its power.",
      "A Device or machine can be categorized as either functional or non-functional, regardless of whether it is switched on or off. The main focus of the present frame is centered around the power state of the Device. Additionally, one can specify the Time and Place when the Device is used, along with the Purpose that prompted the user to activate or deactivate it.",
      "The operation status of a Device or machine, whether it is in service or out of service, does not depend on whether it is turned on or off. The present frame is primarily concerned with the power state of the Device. Moreover, it is possible to indicate the specific Time and Place of Device usage, as well as the Purpose behind the user's action of powering it on or off."
    ]
  },
  "Recording": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Agent sets down in permanent form information about the occurrence of a Phenomenon. Alternatively, the Agent records that an Entity had a particular Value for one of its Attributes.\"",
    "Response": [
      "Information about the occurrence of a Phenomenon is permanently documented by an Agent.",
      "A Phenomenon is recorded in a permanent form by an Agent, providing information.",
      "An Agent's role is to document information about the occurrence of a Phenomenon in a permanent manner.",
      "An Entity's Attribute value is recorded by an Agent, indicating a specific occurrence.",
      "An Agent can either document information about a Phenomenon or record an Entity's Attribute value in a permanent way."
    ]
  },
  "Carry_goods": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Distributor sells, lends, or otherwise distributes a class of Goods. In the prototypical case, the Distributor is a retailer who generally keeps some type of Goods on site for the purpose of selling it to a buyer. Extensions include lending Goods (e.g., libraries, movie rental outlets), organization-internal distribution (as in a hospital), or other non-commercial distribution centers. The Goods are constrained to be a type of item (e.g., canned goods, antique dressers) rather than a particular or unique item (e.g., Smith's last self-portrait, that guitar I saw here last week). Note that a Distributor may carry some particular goods, but may not have it on hand at that exact moment.\"",
    "Response": [
      "Distributors are individuals or businesses who sell, lend, or distribute a specific category of goods. Usually, these distributors are retailers who keep a stock of goods on their premises to sell to customers. Other examples include lending goods, internal distribution within organizations (such as hospitals), or non-commercial distribution centers. It is important to note that the goods being distributed are a general type of item (like canned goods or antique dressers) rather than a specific or unique item (such as Smith's last self-portrait or a guitar seen last week). Additionally, it is possible for a distributor to have certain goods available but not necessarily in stock at a given moment.",
      "The role of a Distributor involves selling, lending, or distributing a certain class of goods. Typically, this role is carried out by retailers who maintain an inventory of goods for the purpose of selling them to buyers. This can also include lending goods, distributing goods within an organization (such as a hospital), or operating non-commercial distribution centers. The goods being distributed must belong to a specific category (such as canned goods or antique dressers) rather than being a unique or individual item (like Smith's last self-portrait or a guitar seen at the location last week). However, it is important to note that a Distributor might have specific goods available, but they may not be physically present at a given moment.",
      "In the standard scenario, a Distributor engages in the sale, lending, or distribution of a particular class of Goods. Usually, this role is fulfilled by retailers who maintain an inventory of Goods to sell to potential buyers. Extensions of this role include lending Goods (such as in the case of libraries or movie rental outlets), distributing Goods within an organization (like a hospital), or managing non-commercial distribution centers. The Goods that are distributed must belong to a general category (for example, canned goods or antique dressers) rather than being a specific or unique item (like Smith's final self-portrait or the guitar seen at the premises last week). It is important to acknowledge that a Distributor may have specific goods available for distribution, but they might not be physically present at a given moment.",
      "A Distributor is an individual or entity involved in the selling, lending, or distribution of a specific type of goods. Typically, this role is fulfilled by retailers who maintain an inventory of goods to satisfy the needs of buyers. However, there are other instances where goods are lent (such as in libraries or movie rental outlets), internally distributed within organizations (like hospitals), or distributed through non-commercial distribution centers. The goods being distributed have to be restricted to a certain category (such as canned goods or antique dressers) rather than being a particular or unique item (like Smith's final self-portrait or the guitar observed at the location last week). It should be noted that while a Distributor may carry specific goods, they may not be readily available in stock at any given moment.",
      "The core responsibility of a Distributor lies in the sale, lending, or distribution of a particular kind of Goods. In the typical scenario, this role is performed by retailers who keep a variety of Goods readily available for sale to potential buyers. Additional applications include lending Goods (for instance, libraries or movie rental outlets), internal distribution within organizations (such as in a hospital context), or other non-commercial distribution centers. The category of Goods being distributed is not limited to a specific item (like Smith's last self-portrait or a guitar seen at the location last week), but encompasses a general type of item (such as canned goods or antique dressers). It is important to acknowledge that a Distributor might have certain Goods in his possession, however, they may not be physically present on-hand at a precise moment."
    ]
  },
  "Cost": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Payer gives up (or potentially gives up) the use of an Asset (generally money) in order to achieve an Intended_event.  This event is often more specifically described as gaining possession of some Goods or receiving a Service.  In the majority of cases, the Payer is described generically (INI), and the situation depicted answers the question of how much of an Asset would have to be given up to receive the Goods or bring about the Intended_event.\"",
    "Response": [
      "In order to achieve an Intended_event, a Payer may give up or potentially give up the use of an Asset, usually money. This event can be described as gaining possession of Goods or receiving a Service. Often, the Payer is referred to generically (INI), and the depicted situation determines the amount of Asset to be given up for the Goods or Intended_event.",
      "The act of giving up, or potentially giving up, the use of an Asset (typically money) is done by a Payer in order to accomplish an Intended_event. This event is often further defined as obtaining possession of Goods or acquiring a Service. In most cases, the Payer is described generically (INI), and the depicted situation provides the answer to how much Asset must be surrendered for the Goods or to bring about the Intended_event.",
      "To achieve an Intended_event, a Payer may relinquish or potentially relinquish the utilization of an Asset, usually money. This Intended_event is often more specifically described as acquiring Goods or receiving a Service. Generally, the Payer is referred to as being generic (INI), and the situation portrayed reveals the quantity of Asset that needs to be sacrificed in order to obtain the Goods or achieve the Intended_event.",
      "The purpose of giving up (or potentially giving up) an Asset, typically money, by a Payer is to accomplish an Intended_event. This event is often specified as obtaining ownership of specific Goods or being provided with a Service. In most instances, the Payer is characterized as generic (INI), and the depicted scenario answers the question of how much Asset needs to be forfeited in order to receive the Goods or bring about the Intended_event.",
      "For the sake of achieving an Intended_event, a Payer may forgo or potentially forgo the use of an Asset, commonly money. This particular event is often defined more specifically as acquiring certain Goods or obtaining a Service. Generally, the Payer is denoted as generic (INI), and the depicted situation provides the solution to the query of the exact amount of Asset that must be sacrificed to acquire the Goods or facilitate the Intended_event."
    ]
  },
  "Departing": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An object (the Theme) moves away from a Source. The Source may be expressed or it may be understood from context, but its existence is always implied by the departing word itself.\"",
    "Response": [
      "The Theme, an object, is moving away from a Source, which can either be explicitly stated or inferred from the context, but its presence is always suggested by the departing word itself.",
      "A Source is always implied by the departing word itself as an object, referred to as the Theme, moves away from it; the Source can be expressed or understood depending on the context.",
      "The departure of an object (also known as the Theme) from a Source implies the existence of the Source, which might be expressed or implied based on the context.",
      "While the Source may not always be explicitly mentioned, it is always implied by the departing word itself as an object (referred to as the Theme) moves away from it.",
      "In the context of an object moving away, the departing word itself suggests the existence of a Source, which can be expressed or deduced from the situation but is always implied."
    ]
  },
  "GiveUp": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Agent leaves behind a Theme effectively rendering it no longer within their control or of the normal security as one's property.\"",
    "Response": [
      "When an Agent departs, they effectively relinquish control over a Theme, making it no longer their property or subject to normal security measures.",
      "By leaving, an Agent effectively releases a Theme from their grasp, causing it to no longer be under their control or the usual security protocols.",
      "The departure of an Agent results in their inability to control a Theme any longer, rendering it free from their ownership and standard security measures.",
      "An Agent's departure causes a Theme to become beyond their jurisdiction, thereby relinquishing control and removing it from their possession or customary security controls.",
      "Once an Agent leaves, they lose control over a Theme, thus rendering it no longer their own property or within the scope of regular security measures."
    ]
  },
  "Change_of_leadership": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"This frame concerns the appointment of a New_leader or removal from office of an Old_leader.  The Selector brings about the change in leadership, for example, by electing or overthrowing a leader. Some words in the frame describe the successful removal from office of a leader (e.g. depose, oust), others simply the attempt (e.g. uprising, rebellion).\"",
    "Response": [
      "In this frame, there is a focus on either the selection of a New_leader or the dismissal of an Old_leader.",
      "The change in leadership within this context is brought about by the Selector, who can either elect or overthrow a leader.",
      "Several terms within this frame signify the effective removal of a leader from their position, such as depose or oust, while others merely indicate an attempt, like uprising or rebellion.",
      "Within this framework, attention is given to either the appointment of a New_leader or the removal of an Old_leader from power.",
      "The alteration in leadership occurs through the actions of the Selector, who has the ability to either elect a new leader or initiate the overthrow of the current one."
    ]
  },
  "Escaping": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Self-moving Escapee departs from an Undesirable_location.\"",
    "Response": [
      "An Undesirable_location is left behind by a Self-moving Escapee.",
      "The Self-moving Escapee takes off from an Undesirable_location.",
      "An Undesirable_location is abandoned by a Self-moving Escapee.",
      "A Self-moving Escapee flees from an Undesirable_location.",
      "From an Undesirable_location, a Self-moving Escapee makes its departure."
    ]
  },
  "Aiming": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Agent adjusts an Instrument to enable it to interact directly with a difficult-to-access Target_location.  Usually, there is a Targeted entity at the Target_location which is mentioned in its place.\"",
    "Response": [
      "To facilitate direct interaction with a hard-to-reach Target_location, an Agent modifies an Instrument.",
      "The purpose of an Agent adjusting an Instrument is to establish a direct connection with a challenging Target_location.",
      "An Instrument is modified by an Agent in order to enable direct engagement with a difficult-to-access Target_location.",
      "A Targeted entity is typically found at the Target_location and an Agent adjusts an Instrument to interact with it directly.",
      "When faced with a challenging Target_location, an Agent adjusts an Instrument to allow for direct interaction, often involving a Targeted entity."
    ]
  },
  "Hindering": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"In this frame a Hindrance makes it more difficult for a Protagonist to complete their intended Action or a Hindrance directly affects an Action where the Action can be a natural act or the actions of many individuals in a collective endeavor.  Crucially, these lexical units do not entail that the Protagonist was unable to complete the Action or that the Action did not occur. The Hindrance may indicate a lack of enablement or an obstacle on the natural progression of the Protagonist or Action\"",
    "Response": [
      "The presence of a Hindrance within this framework serves to enhance the difficulty faced by the Protagonist in their pursuit of accomplishing their intended Action. This Hindrance can either directly hinder the progress of an Action, whether it be a solitary act or a collective effort involving multiple individuals. It is important to note that the existence of these linguistic units does not necessarily imply that the Protagonist was incapable of completing the Action or that the Action itself did not take place. Instead, the Hindrance may signify either a hindrance in enabling the Action or an obstacle impeding the natural flow of the Protagonist and the Action.",
      "When discussing this framework, the presence of a Hindrance serves to complicate the Protagonist's quest to fulfill their intended Action. This Hindrance directly impacts the execution of an Action, whether it be an innate act or the combined efforts of a group of individuals. It is important to note that the use of these specific language components does not automatically imply that the Protagonist was unable to accomplish the Action or that the Action did not occur. Instead, the presence of a Hindrance may indicate a lack of facilitation or an obstruction that hindered the natural progression of the Protagonist and the Action.",
      "Within this particular framework, the inclusion of a Hindrance results in an increased level of difficulty faced by the Protagonist in their endeavor to successfully carry out their intended Action. This Hindrance can directly impede an innate act or hinder the progress of a collective effort involving multiple individuals. It is crucial to note that the utilization of these lexical units does not necessarily imply that the Protagonist was incapable of completing the Action or that the Action itself did not take place. Instead, the Hindrance may signify a lack of facilitation or an obstacle inhibiting the smooth unfolding of the Protagonist and the Action.",
      "This framework incorporates the concept of Hindrance, which serves to heighten the challenges faced by the Protagonist as they strive to fulfill their intended Action. The Hindrance has a direct impact on the execution of the Action, whether it is an individual's natural act or the combined efforts of numerous individuals in a collective endeavor. It is important to emphasize that the existence of these specific lexical units does not inherently suggest that the Protagonist was unable to complete the Action or that the Action did not take place. Instead, the Hindrance may indicate a lack of enablement or an obstacle that disrupts the smooth progression of the Protagonist and the Action.",
      "In this particular frame, the introduction of a Hindrance adds an additional layer of complexity to the Protagonist's ability to successfully carry out their intended Action. This Hindrance has a direct influence on either an individual's natural act or the actions undertaken by a group of individuals in a collective endeavor. It is crucial to highlight that the use of these specific lexical units does not automatically imply that the Protagonist was incapable of completing the Action or that the Action itself did not occur. Rather, the Hindrance may signify a lack of facilitation or an obstacle that obstructs the smooth progression of the Protagonist and the Action."
    ]
  },
  "Preserving": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"In this frame an  Agent preserves a Patient in order to prevent it from decaying.   A Medium may be used.   Bill mummified John.  Tess pickled the beets  in vinegar.  The Smiths dried the apples.\"",
    "Response": [
      "To prevent decay, an Agent preserves a Patient in this scenario, possibly using a Medium.",
      "John was mummified by Bill, serving as an Agent to prevent decay.",
      "Tess preserved the beets by pickling them in vinegar.",
      "The Smiths chose to dry the apples as a means of preservation.",
      "In order to prevent decay, an Agent utilized a Medium to preserve a Patient in this case."
    ]
  },
  "Create_artwork": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Creator creates an artifact that is typically an iconic Representation of an actual or imagined entity or event. The Representation may also be evocative of an idea while not based on resemblance.\"",
    "Response": [
      "Typically, a Creator produces an artifact that serves as an iconic portrayal, representing either a real or fictional entity or event. This portrayal may also evoke an idea while not relying on physical similarity.",
      "An artifact produced by a Creator often takes the form of an iconic representation, symbolizing an actual or imagined entity or event. Furthermore, this representation can also evoke an idea without being based on likeness.",
      "When a Creator crafts an artifact, it usually becomes an iconic Representation of either a real or imaginary entity or event. At the same time, this Representation can also evoke an idea without relying on similarity in appearance.",
      "In general, a Creator's creation manifests as an artifact, frequently serving as an iconic Representation of an existing or fictional entity or event. Additionally, this Representation can evoke an idea even if it does not resemble the subject.",
      "A Creator typically brings forth an artifact that acts as an iconic representation, symbolizing either a real or imagined entity or event. This representation can also evoke an idea without necessarily being based on physical resemblance."
    ]
  },
  "Openness": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Useful_location is accessible to some (possibly generic) Theme despite a potential Barrier, or is not accessible because of the Barrier.\"",
    "Response": [
      "A place that can be easily reached by certain, possibly generic, subjects, even if there is a possible obstacle, or cannot be reached due to the presence of an obstacle.",
      "A location that is within reach for certain individuals, possibly of a general nature, regardless of any potential barrier, or cannot be reached due to the existence of a barrier.",
      "The accessibility of a useful location to certain entities, which may be generic, despite the presence of a potential obstacle, or its inaccessibility due to the barrier.",
      "A location that can be accessed by certain subjects, possibly generic in nature, even with a potential barrier, or cannot be accessed due to the presence of a barrier.",
      "A useful place that is within reach for some individuals, possibly of a generic type, regardless of any potential hindrance, or cannot be accessed due to the presence of a barrier."
    ]
  },
  "Connect": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Figure is located in contact with a Ground.  With some words that evoke this frame, the Figure is also asserted to be fully or partially supported by the Ground (e.g. on), while in others a support relation is either denied (e.g. to, as in \"she put her hand to the wall\") or unspecified (e.g. against).  In addition, some LUs assert a direction in which to find the Figure from the Ground (e.g. atop).\"",
    "Response": [
      "A Ground is in contact with a Figure, which is fully or partially supported by the Ground through certain words that evoke this frame, such as \"on\".",
      "The Figure is positioned in contact with a Ground, and certain words that evoke this frame, such as \"on\", assert that the Figure is fully or partially supported by the Ground.",
      "The Ground and the Figure are in contact, and the Figure is either fully or partially supported by the Ground through specific words that evoke this frame, like \"on\".",
      "There is a contact between a Figure and a Ground, and the Figure is either fully or partially supported by the Ground through certain words that evoke this frame, such as \"on\".",
      "The Figure is connected to a Ground, and through the use of certain words that evoke this frame, like \"on\", it is stated that the Figure is fully or partially supported by the Ground."
    ]
  },
  "Reveal_secret": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Speaker reveals Information that was previously secret to an Addressee. In some cases, the Addressee is expected to keep the Information from other parties. The Information may be damaging to the reputation of the Speaker. Instead of (or in addition to) a Speaker, a Medium may also be mentioned. Likewise, a Topic may be stated instead of Information. Some lexical units in this frame imply that the Addressee has already been confronted with the Information.\"",
    "Response": [
      "The Addressee is informed of previously undisclosed information by the Speaker, who expects the Addressee to maintain its confidentiality, as it could harm the Speaker's reputation. Alternatively, a Medium may be involved in delivering the message. Similarly, the Speaker may refer to a specific Topic rather than conveying actual information. Certain words used in this context suggest that the Addressee is already aware of the Information.",
      "The Speaker divulges concealed information to an Addressee, who is anticipated to keep it confidential, especially if it could tarnish the Speaker's reputation. Additionally, a Medium might also play a role in transmitting the undisclosed details. Likewise, instead of conveying information, the Speaker may address a specific Topic. Some linguistic elements within this scenario imply that the Addressee has already been made aware of the Information.",
      "To an Addressee, a Speaker discloses previously hidden information, which is expected to be kept undisclosed from others to protect the Speaker's reputation. Additionally, a Medium may be involved in delivering the message. Alternatively, the Speaker may focus on a particular Topic rather than conveying specific Information. Various lexical components in this context indicate that the Addressee has already been exposed to the Information.",
      "An Addressee receives knowledge from a Speaker that was previously undisclosed, and the Addressee is expected to maintain its confidentiality, especially if it could harm the reputation of the Speaker. In addition to the Speaker, a Medium may also be mentioned as a source of the information. Similarly, rather than conveying actual information, the Speaker may introduce a specific Topic. Certain linguistic elements within this context suggest that the Addressee has already encountered the Information.",
      "The Speaker imparts information to an Addressee, which was previously concealed and is anticipated to be kept confidential from others to avoid damaging the Speaker's reputation. Alternatively, the message may be delivered through a Medium. Similarly, instead of conveying Information, the Speaker may introduce a specific Topic. Certain lexical units utilized within this framework indicate that the Addressee has already been informed of the Information."
    ]
  },
  "Response": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Agent performs a Response action in consequence of a Trigger event. In many cases, a non-agentive Responding_entity causes the Response after the Trigger occurs.\"",
    "Response": [
      "The Response action is carried out by an Agent following a Trigger event.",
      "When a Trigger event occurs, an Agent takes on the task of performing a Response action.",
      "The Response action is the result of a Trigger event and is performed by an Agent.",
      "A Trigger event prompts an Agent to perform a Response action.",
      "In numerous instances, the Response is initiated after the Trigger event by a non-agentive Responding_entity."
    ]
  },
  "Court_examination": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Questioner asks a Witness (or defendant) questions in the context of a court procedure.\"",
    "Response": [
      "In the context of a court procedure, a Questioner interrogates a Witness (or defendant) by asking them questions.",
      "Questions are asked to a Witness (or defendant) by a Questioner during a court procedure.",
      "During a court procedure, a Questioner poses questions to a Witness (or defendant).",
      "In the context of a court procedure, a Witness (or defendant) is questioned by a Questioner.",
      "In a court procedure, a Questioner directs queries towards a Witness (or defendant)."
    ]
  },
  "Scrutiny": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"This frame concerns a Cognizer (a person or other intelligent being) paying close attention to something, the Ground, in order to discover and note its salient characteristics.  The Cognizer may be interested in a particular characteristic or entity, the Phenomenon, that belongs to the Ground or is contained in the Ground (or to ensure that such a property of entity is not present).\"",
    "Response": [
      "The focus of this framework is on a Cognizer who carefully observes the Ground to identify and record its important features. The Cognizer's attention is directed towards a specific characteristic or entity, known as the Phenomenon, which is part of or found within the Ground (or to ensure that such a property or entity is not present).",
      "In this context, a Cognizer, which can be a person or any intelligent being, devotes significant attention to the Ground with the purpose of recognizing and documenting its distinctive attributes. The Cognizer's interest might lie in a specific quality or entity called the Phenomenon, which is either inherent in the Ground or enclosed within it (or to verify the absence of such a quality or entity).",
      "The core concept discussed here involves a Cognizer, who could be an individual or any other intelligent entity, carefully observing and examining the Ground in order to identify and make note of its notable characteristics. The Cognizer may have a particular interest in a specific trait or entity, referred to as the Phenomenon, which either belongs to the Ground or is encompassed within it (or to ensure the absence of such a trait or entity).",
      "This framework centers around the actions of a Cognizer, who is defined as a person or any intelligent being, as they pay thorough attention to the Ground in order to discover and record its significant traits. The Cognizer's focus may be on a particular quality or entity, known as the Phenomenon, which is either part of the Ground or contained within it (or to confirm the absence of such a property or entity).",
      "The main idea presented here revolves around a Cognizer, whether it be an individual or any other intelligent being, who dedicates their attention to closely observing the Ground to uncover and document its notable characteristics. The Cognizer may have a specific interest in a particular attribute or entity called the Phenomenon, which can either be a part of the Ground or exist within it (or to ensure that such a quality or entity is not present)."
    ]
  },
  "Lighting": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Emitter emits a Beam of light from a Source, along a Path, and/or towards a Goal.  Essentially, this frame denotes the (semi-)fictive motion of the the Beam.\"",
    "Response": [
      "The Beam is emitted by the Emitter, from a Source and can be directed along a Path or towards a Goal. In essence, this frame represents the (semi-)fictitious movement of the Beam.",
      "A Beam is emitted from a Source by an Emitter, and it may travel along a Path or be directed towards a Goal. In essence, this frame symbolizes the (semi-)fictive motion of the Beam.",
      "From a Source, an Emitter releases a Beam of light that can travel along a Path or be directed towards a Goal. Essentially, this frame illustrates the (semi-)fictitious movement of the Beam.",
      "The Emitter emits a Beam of light that originates from a Source and can either follow a Path or be directed towards a Goal. In summary, this frame signifies the (semi-)fictive motion of the Beam.",
      "A Beam of light is emitted from a Source by an Emitter and can travel along a Path or be directed towards a Goal. Ultimately, this frame represents the (semi-)fictitious movement of the Beam."
    ]
  },
  "Criminal_investigation": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"This frame describes the process that involves the inquiry and determination by an authority, the Investigator, of the circumstances surrounding an Incident perpetrated by a Suspect.\"",
    "Response": [
      "An authority called the Investigator utilizes this framework to investigate and determine the details of an Incident committed by a Suspect.",
      "The process described in this frame involves the investigation and assessment conducted by an authority figure known as the Investigator, regarding the circumstances of an Incident carried out by a Suspect.",
      "The framework outlined here outlines the steps taken by an authority figure, referred to as the Investigator, to inquire and ascertain the facts regarding an Incident committed by a Suspect.",
      "Within this framework, an authority known as the Investigator carries out an inquiry and reaches a conclusion concerning the details surrounding an Incident committed by a Suspect.",
      "In this particular frame, the inquiry and determination about an Incident committed by a Suspect is conducted by an authority figure called the Investigator."
    ]
  },
  "Hiding_objects": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Agent causes a Hidden_object to become perceptually inaccessible to potential perceivers by placing it in a Hiding_place or putting in place an Obstruction that screens the object.\"",
    "Response": [
      "By placing it in a Hiding_place or putting in place an Obstruction that screens the object, an Agent makes the Hidden_object visually unattainable to potential perceivers.",
      "Potential perceivers are rendered unable to perceive a Hidden_object as an Agent positions it in a Hiding_place or sets up an Obstruction to act as a screen for the object.",
      "A Hidden_object is made imperceptible to potential perceivers by an Agent when they place it in a Hiding_place or arrange for an Obstruction to conceal the object.",
      "The presence of an Agent causes a Hidden_object to become visually unperceivable by potential perceivers through its placement in a Hiding_place or the installation of an Obstruction as a screen for the object.",
      "By positioning a Hidden_object in a Hiding_place or implementing an Obstruction to serve as a barrier, an Agent obstructs potential perceivers from perceiving the object."
    ]
  },
  "Confronting_problem": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Agent becomes involved in an Issue which has negative consequences for them. The Agent will normally respond to resolve the Issue.\"",
    "Response": [
      "When an Agent becomes entangled in an Issue that brings unfavorable outcomes, they typically react by attempting to resolve it.",
      "In the event that an Agent finds themselves caught up in an Issue that leads to adverse effects, their usual course of action is to respond and find a solution.",
      "A situation arises where an Agent becomes implicated in an Issue that has detrimental consequences, prompting them to take action in order to resolve it.",
      "When an Agent becomes embroiled in an Issue that results in negative repercussions, they will typically step in and address the situation.",
      "At times, an Agent finds themselves entwined in an Issue that brings about unfavorable consequences, leading them to instinctively respond and seek resolution."
    ]
  },
  "Renting": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Lessee gains the use of Goods owned by a Lessor by payment to the Lessor.\"",
    "Response": [
      "By paying the Lessor, a Lessee is granted the utilization of Goods owned by the Lessor.",
      "The Lessee acquires the privilege to use Goods owned by the Lessor in exchange for payment made to the Lessor.",
      "In return for payment, a Lessee receives the right to utilize Goods owned by a Lessor.",
      "Payment to the Lessor allows a Lessee to obtain the use of Goods owned by the Lessor.",
      "By remitting payment to the Lessor, a Lessee attains the ability to use Goods owned by the Lessor."
    ]
  },
  "Breathing": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Agent causes Air to move in a direction, usually specifying either in or out of the body.\"",
    "Response": [
      "Typically, an Agent prompts the movement of Air either into or out of the body.",
      "Air movement in the body is generally instigated by an Agent, which typically directs it either inward or outward.",
      "The usual direction of Air flow in the body is determined by an Agent, either guiding it into or out of the body.",
      "An Agent is responsible for inducing the movement of Air in one direction, commonly either into or out of the body.",
      "In the body, Air is typically set in motion by an Agent, which specifies its direction as either inward or outward."
    ]
  },
  "Patrolling": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An individual or group, the Patrol moves through and examines a Ground in order to ensure that it is in a generally Desired_state_of_affairs, particularly that it is safe and contains no dangerous Unwanted_entity. Rather than moving through the Ground, the Patrol may simply move such that all the (relevant portions of) Ground can be observed and checked.\"",
    "Response": [
      "The Patrol, whether an individual or a group, conducts inspections of a Ground, ensuring it meets the generally Desired_state_of_affairs, primarily focusing on safety and the absence of any hazardous Unwanted_entity. Instead of traversing the Ground, the Patrol can move strategically to observe and assess all (pertinent sections of) the Ground.",
      "To guarantee a Ground is in the desired state and free from any potentially harmful entities, a Patrol, whether comprised of one person or a group, diligently examines the area. The Patrol may choose to survey the Ground without physically traversing it, as long as they can observe and evaluate all the relevant parts.",
      "When inspecting a Ground, the Patrol, whether an individual or a collective, ensures that it aligns with the general Desired_state_of_affairs, with a particular emphasis on safety and the absence of any dangerous Unwanted_entity. Instead of traversing the Ground, the Patrol may opt to position themselves in a manner that allows them to observe and verify all (significant sections of) the Ground.",
      "The Patrol, which can be either an individual or a group, carries out investigations on a designated Ground, aiming to ensure it meets the desired conditions, particularly by ensuring its safety and absence of any hazardous Unwanted_entity. In lieu of physically moving across the entire Ground, the Patrol can adopt a strategy where they observe and inspect all (pertinent sections of) the Ground.",
      "In order to verify that a Ground meets the desired conditions, including safety and the absence of dangerous Unwanted_entity, the Patrol, whether constituted by an individual or a collective, surveys and assesses the area. Alternatively, the Patrol may choose to position themselves in a manner that enables them to observe and examine all (relevant sections of) the Ground without physically traversing it."
    ]
  },
  "Arrest": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"Authorities charge a Suspect, who is under suspicion of having committed a crime (the Charges), and take him/her into custody.The police arrested Harry on charges of manslaughter.\"",
    "Response": [
      "Harry was arrested by the police for charges of manslaughter after being suspected of committing a crime.",
      "Having suspicions that the suspect had committed a crime, the authorities charged him/her and took him/her into custody. Harry, in this case, was arrested by the police on charges of manslaughter.",
      "The police took Harry into custody after charging him with manslaughter, as they suspected him of committing a crime.",
      "A suspect, who was under suspicion of committing a crime, was charged by the authorities and subsequently taken into custody. They arrested Harry on charges of manslaughter.",
      "After facing charges for manslaughter, Harry was arrested by the police as they believed he had committed a crime."
    ]
  },
  "Convincing": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Speaker succeeds in getting an Addressee to believe or plan to execute the Content the Speaker has in mind. In most cases, the information is related to some course of action for the Addressee, and the words of this frame imply that the Addressee has formed an intention to act consistently with the Content. There is no implication that the Addressee actually acts upon the intention formed. In the case of convince and persuade, the act that the Speaker wishes the Addressee to perform can be the adoption of a belief, which may be expressed as a that-clause or as an of-PP complement.\"",
    "Response": [
      "The Speaker is able to persuade the Addressee to believe or plan to carry out the desired idea or message.",
      "The Speaker successfully influences the Addressee to accept or make plans to implement the intended message or idea.",
      "The Speaker accomplishes the task of convincing or motivating the Addressee to embrace or prepare to execute the proposed content.",
      "The Addressee, as a result of the Speaker's efforts, is inclined to believe or intend to carry out the message or idea in question.",
      "When attempting to convince or persuade, the Speaker aims for the Addressee to adopt a belief, which can be portrayed through a that-clause or an of-PP complement."
    ]
  },
  "Commerce_sell": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"These are words describing basic commercial transactions involving a buyer and a seller exchanging money and goods, taking the perspective of the seller.  The words vary individually in the patterns of frame element realization they allow. For example, the typical patterns for SELL: SELLER sells GOODS to BUYER for MONEY.\"",
    "Response": [
      "The seller perspective focuses on basic commercial transactions where a buyer and seller exchange goods and money. Words used to describe these transactions vary in the way frame elements are expressed. For instance, when it comes to selling, a common pattern involves the seller selling goods to the buyer for money.",
      "When considering basic commercial transactions between a buyer and seller, the emphasis is on the seller's viewpoint. These transactions involve the exchange of money and goods, and the words used to describe them differ in how frame elements are realized. For instance, the typical pattern for selling is when the seller sells goods to the buyer in exchange for money.",
      "From the seller's perspective, basic commercial transactions revolve around the exchange of money and goods with a buyer. The vocabulary used to describe these transactions varies in terms of how frame elements are expressed. For example, the usual pattern for selling is for the seller to sell goods to the buyer and receive money in return.",
      "Looking at commercial transactions between a seller and buyer, the seller's viewpoint becomes important. These transactions involve the exchange of money and goods, and the words used to describe them differ in how frame elements are realized. For instance, when it comes to selling, the typical pattern involves the seller selling goods to the buyer for a specific amount of money.",
      "The seller's perspective plays a crucial role in basic commercial transactions, where money and goods are exchanged between a buyer and seller. The vocabulary used to describe these transactions varies depending on how frame elements are expressed. For instance, the common pattern for selling is when the seller sells goods to the buyer, receiving money in return."
    ]
  },
  "Cure": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"This frame deals with a Healer treating and curing an Affliction (the injuries, disease, or pain) of the Patient, sometimes also mentioning the use of a particular Treatment or Medication. This frame differs from Medical_intervention in that this frame deals only with cases in which the Patient is cured of the Affliction, not just treated for the Affliction.\"",
    "Response": [
      "In this frame, a Healer is involved in treating and healing physical afflictions, such as injuries, diseases, or pain, experienced by a Patient. It may also specify the employment of a specific Treatment or Medication.",
      "Contrastingly, this frame is distinct from Medical_intervention as it solely focuses on scenarios where the Patient is completely cured of the Affliction, rather than just being treated for it.",
      "The main theme of this frame revolves around a Healer's role in treating and resolving various Afflictions experienced by a Patient, often mentioning specific Treatments or Medications used.",
      "Unlike Medical_intervention, this particular frame exclusively covers situations where the Patient is completely rid of the Affliction, not simply receiving treatment for it.",
      "Within this frame, the emphasis is on a Healer's efforts to effectively treat and heal the Patient's Affliction, whether it be injuries, diseases, or pain, including the mention of specific Treatment or Medication."
    ]
  },
  "Temporary_stay": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Guest stays for a time at a Location, which is not his or her permanent residence, for some Duration. The Location is often the permanent residence of a Host.\"",
    "Response": [
      "For a certain period, a visitor resides in a place other than their own home, known as a Location, while the Host inhabits it permanently.",
      "A Location is where a temporary guest resides for a duration that is not their permanent residence, usually occupied by a Host as their home.",
      "During a particular length of time, an individual stays as a Guest in a Location that is not their permanent dwelling, typically owned by a Host.",
      "A temporary resident, known as a Guest, spends a period in a Location that is not their permanent abode, often occupied by a Host as their permanent residence.",
      "The Location, which is ordinarily the permanent dwelling of a Host, is where a Guest temporarily stays for a specific period."
    ]
  },
  "Dispersal": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Agent or a Cause disperses or scatters Individuals from the Source,a relatively confined space, to a the Goal_area, a broader space.\"",
    "Response": [
      "Individuals are dispersed or scattered from a relatively confined space, known as the Source, to a broader space called the Goal_area, by an Agent or a Cause.",
      "A broad space referred to as the Goal_area is the destination where Individuals are dispersed or scattered from the Source, a comparatively smaller space, by an Agent or a Cause.",
      "An Agent or a Cause is responsible for dispersing or scattering Individuals from the Source, a relatively small space, towards the Goal_area, which is a broader space.",
      "From the Source, a compact space, Individuals are dispersed or scattered towards the Goal_area, a more extensive space, by an Agent or a Cause.",
      "The dispersal or scattering of Individuals from a confined space known as the Source to a broader space called the Goal_area is caused by an Agent or a Cause."
    ]
  },
  "Collaboration": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"Partner_1 and Partner_2 or a group of Partners  work together in some Undertaking. The Partners are taken to be of equal status even when expressed disjointly.\"",
    "Response": [
      "In some Undertaking, Partner_1 and Partner_2, or a group of Partners collaborate.",
      "Partner_1 and Partner_2, or a collective of Partners, cooperate in an Undertaking.",
      "A group of Partners, including Partner_1 and Partner_2, work together in some Undertaking.",
      "Partner_1 and Partner_2, or a team of Partners, engage in a collaborative effort in an Undertaking.",
      "In an Undertaking, Partner_1 and Partner_2, or a consortium of Partners, join forces."
    ]
  },
  "Extradition": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Suspect in a Current_jurisdiction is forced by Authorities (of the Current_jurisdiction) to go to the Crime_jurisdiction, i.e. the jurisdiction which requested that the Suspect be handed over for trial for a crime which he or she is suspected to have committed in the Crime_jurisdiction.  The purpose or reason for the extradition may also be expressed.\"",
    "Response": [
      "Authorities of the Current_jurisdiction exert pressure on a Suspect to transfer them to the Crime_jurisdiction, where they are wanted for a crime they are believed to have committed.",
      "In order to stand trial for a crime in the Crime_jurisdiction, a Suspect is compelled by the Current_jurisdiction's Authorities to be extradited.",
      "The Authorities of the Current_jurisdiction force a Suspect to be handed over to the Crime_jurisdiction, where they are accused of committing a crime.",
      "The Crime_jurisdiction requests the extradition of a Suspect from the Current_jurisdiction, and the Authorities enforce this transfer.",
      "A Suspect, who is suspected of committing a crime in the Crime_jurisdiction, is coerced by the Authorities of the Current_jurisdiction to be transported there for trial."
    ]
  },
  "Change_sentiment": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Agent intentionally seeks to bring about an internal mental or emotional state in the Experiencer.  This frame in closely related to  Experiencer_obj.\"",
    "Response": [
      "The Agent deliberately aims to induce an internal mental or emotional condition in the Experiencer. This frame is closely associated with Experiencer_obj.",
      "Specifically, the Agent actively pursues the creation of an internal mental or emotional state within the Experiencer. This frame has a strong connection to Experiencer_obj.",
      "The goal of the Agent is to consciously provoke an internal mental or emotional state in the Experiencer. Experiencer_obj is closely tied to this frame.",
      "Purposefully, the Agent seeks to generate an internal mental or emotional condition within the Experiencer. The association with Experiencer_obj is significant in this frame.",
      "With intention, the Agent endeavors to bring about an internal mental or emotional state in the Experiencer. The connection between this frame and Experiencer_obj should not be overlooked."
    ]
  },
  "Commitment": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Speaker makes a commitment to an Addressee to carry out some future action.  This may be an action desirable (as with promise) or not desirable (as with threaten) to the Addressee. Some of the words in this frame allow an Addressee to be expressed.\"",
    "Response": [
      "The Speaker promises the Addressee that they will perform a future action, which can either be desirable or undesirable for the Addressee.",
      "An agreement is made by the Speaker with the Addressee to fulfill a forthcoming task, whether it is something favorable (like a promise) or unfavorable (like a threat) for the Addressee. Certain words within this structure provide the opportunity to express the Addressee.",
      "In this context, the Speaker commits to carrying out a future action upon the agreement with the Addressee, regardless of whether it is beneficial (such as a promise) or detrimental (such as a threat) to the Addressee. Some words within this framework enable expression of the Addressee.",
      "The commitment made by the Speaker to the Addressee involves the performance of a future action, which may be either favorable (like a promise) or unfavorable (like a threat) to the Addressee. The presence of certain words within this frame allows for the identification of the Addressee.",
      "The Addressee is assured by the Speaker that a specific action will be carried out in the future, and this action can be either something positive (like a promise) or negative (like a threat) for the Addressee. The inclusion of certain words within this structure permits the representation of the Addressee."
    ]
  },
  "Commerce_pay": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"This frame involves Buyers paying Money for Goods.  In this frame the Money is the direct object, and is mapped to the theme of the transfer.\"",
    "Response": [
      "The transfer frame consists of Buyers exchanging Money for Goods, where Money serves as the direct object and is linked to the theme of the transfer.",
      "In this particular frame, Buyers are the ones who pay Money in exchange for Goods, with Money being the direct object and aligned with the transfer's theme.",
      "Buyers engage in a frame where Money is paid for Goods, illustrating Money as the direct object and associated with the transfer's theme.",
      "Money being the direct object and related to the transfer's theme, Buyers carry out a frame where they pay Money for Goods.",
      "During this frame, the direct object involves Buyers exchanging Money for Goods, while Money is mapped as the theme of the transfer."
    ]
  },
  "Filling": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"These are words relating to filling containers and covering areas with some thing, things or substance, the Theme. The area or container can appear as the direct object with all these verbs, and is designated Goal because it is the goal of motion of the Theme. Corresponding to its nuclear argument status, it is also affected in some crucial way, unlike goals in other frames.\"",
    "Response": [
      "The Theme is comprised of words that pertain to the action of filling containers and covering areas with a substance, thing, or things. The Goal, representing the area or container, can be the direct object for all these verbs and is considered the target of the Theme's movement. As it holds the position of the nuclear argument, the Goal is also impacted in a significant manner, distinguishing it from goals in alternative frames.",
      "Involving filling containers and covering areas with substance, thing, or things, the specified words are linked to the Theme. Within this context, the direct object can represent either the area or container and serves as the Goal, since it signifies the objective of the Theme's motion. As the nuclear argument, the Goal is also affected in a distinctive manner, diverging from other goal scenarios.",
      "The Passage focuses on words associated with the act of filling containers and covering areas with a substance, thing, or things referred to as the Theme. The area or container can serve as the direct object in all these verbs and assumes the role of the Goal, representing the intended destination of the Theme's movement. Due to its nuclear argument status, the Goal is also subject to some form of alteration, setting it apart from goals found in different frames.",
      "Regarding the concept of filling containers and covering areas with substance, thing, or things, this Passage examines the words attributed to this Theme. It is important to highlight that the direct object can be the area or container when used with any of these verbs, hence becoming the designated Goal, representing the desired endpoint of the Theme's motion. As the nuclear argument, the Goal is subject to some form of impact unlike goals observed in alternate frames.",
      "This Passage delves into words associated with the act of filling containers and covering areas with substance, thing, or things, which constitute the Theme. In relation to these verbs, the area or container can function as the direct object and takes on the role of the Goal, signifying the objective of the Theme's motion. As the nuclear argument, the Goal is also affected in a significant manner, distinguishing it from goals found in other frames."
    ]
  },
  "Becoming": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Entity ends up with some Final_quality--a new fact about the Entity. Alternatively, based on a cluster of changes of characteristics, the Entitynewly meets the conditions for being a member of a Final_category.\"",
    "Response": [
      "The Entity acquires a Final_quality, which is a new fact about it, as a result.",
      "Based on a series of characteristic changes, the Entity now satisfies the requirements to belong to a Final_category.",
      "A new fact about the Entity, termed Final_quality, is attained.",
      "The Entity fulfills the criteria to join a Final_category due to a cluster of characteristic alterations.",
      "The Entity obtains an additional fact known as Final_quality, or in another scenario, it becomes eligible to be included in a Final_category based on a group of characteristic modifications."
    ]
  },
  "Achieve": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"After a period in which the Agent has been working on a Goal, the Agent manages to attain it.  The Goal may be a desired state, or be conceptualized as an event.\"",
    "Response": [
      "Upon completion of a task, the Agent successfully achieves their Goal, whether it is a specific state or an event.",
      "Once the Agent has dedicated a sufficient amount of time to working on a Goal, they are able to successfully accomplish it, whether it is a desired state or an event.",
      "The Agent's diligent efforts on a Goal lead them to eventually attain it, whether it is a desired state or an event.",
      "Following a period of dedication, the Agent triumphantly reaches their Goal, which can either be a desired state or an event.",
      "After investing time and effort into pursuing a Goal, the Agent ultimately manages to achieve it, whether it is a desired state or an event."
    ]
  },
  "Practice": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Agent enacts an Action that is intended to be performed again at one or more later Occasions.  The goal of practicing is to ensure that the action at the later Occasion(s) comes off flawlessly.\"",
    "Response": [
      "The intention of an Agent is to perform an Action repeatedly on future Occasions in order to ensure flawless execution.",
      "The purpose of an Agent is to reenact an Action on later Occasions, aiming for flawless execution.",
      "An Agent performs an Action with the intention of replicating it flawlessly on future Occasions.",
      "Practicing involves an Agent performing an Action multiple times to guarantee flawless execution on subsequent Occasions.",
      "The aim of practicing is for an Agent to flawlessly perform an Action on one or more future Occasions."
    ]
  },
  "Cause_change_of_strength": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Agent causes a Patient to be more strong, often resulting in something that is more secure and safe.\"",
    "Response": [
      "The act of an Agent leads to the strengthening of a Patient, frequently leading to the attainment of enhanced security and safety.",
      "By causing an individual to become stronger, an Agent often brings about a situation that is characterized by increased security and safety.",
      "The action of an Agent results in the enhancement of a Patient's strength, which in turn brings about a state of being more secure and safe.",
      "Through their influence, Agents make Patients stronger, leading to an outcome that is characterized by heightened security and safety.",
      "The act of enabling a Patient's strength by an Agent often leads to a more secure and safe outcome."
    ]
  },
  "Supply": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Supplier gives a Theme to a Recipient to fulfill a need or purpose (Imposed_purpose) of the Recipient.\"",
    "Response": [
      "The Supplier gives a Theme to the Recipient in order to meet the Recipient's imposed purpose or need.",
      "In order to fulfill a recipient's imposed purpose or need, the Supplier provides them with a Theme.",
      "The Recipient is given a Theme by the Supplier in order to satisfy their imposed purpose or need.",
      "To satisfy the Recipient's imposed purpose or need, the Supplier assigns them a Theme.",
      "The Supplier provides the Recipient with a Theme to meet their imposed purpose or need."
    ]
  },
  "Cause_to_amalgamate": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"These words refer to an Agent joining Parts to form a Whole.  (The Parts may also be encoded as Part_1 and Part_2.)  There is a symmetrical relationship between the components that undergo the process, and afterwards the Parts are consumed and are no longer distinct entities that are easily discernable or separable in the Whole.\"",
    "Response": [
      "An Agent comes together with Parts to create a Whole, as indicated by these terms. (The Parts can also be referred to as Part_1 and Part_2.) The process involves a symmetrical relationship between the components, and once completed, the Parts cease to exist as separate entities and become indistinguishable within the Whole.",
      "The formation of a Whole is achieved by an Agent joining Parts, which is the crux of these words. (It is worth noting that the Parts can also be denoted as Part_1 and Part_2.) A symmetrical connection between the undergoing components exists during the process, and once completed, the Parts no longer retain their individual identities within the Whole.",
      "When Parts are combined by an Agent, they merge to create a Whole. This concept is encapsulated by the words used. (Alternatively, the Parts may be labeled as Part_1 and Part_2.) During the process, a symmetrical relationship exists between the components, but upon completion, the Parts lose their distinctiveness and cannot be easily separated within the Whole.",
      "The act of forming a Whole involves an Agent connecting Parts, which is the essence of the terms mentioned. (Additionally, the Parts might be referred to as Part_1 and Part_2.) Throughout the process, there is a symmetrical connection between the undergoing components, but once completed, the Parts no longer retain their individuality and become indistinguishable within the Whole.",
      "These words signify the amalgamation of Parts into a unified Whole by an Agent. (It is important to note that the Parts can also be referred to as Part_1 and Part_2.) During the process, a symmetrical relationship exists between the components, and once finished, the Parts lose their distinction and blend seamlessly into the Whole."
    ]
  },
  "Scouring": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Searcher looks all over a Ground in order to find a Sought_entity. The Sought_entity is not presupposed to exist. The search activity is not concerned with the state of the Ground, which is the case in the Inspecting frame, but only with the finding of the Sought_entity, which is desirable.\"",
    "Response": [
      "The objective of a Searcher is to explore a Ground in order to locate a Sought_entity, without assuming its existence.",
      "The search process does not focus on the condition of the Ground, as in the Inspecting frame, but solely on locating the desirable Sought_entity.",
      "In the pursuit of finding a Sought_entity, a Searcher thoroughly scans every corner of a Ground, without any prior assumptions regarding its existence.",
      "The primary goal of a Searcher is to uncover a Sought_entity, and their search efforts are not concerned with the state of the Ground, unlike in the Inspecting frame.",
      "By exploring a Ground extensively, a Searcher aims to discover a desirable Sought_entity, even though its existence is not guaranteed."
    ]
  },
  "Violence": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"The words in this frame describe acts (or situations characterized by acts) that cause injury or harm. The acts may involve an Aggressor or Cause injuring a Victim, or Aggressors causing each other harm.\"",
    "Response": [
      "Acts that cause injury or harm are depicted by the words in this frame, which also encompass situations characterized by such acts.",
      "In this frame, the words pertain to acts or circumstances that result in injury or harm, whether it is caused by an Aggressor or Cause towards a Victim, or if multiple Aggressors cause harm to one another.",
      "The words within this frame specifically describe acts that have the potential to cause injury or harm, as well as situations characterized by such actions. These acts can involve either an Aggressor or Cause causing harm to a Victim, or situations where multiple Aggressors harm each other.",
      "Within this frame, the words exclusively refer to acts or situations that lead to injury or harm. Such acts may involve either an Aggressor or Cause inflicting harm upon a Victim, or instances where multiple Aggressors harm one another.",
      "This frame contains words that describe acts or situations marked by acts that bring about injury or harm. These acts can either involve an Aggressor or Cause causing harm to a Victim, or instances where multiple Aggressors cause harm to each other."
    ]
  },
  "Reforming_a_system": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"Because it no longer functions adequately under the given circumstances, an Agent (or non-Agentive Cause) undertakes steps to change the structural makeup of a complex Entity with interdependent parts, for instance an institution or a system of laws. The Degree of change is typically gradual and partial rather than revolutionary and total. Note that with some LUs the Entity can be unexpressed when it is identical to the Agent.\"",
    "Response": [
      "An Agent (or non-Agentive Cause) takes action to modify the structural composition of a complex Entity with interconnected components, such as an institution or a system of laws, due to its inadequate functioning under the current circumstances. The nature of this change is usually gradual and partial, rather than sudden and complete. Sometimes, the Entity may not be explicitly mentioned if it is the same as the Agent.",
      "When facing inadequate functionality within a specific context, an Agent (or non-Agentive Cause) initiates a process of altering the structural makeup of a complex Entity, such as an institution or a system of laws. This modification is typically characterized by gradual and partial changes, rather than immediate and overall transformations. It is important to note that in certain cases, if the Entity is identical to the Agent, it may not be explicitly referenced.",
      "Under specific conditions where functionality becomes insufficient, an Agent (or non-Agentive Cause) takes necessary measures to modify the structure of a complex Entity containing interdependent parts, such as an institution or a system of laws. This process of modification is commonly characterized by gradual and partial changes, as opposed to radical and comprehensive ones. It should be noted that in certain instances, if the Agent and the Entity are the same, the latter may be left unacknowledged.",
      "An Agent (or non-Agentive Cause) undertakes steps to alter the composition of a complex Entity with interconnected parts, such as an institution or a system of laws, when it is no longer adequately functional given the circumstances. The process of change tends to be gradual and partial rather than revolutionary and total. It is worthwhile to mention that in some cases, the Entity may not be explicitly mentioned if it is the same as the Agent.",
      "Due to inadequate functionality within a specific set of circumstances, an Agent (or non-Agentive Cause) takes action to modify the structural makeup of a complex Entity with interdependent components, for instance an institution or a system of laws. The extent of these changes usually occurs gradually and partially, rather than abruptly and entirely. It is important to consider that in certain cases, if the Entity is the same as the Agent, it may not be specifically stated."
    ]
  },
  "Come_together": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"In this frame a group of Individuals meet to form a Configuration. The Individuals or the Configuration may be expressed as the external argument of the predicates in this frame. In this frame, it is ambiguous whether or not the Individuals intentionally come together.  In an alternative construal, a grammatically more prominent Party_1 congregates with a Party_2, expressed as an oblique phrase. If this asymmetric construal is chosen, Purpose relates only to Party_1.\"",
    "Response": [
      "A Configuration is formed when a group of Individuals meet in this frame, and it is uncertain if their gathering is intentional or not.",
      "The formation of a Configuration occurs when a group of Individuals meet within this frame, leaving it unclear if they come together intentionally or not.",
      "Within this frame, a group of Individuals gather to create a Configuration, and it is not clear whether their intention is to come together or not.",
      "When a group of Individuals meet in this frame, they form a Configuration, but it remains ambiguous whether they do so intentionally or not.",
      "In this frame, a Configuration is shaped when a group of Individuals come together, and it is unclear whether their meeting is intentional or not."
    ]
  },
  "Wearing": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"The words in this frame refer to what Clothing the Wearer (or a specific Body_part of the Wearer) has on.\"",
    "Response": [
      "The clothing worn by the wearer (or a particular body part of the wearer) is referred to by the words in this frame.",
      "Within this frame, the words pertain to the clothing adorning the wearer (or a specific body part of the wearer).",
      "The words contained in this framework describe the garments donned by the wearer (or a specific body part of the wearer).",
      "In this frame, the words are used to indicate the type of clothing that the wearer (or a specific body part of the wearer) has on.",
      "The words within this frame serve to denote the attire worn by the wearer (or a particular body part of the wearer)."
    ]
  },
  "Cause_to_make_progress": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Agent works on a Project so that it reaches a more advanced and desirable state.\"",
    "Response": [
      "The purpose of an Agent is to enhance and improve a Project, bringing it to a more advanced and desirable state.",
      "Working on a Project, an Agent strives to achieve a state that is both advanced and desirable.",
      "An Agent's goal is to elevate a Project, making it more advanced and desirable.",
      "The objective of an Agent is to transform a Project into a state that is more advanced and desirable.",
      "By working on a Project, an Agent aims to progress it to a state that is advanced and desirable."
    ]
  },
  "Legality": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"Words in this frame describe the status of an Action with respect to a Code of laws or rules. An Object may also be in violation or compliance of the Code by virtue of its existence, location or possession.\"",
    "Response": [
      "The words in this frame depict the state of an Action in relation to a system of laws or regulations.",
      "The status of an Action can be described by the words in this frame, concerning a set of laws or rules.",
      "The Code of laws or rules determines the status of an Action, as represented by the words in this frame.",
      "In this frame, words are used to describe the compliance or violation of an Object regarding the Code of laws or rules.",
      "The existence, location, or possession of an Object can lead to its violation or compliance with the Code, as indicated by the words in this frame."
    ]
  },
  "Employment": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Employee has a Position doing work in a particular Field, or doing work on a particular Task, for which an Employer gives Compensation to the Employee.\"",
    "Response": [
      "Compensation is given by an Employer to an Employee who has a Position in a particular Field or works on a particular Task.",
      "The Employer provides Compensation to an Employee who holds a Position in a specific Field or who performs a Task.",
      "In exchange for Compensation, an Employee is assigned to a Position in a particular Field or given a Task by an Employer.",
      "Compensation is granted by an Employer to an Employee who works in a specific Field or performs a particular Task.",
      "An Employee receives Compensation from an Employer for holding a Position in a specific Field or for completing a particular Task."
    ]
  },
  "Rite": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"This frame concerns rituals performed in line with religious beliefs or tradition.\"",
    "Response": [
      "Rituals performed in accordance with religious beliefs or tradition are the subject of this frame.",
      "This frame revolves around the rituals conducted in line with religious beliefs or tradition.",
      "The focus of this frame is on rituals carried out in accordance with religious beliefs or tradition.",
      "The subject matter of this frame pertains to rituals that are performed in line with religious beliefs or tradition.",
      "Within this frame, the topic of discussion is rituals that are conducted based on religious beliefs or tradition."
    ]
  },
  "Publishing": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Publisher makes a Work of an Author (or authors) available to some public Audience for general enjoyment, examination, and reference. The Medium of a Work can vary; examples include books, TV programs, movies, and radio shows. Publication normally involves a number of other events, such as editing and advertising of the Work, and mass production and sales of a represenation of the Work; thus in the most elaborated version of publication, there are a number of other potential roles, such as editor, publicist/advertizer, distributor, printer, etc., but none of these show up as separate, syntactically distinguished roles for the LUs in this frame.\"",
    "Response": [
      "The purpose of a Publisher is to offer a Work of an Author (or authors) to the public Audience for general enjoyment, examination, and reference. The Medium of a Work may vary, including books, TV programs, movies, and radio shows. During the process of Publication, various events take place, such as editing and advertising the Work, as well as mass production and sales of a representation of the Work. The most extensive version of publication involves several potential roles, such as editor, publicist/advertizer, distributor, printer, among others. However, none of these roles are linguistically distinct in this frame.",
      "To provide general enjoyment, examination, and reference, a Publisher presents a Work of an Author (or authors) to the public Audience. The Medium of a Work may differ, such as books, TV programs, movies, and radio shows. The process of Publication entails various other activities, including editing, advertising, and the production and sales of a representation of the Work. In the most comprehensive form of publication, additional roles such as editor, publicist/advertizer, distributor, and printer may exist, although they are not explicitly differentiated linguistically in this context.",
      "The main goal of a Publisher is to make a Work of an Author (or authors) accessible to the general public for their enjoyment, examination, and reference. The Medium through which the Work is presented can vary significantly, ranging from books, TV programs, movies, to radio shows. The process of Publication encompasses several other events, such as editing and advertising the Work, as well as the mass production and sales of a representation of the Work. In the most comprehensive version of publication, various other potential roles, including editor, publicist/advertizer, distributor, and printer, may be involved. However, these roles do not possess distinct linguistic identities within this frame.",
      "An Author's Work is made available to the public Audience for general enjoyment, examination, and reference by a Publisher. The Medium utilized for presenting the Work can be diverse, encompassing books, TV programs, movies, and radio shows. Publication generally involves several accompanying events, such as editing and advertising the Work, as well as the mass production and sales of a representation of the Work. Consequently, in a highly detailed publication process, various other roles, such as editor, publicist/advertizer, distributor, printer, emerge, although these roles are not individually distinguished linguistically in this particular context.",
      "The primary aim of a Publisher is to enable the general public to access and appreciate a Work created by an Author (or authors). The Medium utilized to present the Work can vary, including options such as books, TV programs, movies, and radio shows. Publication entails a range of additional activities, such as editing and advertising the Work, as well as the mass production and sales of a representation of the Work. In the most comprehensive version of publication, several other potential roles may come into play, such as editor, publicist/advertizer, distributor, printer, among others. However, these roles do not hold distinct syntactical identities within this particular frame."
    ]
  },
  "Adducing": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Speaker mentions a Specified_entity filling a Role, thereby providing information which supports a point of the Speaker.\"",
    "Response": [
      "The Speaker provides information supporting their point by mentioning a Specified_entity filling a Role.",
      "By mentioning a Specified_entity filling a Role, the Speaker supports their point with additional information.",
      "Supporting the Speaker's point, information is given about a Specified_entity filling a Role.",
      "The Speaker gives information that supports their point by referring to a Specified_entity in a specific Role.",
      "Information is provided by the Speaker, who mentions a Specified_entity in a specific Role, supporting their point."
    ]
  },
  "Exchange": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"Two parties, the Exchangers, each give and receive from the other Themes. The parties are also construable separately as Exchanger_1 and Exchanger_2,  in which case the Themes may be construed separately, too, as Theme_1 and Theme_2.\"",
    "Response": [
      "Both parties, known as the Exchangers, engage in a mutual exchange of Themes with each other. The parties can be identified individually as Exchanger_1 and Exchanger_2, in which case the Themes can also be viewed separately as Theme_1 and Theme_2.",
      "The Exchangers, two distinct parties, participate in the reciprocal exchange of Themes. If considered independently, the Exchangers can be labeled as Exchanger_1 and Exchanger_2, allowing for separate interpretations of Theme_1 and Theme_2.",
      "In this scenario, the Exchangers form two parties who engage in the exchange of Themes with one another. Additionally, the Exchangers can also be identified as Exchanger_1 and Exchanger_2, indicating that Theme_1 and Theme_2 can be examined individually.",
      "The participants, referred to as the Exchangers, engage in the exchange of Themes between one another. Furthermore, the two parties can be distinguished as Exchanger_1 and Exchanger_2, giving rise to separate interpretations of Theme_1 and Theme_2.",
      "Two parties, known as the Exchangers, partake in a reciprocal exchange of Themes. Furthermore, these parties can be individually identified as Exchanger_1 and Exchanger_2, which allows for distinct interpretations of Theme_1 and Theme_2 as well."
    ]
  },
  "Exchange_currency": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Money_owner exchanges Sum_1 in the  Source_currency for Sum_2 in the Target_currency at some Exchange_service.\"",
    "Response": [
      "At an Exchange_service, a Money_owner swaps Sum_1 in the Source_currency with Sum_2 in the Target_currency.",
      "Sum_2 in the Target_currency is acquired by a Money_owner by exchanging Sum_1 in the Source_currency at an Exchange_service.",
      "The Source_currency is exchanged for the Target_currency by a Money_owner at an Exchange_service, resulting in Sum_2 being obtained.",
      "An Exchange_service facilitates the exchange of Sum_1 in the Source_currency for Sum_2 in the Target_currency by a Money_owner.",
      "Sum_2 in the Target_currency is obtained by a Money_owner through an exchange of Sum_1 in the Source_currency at an Exchange_service."
    ]
  },
  "Ratification": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Ratifier responds to a Proposal constructed by another party to make it binding over the Ratifier's jurisdiction or constituency.\"",
    "Response": [
      "The Ratifier's jurisdiction or constituency is bound by a Proposal created by another party, and the Ratifier responds to it to make it effective.",
      "When a Proposal is made by another party, the Ratifier responds in order to ensure its binding nature within their jurisdiction or constituency.",
      "The Ratifier is responsible for responding to a Proposal formulated by another party, thereby enforcing it within their jurisdiction or constituency.",
      "To make a Proposal legally enforceable within their jurisdiction or constituency, the Ratifier responds to it, as constructed by another party.",
      "By responding to a Proposal put forth by another party, the Ratifier takes action to make it binding within their jurisdiction or constituency."
    ]
  },
  "Sign_agreement": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Signatory signs an Agreement document, thereby taking on a commitment encoded in the Agreement.\"",
    "Response": [
      "By signing an Agreement document, a Signatory assumes a commitment that is outlined in the Agreement.",
      "When a Signatory signs an Agreement document, they are acknowledging a commitment that is specified in the Agreement.",
      "An Agreement document is signed by a Signatory, who then becomes bound by the commitment stated in the Agreement.",
      "By signing a document called the Agreement, a Signatory accepts a commitment that is laid out within the Agreement itself.",
      "The act of signing an Agreement document signifies a Signatory's willingness to fulfill the commitment prescribed by the Agreement."
    ]
  },
  "Commerce_buy": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"These are words describing a basic commercial transaction involving a Buyer and a Seller exchanging Money and Goods, taking the perspective of the Buyer.  The words vary individually in the patterns of frame element realization they allow.  For example, the typical pattern for the verb BUY:\"",
    "Response": [
      "Taking the perspective of the Buyer, these are words that describe a simple commercial transaction where Money and Goods are exchanged between a Buyer and a Seller.",
      "In the context of a basic commercial transaction between a Buyer and a Seller, the words provided describe the exchange of Money and Goods from the perspective of the Buyer.",
      "When discussing a commercial transaction from the viewpoint of the Buyer, the words presented depict the exchange of Money and Goods between the Buyer and the Seller.",
      "Describing a basic commercial transaction involving a Buyer and a Seller, the words focus on the perspective of the Buyer and the exchange of Money and Goods.",
      "Looking at a basic commercial transaction involving a Buyer and a Seller, these words illustrate the Buyer's viewpoint and the process of exchanging Money and Goods."
    ]
  },
  "Imposing_obligation": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Duty is imposed on a Responsible_party according to a Principle which regulates how the Responsible_party should respond to a Situation.  The Situation may be expressed metonymically by reference to an Obligator, whose action invokes the Principle.  It is only rarely the case that the Principle and the Situation/Obligator are both expressed overtly.\"",
    "Response": [
      "According to a regulating Principle, a Responsible_party is obligated to fulfill a Duty in response to a Situation.",
      "The Principle determines how a Responsible_party should react to a Situation, and this results in a Duty being imposed on them.",
      "When an Obligator takes action, it symbolizes the Situation, which in turn invokes the Principle.",
      "In most cases, both the Principle and the Situation/Obligator are not explicitly stated.",
      "The Principle governs the response of a Responsible_party to a Situation, thus leading to the imposition of a Duty."
    ]
  },
  "Rewards_and_punishments": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Agent (the punisher or rewarder) performs a Response_action on an Evaluee for a Reason, the Evaluee's actions or beliefs.   Means and Instrument may also be indicated.\"",
    "Response": [
      "The Evaluee's actions or beliefs are subject to a Response_action performed by an Agent, who may be either a punisher or rewarder, for a Reason. Additional indications of Means and Instrument may also be provided.",
      "A Response_action is carried out on an Evaluee by an Agent, who can either be a punisher or rewarder, due to a Reason relating to the Evaluee's actions or beliefs. Possibilities of Means and Instrument may also be mentioned.",
      "When it comes to an Evaluee's actions or beliefs, an Agent (either a punisher or rewarder) performs a Response_action for a Reason. This can be accompanied by indications of Means and Instrument.",
      "The actions or beliefs of an Evaluee may result in an Agent (the punisher or rewarder) enacting a Response_action for a specific Reason. Means and Instrument may also be identified in this context.",
      "In relation to an Evaluee's actions or beliefs, the Agent (who can act as a punisher or rewarder) carries out a Response_action driven by a Reason, with the possibility of mentioning Means and Instrument."
    ]
  },
  "Institutionalization": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Patient is committed to the care of a medical Facility by a proper Authority. Regardless of whether the Patient agrees or does not agree with their placement in the Facility, the Authority judges that it is in the best interest of the Patient or his environment that the Patient receive treatment in the Facility.\"",
    "Response": [
      "When a Patient is placed in a medical Facility, it is done so by a proper Authority, regardless of the Patient's agreement or disagreement with the decision. The Authority believes that it is in the best interest of the Patient or their surroundings to receive treatment in the Facility.",
      "The care of a Patient is entrusted to a medical Facility by an appropriate Authority, regardless of the Patient's consent or lack thereof. The Authority deems it beneficial for the Patient's well-being or their surroundings to undergo treatment in the Facility.",
      "A medical Facility becomes responsible for a Patient's care upon the decision of a proper Authority, irrespective of whether the Patient consents or disagrees with their placement. The Authority determines that it is for the greater good of the Patient or their environment to receive treatment in the Facility.",
      "In the event that a Patient is placed in a medical Facility, it is done so under the supervision of a competent Authority, regardless of the Patient's agreement or disagreement. The Authority makes the judgment that it is in the best interest of the Patient or their surroundings to undergo treatment in the Facility.",
      "A Patient is placed under the care of a medical Facility by a proper Authority, regardless of whether the Patient consents or objects to the decision. The Authority concludes that it is in the Patient's or their environment's best interest for the Patient to receive treatment in the Facility."
    ]
  },
  "Testing": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Tester uses a concrete or conceptual Product in order to determine either whether it works or to find out how well or in which manner it works. The Tester may have particular Unwanted_characteristics in mind that they are specifically looking for. The operational test may also be carried out under a particular set of Circumstances that are typically relevant to the functioning of the Product.\"",
    "Response": [
      "To determine if it functions properly or to assess its performance, a Tester utilizes a specific Product, either tangible or abstract.",
      "The primary objective of a Tester is to determine the effectiveness of a Product by examining its functionality and identifying any desired traits.",
      "Testing a Product involves scrutinizing its operational capabilities and assessing its performance in various specific scenarios.",
      "The Tester may have specific undesirable attributes in mind that they are actively seeking or trying to identify during the testing process.",
      "Conducting an operational test on a Product typically involves replicating relevant circumstances that are crucial for its proper functioning."
    ]
  },
  "Examination": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"This frame deals with testing or examination of someone's Knowledge or skill in a particular area.  An Examiner conducts an Examination to an Examinee to determine the Examinee's Knowledge and/or determine their Qualification for some privilege; this proceeds either by the Examinee demonstrating a skill or by writing responses to questions.\"",
    "Response": [
      "Testing or examining someone's knowledge or skill in a specific field is the focus of this framework. A professional examiner assesses the examinee's abilities and qualifications to assess their level of expertise or eligibility for a certain privilege. This assessment can be carried out by observing the examinee's performance of a skill or through written responses to questions.",
      "The main purpose of this framework is to evaluate an individual's knowledge or proficiency in a particular subject. An examiner administers an examination to an examinee in order to gauge their competency and determine if they meet the requirements for certain privileges. This evaluation can be done through practical demonstrations or written responses.",
      "A framework has been established to specifically assess or test an individual's knowledge or skills in a specific area. A qualified examiner is responsible for conducting an examination for an examinee to ascertain their level of expertise and suitability for specific privileges. This evaluation can be conducted through the examinee showcasing their skills or providing written answers to questions.",
      "The focus of this framework is on examining or testing an individual's knowledge or skill set in a particular field. An examiner carries out an examination to determine the examinee's level of expertise and assess their eligibility for certain privileges. This process can be accomplished through the examinee's demonstration of a skill or their written responses to questions.",
      "This framework concentrates on the examination and evaluation of an individual's knowledge or abilities within a specific domain. An examiner is responsible for conducting a thorough assessment of the examinee to determine their proficiency and evaluate whether they meet the necessary qualifications for certain privileges. The evaluation can be conducted by observing the examinee's practical application of a skill or through their written responses to a series of questions."
    ]
  },
  "Ingestion": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Ingestor consumes food or drink (Ingestibles), which entails putting the Ingestibles in the mouth for delivery to the digestive system.  This may include the use of an Instrument.  Sentences that describe the provision of food to others are NOT included in this frame.\"",
    "Response": [
      "The act of consuming food or drink, known as ingestion, involves placing ingestibles in the mouth and delivering them to the digestive system, often with the aid of an instrument. Sentences pertaining to providing food to others are excluded in this context.",
      "Ingestion refers to the process of consuming food or drink, where ingestibles are placed in the mouth and subsequently transported to the digestive system. An instrument may be utilized during this procedure, however, sentences regarding feeding others are not considered here.",
      "In order to nourish oneself, an ingestor partakes in the consumption of food or drink, where ingestibles are introduced into the mouth and then delivered to the digestive system. It should be noted that the provision of food to others is not discussed within this framework.",
      "The act of ingestion involves the intake of food or drink by an ingestor, who places ingestibles in their mouth for digestion. This action may involve the use of an instrument, but the passage does not cover sentences related to feeding others.",
      "Ingestion encompasses the process undertaken by an ingestor to consume food or drink. This entails placing ingestibles in the mouth and delivering them to the digestive system, potentially utilizing an instrument. However, it is important to note that sentences regarding providing food to others are not incorporated in this context."
    ]
  },
  "Labeling": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Speaker uses as a Label to refer to an Entity. The Label is not a conventional name for the Entity but a description categorizing the Entity and thereby  expressing a judgment.\"",
    "Response": [
      "The Speaker utilizes a Label for the purpose of referencing an Entity, which is not the Entity's customary name but rather a descriptive categorization that conveys a judgment.",
      "When referring to an Entity, the Speaker employs a Label that does not constitute a regular name but a descriptive classification reflecting a judgment.",
      "The Speaker designates an Entity using a Label, which serves as a descriptive categorization expressing a judgment, instead of the Entity's customary name.",
      "In order to refer to an Entity, the Speaker opts for a Label rather than the Entity's conventional name, employing a descriptive categorization that conveys a judgment.",
      "By using a Label, the Speaker makes reference to an Entity, utilizing a descriptive categorization that expresses a judgment, instead of the Entity's customary name."
    ]
  },
  "Kidnapping": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"The words in this frame describe situations in which a Perpetrator carries off and holds the Victim against his or her will by force.\"",
    "Response": [
      "By using force, a Perpetrator kidnaps and forcibly detains the Victim against their will, as mentioned in the words within this frame.",
      "The situations depicted within this frame involve a Perpetrator who forcefully takes the Victim away and keeps them captive against their wishes.",
      "In the provided frame, various scenarios are described wherein a Perpetrator utilizes force to abduct and unlawfully restrain the Victim against their will.",
      "The descriptions within this frame pertain to instances where a Perpetrator forcefully takes hold of the Victim and keeps them confined against their consent.",
      "Instances in which a Perpetrator uses physical force to abduct and hold the Victim against their will are illustrated by the words contained within this frame."
    ]
  },
  "Submitting_documents": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Submittor gives Documents to an Authority so that they can be processed as part of an application, evaluation or other official or bureaucratic process.\"",
    "Response": [
      "An Authority receives Documents from a Submittor in order to include them in an application, evaluation, or any other official or bureaucratic process.",
      "Documents are provided by a Submittor to an Authority for the purpose of being processed in an application, evaluation, or any other official or bureaucratic process.",
      "As part of an application, evaluation, or any other official or bureaucratic process, Documents are handed over by a Submittor to an Authority for processing.",
      "An Authority is given Documents by a Submittor with the intention of processing them as part of an application, evaluation, or any other official or bureaucratic process.",
      "In order for them to be processed as part of an application, evaluation, or any other official or bureaucratic process, Documents are given by a Submittor to an Authority."
    ]
  },
  "Prison": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"This Frame deals with Penal_institutions. They are run by an Operator and may be intended to hold certain kinds of Inmates.  Penal_institutions may have a special Name and their Location may also be indicated.\"",
    "Response": [
      "Penal institutions, which may have a special name and are run by an operator, deal with holding specific kinds of inmates and their location can be indicated.",
      "The focus of this frame is on penal institutions, which are administered by an operator and designed to accommodate certain types of inmates. These institutions might also have a particular name, and their location can be specified.",
      "When it comes to penal institutions, they are under the management of an operator and serve the purpose of detaining specific categories of inmates. Additionally, these institutions might possess a distinct name, and their location can be disclosed.",
      "Concerning penal institutions, they are operated by an individual and are primarily established to house particular kinds of prisoners. It is worth noting that these institutions might be recognized by a specific name, and their location can also be mentioned.",
      "The subject at hand revolves around penal institutions. These institutions are overseen by an operator and are intended to house particular types of inmates. Furthermore, they may be identified by a unique name, and their geographical whereabouts can also be provided."
    ]
  },
  "Justifying": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Agent has done or omitted to do an Act or is responsible for the obtaining of a State_of_affairs, which a Judge deems to constitute a violation of an obligation or a moral guideline. The Agent gives a Reason why the Act or omission or State_of_affairs was licit despite appearances.\"",
    "Response": [
      "A Judge determines that an Agent has either performed an action or failed to do so, resulting in the establishment of a particular situation that is considered to be a breach of duty or moral principle. The Agent offers an explanation for the legitimacy of the action, omission, or situation, regardless of how it may appear.",
      "In the eyes of a Judge, an Agent is held accountable for either performing or neglecting an action, leading to the creation of certain circumstances that are deemed to be a violation of an obligation or moral standard. Despite the outward appearance, the Agent provides a justification for the lawfulness of the action, omission, or circumstances.",
      "When a Judge determines that an Agent has executed a certain act or intentionally refrained from doing so, resulting in a particular state of affairs that is considered to be a breach of an obligation or moral principle, the Agent is obligated to present a rationale for the permissibility of the act, omission, or state of affairs, regardless of its appearance.",
      "An Agent is held responsible by a Judge for carrying out or neglecting to perform an action, causing the establishment of a specific situation that is deemed to infringe upon an obligation or moral standard. Despite initial impressions, the Agent clarifies the lawful reasoning behind the action, omission, or situation.",
      "According to a Judge's evaluation, an Agent has either committed an act or failed to do so, leading to the achievement of a particular state of affairs that is regarded as a violation of an obligation or moral guideline. The Agent justifies the legality of the act, omission, or state of affairs, irrespective of its apparent nature."
    ]
  },
  "Emergency": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"This frame characterizes the situation or state of affairs in which someone should or must act to prevent a Undesirable_event from occurring. Often, an Entity affected by the Undesirable_event is more salient than the event itself and is mentioned in its place.\"",
    "Response": [
      "An individual should or must take action to avoid an Undesirable_event, as depicted by this framework.",
      "The circumstances or condition requiring action to avert an Undesirable_event are portrayed in this frame.",
      "In this frame, the focus is on the situation or state of affairs that necessitates one's intervention to prevent an Undesirable_event.",
      "The Entity affected by the Undesirable_event often takes precedence over the event itself in this frame, and is mentioned instead.",
      "This frame illustrates the necessity for someone to act in order to prevent an Undesirable_event from happening, with a particular emphasis on the Entity impacted by the event."
    ]
  },
  "Terrorism": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Terrorist commits a violent or otherwise harmful Act upon a Victim in order to coerce or terrorize a government or populace. The Act may be committed in particular for political or ideological reasons, and is often directed at civilians, as opposed to government or military officials. It is most often in violation of one or many laws.\"",
    "Response": [
      "The objective of a Terrorist is to carry out a violent or harmful Act against a Victim, aiming to coerce or terrorize a government or populace. The Act is usually driven by political or ideological motives and primarily targets civilians instead of government or military officials. Typically, it involves the violation of multiple laws.",
      "To force or intimidate a government or populace, a Terrorist engages in an Act that inflicts violence or harm on a Victim. This Act is frequently motivated by political or ideological reasons and mainly targets civilians rather than government or military personnel. It commonly involves the breach of numerous laws.",
      "Coercing or terrorizing a government or populace is the main objective of a Terrorist who carries out an Act of violence or harm against a Victim. This Act is often driven by political or ideological motives and predominantly targets civilians rather than government or military officials. Frequently, it constitutes a violation of one or many laws.",
      "The main purpose of a Terrorist is to terrorize or coerce a government or populace, achieved by carrying out a violent or otherwise harmful Act against a Victim. The Act is usually motivated by political or ideological reasons and is specifically aimed at civilians, rather than government or military officials. It often involves the contravention of one or more laws.",
      "In order to manipulate or intimidate a government or populace, a Terrorist executes an Act that involves violence or harm directed at a Victim. The Act typically arises from political or ideological motivations and predominantly targets civilians, rather than government or military personnel. It frequently results in the violation of several laws."
    ]
  },
  "Vocalizations": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"This frame is concerned with the sounds produced by animate entities by means of their vocal tracts. Descriptions of sounds from artifacts meant to emulate such sounds, or to act as vocalizing animals or people, are also treated here as figurative language.\"",
    "Response": [
      "Figurative language refers to descriptions of sounds made by living beings through their vocal tracts, as well as sounds generated by objects imitating these sounds or imitating animals or individuals that use vocalization.",
      "The focus of this framework lies on the sounds that animate entities create using their vocal tracts, including any descriptions of sounds imitated by objects or artificial beings representing vocalizing animals or people, which are considered as figurative language.",
      "Sounds resulting from the vocal tracts of living beings are the main concern of this frame, alongside descriptions of sounds meant to mimic these noises or represent vocalizing animals or humans, which are treated as figurative language.",
      "In this context, the frame specifically addresses the sounds produced by animate entities through their vocal tracts, encompassing depictions of sounds replicated by artifacts intending to imitate such vocalizations or imitate the voices of animals or individuals, which are also considered to be figurative language.",
      "The vocal sounds made by living beings using their vocal tracts are the central focus of this framework, including any depictions of sounds produced by imitation artifacts or representations of vocalizing animals or people, which are regarded as figurative language in this context."
    ]
  },
  "Risk": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Agent performs some Action which is considered imprudent.  This frame is distinct from Attempt in that the danger that the Agent puts themselves in by performing the Action is profiled.  The danger is not spelled out, but generally the Action has a possibility or likelihood of causing social or physical harm to the Agent.\"",
    "Response": [
      "When an Agent engages in imprudent behavior, they are performing an Action that poses potential social or physical harm to themselves.",
      "The distinct aspect of this frame is that it profiles the danger involved when an Agent performs an imprudent Action, as opposed to simply Attempting it.",
      "Performing an Action that is considered imprudent, an Agent exposes themselves to potential social or physical harm, which is the main focus of this frame.",
      "In this frame, the danger involved in an Agent's imprudent Action is highlighted, illustrating the possibility of social or physical harm to the Agent.",
      "An imprudent Action performed by an Agent is characterized by the potential or likelihood of causing social or physical harm to themselves, which forms the basis of this frame."
    ]
  },
  "Resolve_problem": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Agent resolves an outstanding Problem by finding its solution, explanation, answer, etc.  Alternatively, some non-agentive Cause may resolve the Problem.  The Means, Degree, Time and Place may also be expressed.\"",
    "Response": [
      "The resolution of an outstanding Problem can be achieved by an Agent through the discovery of its solution, explanation, answer, etc.",
      "The Problem can also be resolved by a non-agentive Cause instead of an Agent.",
      "The resolution of the Problem can be expressed in terms of the Means, Degree, Time, and Place involved.",
      "By finding its solution, explanation, answer, etc., an Agent is capable of resolving an outstanding Problem.",
      "The Problem can alternatively be resolved by means of a non-agentive Cause."
    ]
  },
  "Revenge": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"This frame concerns the infliction of punishment in return for a wrong suffered. An Avenger performs a Punishment on a Offender as a consequence of an earlier action by the Offender, the Injury. The Avenger inflicting thePunishment need not be the same as the Injured_Party who suffered the Injury,  but the Avenger does have to share the judgment that the Offender's action was wrong. The judgment that the Offender had inflicted an Injury  is made without regard to the law.\"",
    "Response": [
      "The focus of this frame is on the application of punishment as retribution for a perceived wrongdoing. An individual known as the Avenger administers a form of punishment to an Offender in response to a previous harmful action committed by the Offender, known as the Injury. It's worth noting that the Avenger does not necessarily have to be the same person as the Injured Party, who experienced the Injury, but the Avenger must believe that the Offender's action was morally incorrect. Importantly, the determination that an Injury was caused by the Offender is made irrespective of legal considerations.",
      "In this frame, attention is given to the concept of punishment as a response to a wrong suffered. By virtue of an earlier action, known as the Injury, anOffender becomes subject to Punishment imposed by an Avenger. It is vital to note, however, that the Avenger does not necessarily have to be the Injured Party, but they must share the belief that the Offender's action constituted a wrongdoing. Furthermore, the recognition of the Offender's infliction of the Injury is done without consideration of legal matters.",
      "This frame revolves around the infliction of punishment as a form of retribution for a perceived harm endured. The Punishment is executed by an Avenger upon an Offender in response to a prior action committed by the Offender, referred to as the Injury. Despite the possibility that the Avenger differs from the Injured_Party who suffered the Injury, they must hold the view that the Offender's action was morally unacceptable. Importantly, the judgment that the Offender caused the Injury is not influenced by legal parameters.",
      "The focal point of this frame is on imposing punishment as a means of receiving restitution for a suffered injustice. An Avenger administers Punishment upon an Offender in response to a previous action carried out by the Offender, referred to as the Injury. It should be emphasized that the Avenger does not necessarily have to be the same as the Injured_Party who experienced the Injury, but they must share the belief that the Offender's action was wrongful. It is essential to acknowledge that the recognition of the Offender's infliction of the Injury does not take legal considerations into account.",
      "This frame tackles the concept of punishment as a reciprocal response to a perceived wrongdoing. An Avenger enacts Punishment upon an Offender in reaction to a prior action committed by the Offender, known as the Injury. The identity of the Avenger does not necessarily need to match that of the Injured_Party who endured the Injury; however, the Avenger must share the belief that the Offender's action was morally incorrect. Importantly, the determination of the Offender's infliction of the Injury occurs without considering legal factors."
    ]
  },
  "Limiting": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"An Agent or Cause limits a Range_of_options to having a certain Characteristic. The Characteristic may be that only certain types of the Range_of_options may be acceptable, or (in the case of a plural or mass Range_of_options) that only certain cardinalities or quanties are acceptable. Alternatively, the Degree to which the Range_of_options is limited may be mentioned.\"",
    "Response": [
      "A certain Characteristic limits a Range_of_options to be had by an Agent or Cause, where the acceptable types of Range_of_options are specified, or in the case of a plural or mass Range_of_options, only specific cardinalities or quantities are acceptable. Another possibility is to mention the Degree of limitation imposed on the Range_of_options.",
      "In order to have a certain Characteristic, an Agent or Cause narrows down the Range_of_options, which can mean that only specific types of options are acceptable or, in the case of multiple or mass options, certain cardinalities or quantities are acceptable. Alternatively, the degree of limitation on the Range_of_options may be indicated.",
      "The presence of a specific Characteristic restricts the Range_of_options available to an Agent or Cause. This might entail only accepting particular types of Range_of_options, or in the case of a plural or mass Range_of_options, only allowing certain cardinalities or quantities. Alternatively, the extent to which the Range_of_options is limited can also be mentioned.",
      "By imposing a specific Characteristic, an Agent or Cause sets boundaries on the Range_of_options. These boundaries determine whether only specific types of Range_of_options are acceptable, or in the case of plural or mass options, whether only certain cardinalities or quantities are acceptable. Another possibility is to mention the Degree of limitation applied to the Range_of_options.",
      "When a certain Characteristic is present, it acts as a constraint for the Range_of_options available to an Agent or Cause. This constraint can mean that only particular types of Range_of_options are acceptable, or in the case of plural or mass options, only certain cardinalities or quantities are acceptable. Alternatively, the Degree of limitation for the Range_of_options can also be mentioned."
    ]
  },
  "Research": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Researcher (an individual a group or institution) attempts to answer a Question by means of consulting literature,  observation, or conducting experiments in a particular Field pertinent to the Question. The Question may be underspecified in the form of a Topic.\"",
    "Response": [
      "When exploring a particular field relevant to a question, a researcher, whether an individual, group, or institution, strives to find answers by consulting literature, making observations, or conducting experiments.",
      "Through consulting literature, making observations, or conducting experiments in a specific field, a researcher (whether an individual, group, or institution) endeavors to address a question and provide answers.",
      "In an effort to address a question, a researcher (who can be an individual, group, or institution) resorts to consulting literature, making observations, or conducting experiments within a relevant field.",
      "By consulting literature, making observations, or conducting experiments within a specific field, a researcher (whether an individual, group, or institution) aims to answer a question and provide valuable insights.",
      "To answer a question, a researcher (who can be an individual, group, or institution) embraces methods like consulting literature, making observations, or conducting experiments in order to gain insights within a particular field."
    ]
  },
  "Having_or_lacking_access": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A Theme has access to a Useful_location or is blocked from it by a Barrier.\"",
    "Response": [
      "A Barrier prevents a Theme from accessing a Useful_location.",
      "If a Theme is blocked from a Useful_location, there must be a Barrier.",
      "Either a Barrier obstructs a Theme from a Useful_location or it has access to it.",
      "Access to a Useful_location is granted to a Theme unless it is blocked by a Barrier.",
      "The presence of a Barrier determines whether a Theme can access a Useful_location."
    ]
  },
  "Theft": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"These are words describing situations in which a Perpetrator takes Goods from a  Victim or a Source. The Means by which this is accomplished may also be expressed.\"",
    "Response": [
      "The situations where a Perpetrator takes Goods from a Victim or a Source can be described using these words. The expression of the Means used to accomplish this can also be included.",
      "In these situations, words are used to describe when a Perpetrator takes Goods from a Victim or a Source. It is also possible to express the Means by which this action is carried out.",
      "Words are employed to depict situations in which a Perpetrator confiscates Goods from a Victim or a Source. Furthermore, there is a possibility to articulate the Means used to achieve this.",
      "The act of taking Goods from a Victim or a Source is portrayed through these words in various situations involving a Perpetrator. Additionally, this passage allows for the expression of the Means employed in this process.",
      "These words serve the purpose of illustrating situations wherein a Perpetrator seizes Goods from a Victim or a Source. Furthermore, it is possible to convey the Means utilized to execute such actions."
    ]
  },
  "Incident": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"A State_of_affairs (a state or event) either holds or occurs, and is presented as being causally independent of other (implicit) states or events that might otherwise have been expected to be causally related to the State_of_affairs. The Time or Place may also be mentioned.\"",
    "Response": [
      "The State_of_affairs, whether it be a state or event, is considered to exist or happen independently from any other related states or events that could have been expected to be causally linked. The mention of Time or Place is also possible.",
      "The State_of_affairs, in its existence or occurrence, is portrayed as being causally disconnected from any other implicit states or events that might have been assumed to be causally associated. The time or place might also be indicated.",
      "When discussing the State_of_affairs, which can be a state or an event, it is presented as being unrelated to any other implicit states or events that would typically be expected to have a causal relationship. Additionally, the time or place might be specified.",
      "It is possible for the State_of_affairs, whether it is a state or an event, to exist or happen in a manner that is considered independent from any other unexpressed states or events that would normally be causally connected. The mention of time or place is also conceivable.",
      "The State_of_affairs, being either a state or an event, is depicted as holding or occurring without being causally dependent on any other implicit states or events that could have been presumed to have a causal connection. The mention of time or place may also occur."
    ]
  },
  "Award": {
    "Query": "Please rephrase the following passage in 5 other formats in separate lines. \nPassage: \"The existence of a State_of_affairs is sufficient reason for taking an Action . The agent who is justified in taking the suggested Action is not part of the immediate scene, however.\"",
    "Response": [
      "Taking an Action is a valid course of action whenever there is a State_of_affairs present, regardless of the agent's involvement in the immediate scene.",
      "The mere presence of a State_of_affairs provides enough justification to proceed with an Action, even if the agent is not directly involved.",
      "Whenever a State_of_affairs occurs, it is deemed necessary to take an Action, even if the agent is not physically present at the scene.",
      "Having a State_of_affairs is a satisfactory motive for carrying out an Action, even if the agent is not directly present in the immediate situation.",
      "An Action is warranted when a State_of_affairs arises, irrespective of the agent's absence from the immediate scene."
    ]
  }
}