{
    "Know": "Words in this frame have to do with a Cognizer adding some Phenomenon to their model of the world. They are similar to Coming-to-believe words, except the latter generally involve reasoning from Evidence.",
    "Warning": "A Speaker warns an Addressee by giving a Message that describes an undesirable situation that may affect the Addressee. The warning may alternatively be described as about Topic pertaining to the undesirable situation, or issued via a specific Medium.",
    "Catastrophe": "The words in this frame involve an Undesirable_event which affects the Patient negatively.  No agent need be involved.  The first calamity was a disastrous trade war with Holland.  It is sad to have to make a living by grubbing around in the dirt of a national calamity.  The result has been catastrophic.",
    "Placing": "Generally without overall (translational) motion,  an Agent places a Theme at a location, the Goal, which is profiled.  In this frame, the Theme is under the control of the Agent/Cause at the time of its arrival at the Goal.",
    "Causation": "A Cause causes an Effect.  Alternatively, an Actor, a participant of a (implicit) Cause, may stand in for the Cause.  The entity Affected by the Causation may stand in for the overall Effect situation or event.",
    "Arriving": "An object Theme moves in the direction of a Goal. The Goal may be expressed or it may be understood from context, but its is always implied by the verb itself.",
    "Commerce_money-transfer": "The subframe of the Commercial_transaction frame which involves the transfer of Money from the Buyer to the Seller (in exchange for the Goods).",
    "Sending": "A Sender plans the Path (along with Source and Goal) of a Theme and places it in circumstances such that it travels along this Path under the power of some entity other than the Sender.  This frame also has a Recipient distinct from the Goal, as both can be present:",
    "Protest": "An Arguer presents a Content, along with Support, to an Addressee.  The Content may refer elliptically to a course of action or it may refer to a proposition that the Addressee is to believe.  Some lexical units (e.g. \"prove\") indicate the speaker's belief about the Content.Jan argued that the evidence was inadmissable.Jan argued against the admissability of the evidence.Jan proved  that the evidence was inadmissable.",
    "Preventing_or_letting": "A Potential_hindrance or an Agent (via their actions) keeps an Event from taking place, or despite the possibility of prevent the Event, do not do so. Lexical units which indicate that the event is not prevented, e.g. allow.v, are marked with the semantic type \"Negative\".  Some lexical units, like avert and avoid indicate that the Potential_hindrance or Agent would have been affected if the Event occurred.",
    "Motion": "Some entity (Theme) starts out in one place (Source) and ends up in some other place (Goal), having covered some space between the two (Path). Alternatively, the Area or Directionin which the Theme moves or the Distance of the movement may be mentioned.",
    "Temporary_leave": "A Person takes leave from his or her routine Activity (such as work or school) for a Duration of time.  The Duration can be any length of time, as long as the absence is temporary.",
    "Damaging": "An Agent affects a Patient in such a way that the Patient (or some Subregion of the Patient) ends up in a non-canonical state.  Often this non-canonical state is undesirable, and some lexical units (marked with the Negative semantic type) specifically indicate that the Patient is negatively affected.  Some lexical units of this frame indicate by what means the Patient is altered (e.g., scrape.v) and in some cases give some indication of the detailed effect on the Patient (e.g., score.v, chip.v), and in other cases, both are specified (tear.v). For another set of lexical units, the action and its result are much less specified (e.g., damage.v).",
    "Destroying": "A Destroyer (a conscious entity) or Cause (an event, or an entity involved in such an event) affects the Patient negatively so that the Patient no longer exists.  An asteroid obliterated the dinosaurs.",
    "Death": "The words in this frame describe the death of a Protagonist.  A Cause of death may also be expressed obliquely.",
    "Perception_active": "This frame contains perception words whose perceivers intentionally direct their attention to some entity or phenomenon in order to have a perceptual experience.  For this reason we call the perceiver role in this frame Perceiver_agentive.",
    "Presence": "An Entity exists at a particular Location, at a particular Time, as observed by an implicit observer. A Depictive and/or Duration phrase is often found.",
    "Influence": "An Agent, Situation or Entity has an influence on a Cognizer. The influence may be general; or it may be manifested in the Cognizer's engaging in an Action as a consequence of the influence; or the Cognizer may be influenced in how they carry out a Behavior that they are engaged in already. Alternatively, a Product may be specified whose production or design was influenced by the Cognizer's experience of the  Situation or Entity.",
    "Receiving": "A Recipient comes into possession of the Theme as a result of the joint action of the Donor and the Recipient.  The Receiving frame like the Giving frame requires that the Donor first has possession of the Theme and that following the transfer, the Donorno longer has the Theme and the Recipient does.",
    "Check": "An Inspector attains a degree of certainty in the Unconfirmed_content, generally by inspecting some evidence.",
    "Hostile_encounter": "This frame consists of words that describe a hostile encounter between opposing forces (Side_1 and Side_2, collectively conceptualizable as Sides) over a disputed Issue and/or in order to reach a specific  Purpose.",
    "Killing": "A Killer or Cause causes the death of the Victim.",
    "Conquering": "This frame describes a Theme losing its autonomy and perhaps sustaining material damage as the result of a successful invasion on the behalf of a Conqueror.",
    "Releasing": "A Captor ends the captivity or inhibition of the motion of a Theme from the Location_of_confinement. The release is in accord with the plans of the Captor.",
    "Attack": "An Assailant physically attacks a Victim (which is usually but not always sentient), causing or intending to cause the Victim physical damage.   A Weapon used by the Assailant may also be mentioned, in addition to the usual Place, Time, Purpose, Explanation, etc.  Sometimes a location is used metonymically to stand for the Assailant or the Victim, and in such cases the Place FE will be annotated on a second FE layer.",
    "Earnings_and_losses": "An Earner receives Earnings by providing Goods to a Buyer; providing the Goods also generally entails a cost, which may or may not be included in the consideration.  This frame emphasizes the effect on the Earner and often generalizes across an indefinite number of transactions with various parties.  Some of the LUs (e.g. earn.v) primarily refer to the to the Earnings without reference to cost, others to the amount the Earnings differ from the cost, emphasizing either a net loss (e.g. loss.n) or net gain (e.g. net.n).",
    "Choosing": "A Cognizer decides upon the Chosen (either an item or a course of action) out of a set of  Possibilities .  The Cognizer may have an Inherent_purpose or a Larger_purpose for the Chosen.",
    "Traveling": "An Agent matches location with an Entity in order to fulfill some  Purpose.",
    "Recovering": "The action of an Agent or the occurrence of a Cause event returns an Entity to an earlier  state of vigor and strength.",
    "Using": "An Agent manipulates an Instrument in order to achieve a Purpose.",
    "Coming_to_be": "An Entity comes into existence at a particular Place and Time which may take a certain Duration_of_endstate, have a Cause, or be formed from Components.",
    "Cause_to_be_included": "An Agent or Cause makes a New_member part of  Group. The Group may be represented by an individual Existing_member if it implies the existence of a set of members.",
    "Process_start": "An Event begins at a certain Time and Place. Reason may also be indicated.  NB:  Refer to Event frame.",
    "Change_event_time": "In this frame, an Agent or Cause changes the timing of an Event. The Event will then take place at the Destination_time or with respect to a Destination_event. This can be done with by certain Means, in a certain Manner or to a certain Degree.",
    "Reporting": "In this frame an Informer informs the Authorities of the illegal or otherwise improper Behavior of the Wrongdoer.  Tony reported Michael to the police for breaking into his car.   The teacher reported the bathroom vandalism. DNI",
    "Bodily_harm": "The words in this frame describe situations in which an Agent or a Cause injures a Victim. The Body_part of the Victim which is most directly affected may also be mentioned in the place of the Victim.  In such cases, the Victim is often indicated as a genitive modifier of the Body_part, in which case the Victim FE is indicated on a second FE layer.",
    "Suspicion": "A person or group, the Authority, believes that another person, the Suspect is a participant in a criminal Incident.",
    "Statement": "This frame contains verbs and nouns that communicate the act of a Speaker to address a Message to some Addressee using language. Instead of (or in addition to) a Speaker, a Medium may also be mentioned. Likewise, a Topic may be stated instead of a Message. A number of the words can be used performatively, such as declare and insist.",
    "Claim_ownership": "A Claimant asserts his or her right to possession of a piece of Property (either real, such as land, or private).  The Claimant may be acting on the behalf of a Beneficiary.",
    "Cause_change_of_position_on_a_scale": "This frame consists of words that indicate that an Agent or a Cause affects the position of an Item on some scale (the Attribute) to change it from an initial value (Value_1) to an end value (Value_2). The direction of the change (Path) can be encoded as well as the magnitude of the change (Difference).",
    "Coming_to_believe": "A person (the Cognizer) comes to believe something (the Content), sometimes after a process of reasoning. This change in belief is usually initiated by a person or piece of Evidence. Occasionally words in this domain are accompanied by phrases expressing Topic, i.e. that which the mental Content is about.",
    "Expressing_publicly": "A Communicator publically communicates some difficult-to-express Content which they (or a social group of which they are a member) have had for some time. The Content may not have been previously communicated due to inability or social stricture.  In cases where the individuals addressed are a smaller group than the public at large, a separate Addressee may be expressed.",
    "Request": "In this frame a Speaker asks an Addressee for something, or to carry out some action.",
    "Control": "A Controlling_entity, Controlling_situation, or Controlling_variable control a Dependent_entity, Dependent_situation, or Dependent_variable. The latter, dependent, element or some aspect of it is not just influenced, but determined by the controlling element.",
    "Self_control": "An Agent actively (yet not always with success) attempts to keep themselves from participating in an Event. The Agent is usually pushed to the Event because of an internal urge.",
    "Supporting": "A Supporter assists to strengthen the Supported by lending itself in material aid (or abstract assistance in the case of metaphorical uses).",
    "Defending": "A Defender responds to an Assailant's attack on a Victim by directly, and usually violently, countering it.",
    "Building": "This frame describes assembly or construction actions, where an Agent joins Components together to form a Created_entity, which is profiled, and hence the object of the verb.",
    "Military_operation": "The Military of a Possessor (either a nation, institution, or private individual) conducts large-scale activities in a Area to accomplish military or combined military/non-military goals.",
    "Self_motion": "The Self_mover, a living being, moves under its own direction along a Path. Alternatively or in addition to Path, an Area, Direction, Source, or Goal for the movement may be mentioned.",
    "GetReady": "The Protagonist is in an initial state, before beginning to be involved in the Activity, but all pre-conditions for performance of the Activity have been satisfied.  In many cases, the Protagonist is an intentional agent, but there are other uses in which the agent is deprofiled, and the Protagonist is an entity which is essential to the Activity.",
    "Forming_relationships": "Partner_1 interacts with Partner_2 (also collectively expressible as Partners) to change their social relationship.",
    "Becoming_a_member": "A New_member becomes a member of a socially-constructed Group.",
    "Execute_plan": "An Agent acts according to a Plan, carrying it out (or taking steps to carry it out). In some cases, the Agent is a focal participant in the Plan, although a separate Focal_participant may also be mentioned. The Plan may be specified for the Duration for which it is in effect.",
    "Action": "This is an abstract frame for acts performed by sentient beings. It exists mostly for FE inheritance.",
    "Removing": "An Agent causes a Theme to move away from a location, the Source.  The Sourceis profiled by the words in this frame, just as the Goal is profiled in the Placing frame.",
    "Surrendering": "In this frame a Fugitive presents himself or herself to the Authorities to be subject to the criminal process.  The bank robber surrendered to Berkeley police.   Norte is expected to surrender to police tomorrow on tax fraud charges .",
    "Surrendering_possession": "A Surrenderer is compelled to transfer a Theme to a Recipient.",
    "Agree_or_refuse_to_act": "A Speaker either agrees to or refuses to engage in a Proposed_action, proposed by an Interlocutor.",
    "Participation": "An Event with multiple Participants takes place. It can be presented either symmetrically with Participants or asymmetrically, giving Participant_1 greater prominence over Participant_2. If the Event is engaged in intentionally, then there is typically a shared Purpose between the Participants. It is, however, possible that an expressed Purpose only applies to Participant_1.",
    "Deciding": "A Cognizer makes a Decision, which may be about an entity or a course of action.",
    "Education_teaching": "This frame contains words referring to teaching and the participants in teaching.  A Student comes to learn either about a Subject; a Skill; a Precept; or a Fact as a result of instruction by a Teacher.",
    "Emptying": "These are words relating to emptying containers and clearing areas of some substance or items. The area or container can appear as the direct object with all these verbs, and is designated  Source because it is the source of motion of the Theme. Corresponding to its nuclear argument status, it is also affected in some crucial way, unlike Source in other frames. Some words in this frame, such as empty, may also occur with Path or Goal expressions, e.g.",
    "Getting": "A Recipient starts off without the Theme in their possession, and then comes to possess it.  Although the Source from which the Theme came is logically necessary, the Recipient and its changing relationship to the Theme is profiled.",
    "Besieging": "An Assailant, a group of armed forces, surrounds the Victim, a military location and the people within it, in an attempt to cut the Victim off from the outside, with the goal of either forcing their surrender or weakening them so that an invasion would be successful. A successful siege is often followed by the Assailant taking control of (the land held by) the Victim.",
    "Creating": "A Cause leads to the formation of a Created_entity.",
    "Process_end": "A Process comes to an end.",
    "Body_movement": "This frame contains words for motions or actions an Agent performs using some part of his/her body.",
    "Expansion": "An  Agent or non-human Cause causes an Item to change its physical size.  The Size_change of an Item may be explicitly indicated or characterized in terms of Initial_size and/or Result_size.  In the default case, expansion is along all dimensions, but sometimes the Dimension of expansion is incorporated or made explicit.",
    "Telling": "A Speaker addresses an Addressee with a Message, which may be indirectly referred to as a Topic. Instead of (or in addition to) a Speaker, a Medium may also be mentioned.",
    "Change": "An Agent or Cause causes an Entity to change, either in its category membership or in terms of the value of an Attribute. In the former case, an Initial_category and a Final_category may be expressed, in the latter case an Initial_value and a Final_value can be specified.",
    "Cause_change_of_phase": "A Cause or Agent causes a Patient to undergo a change of phase.  The Result of the change may be given, along with the Initial_state and the Circumstances under which the change can occur.  Note that this frame contrasts with Cause_change_of_consistency in that this frame describes causation of a change of a Patient between different phases (i.e. solid to liquid or frozen to \"unfrozen\").   Bob melted the butter.    Sally defrosted the chicken to eat for dinner.",
    "Legal_rulings": "An Authority with the power to make decisions hands down a Finding over a question presented in a formal or informal Case.",
    "Bearing_arms": "A Protagonist has (or does not have) a Weapon.  The Degree to which the Protagonist is armed may also be described.  The Protagonist is normally a human but may be a device that has subsidiary weapons.",
    "Giving": "A Donor transfers a Theme from a Donor to a Recipient.  This frame includes only actions that are initiated by the Donor (the one that starts out owning the Theme).  Sentences (even metaphorical ones) must meet the following entailments: the  Donor first has possession of the Theme.  Following the transfer the Donor no longer has the Theme and the Recipient does. Barney gave the beer to Moe. $300 was endowed to the university to build a new performing arts building.",
    "Name_conferral": "This  frame contains words that talk about how Speakers name Entities.",
    "Arranging": "An Agent puts a complex Theme into a particular Configuration, which can be a proper order, a correct or suitable sequence, or a spatial position.",
    "Making_arrangements": "An Agent performs a series of unspecified tasks to plan for an Event to take place at a Scheduled_time and Place.",
    "Use_firearm": "An Agent causes a Firearm to discharge, usually directing the projectile from the barrel of the Firearm (the Source), along a Path, and to a Goal.",
    "Committing_crime": "A Perpetrator (generally intentionally) commits a Crime, i.e. does something not permitted by the laws of society.",
    "Assistance": "A Helper benefits a Benefited_party by enabling the culmination of a Goal that the Benefited_party has.  A Focal_entity that is involved in reaching the Goal may stand in for it.",
    "Surrounding": "A Figure surrounds a Ground.  The Ground location is presented as more likely to be a known location than the location of the Figure. Some lexical units entail more-or-less complete surrounding in two or three dimensions (e.g. surround.v), while others entail surrounding on only two sides (e.g. astride.prep, straddle.v).  Like other locative relations, the Figure may be any of a movable entity, an immovable entity, or an event.",
    "Quarreling": "A group of Arguers (also expressible as Arguer1 and Arguer2) express incompatible opinions or beliefs about an Issue.",
    "Expend_resource": "An Agent uses a Resource which is consumed and unavailable for future use.",
    "Motion_directional": "In this frame a Theme moves in a certain Direction which is often determined by gravity or other natural, physical forces. The Theme is not necessarily a self-mover.",
    "Bringing": "This frame concerns the movement of a Theme and an Agent and/or Carrier.   The Agent, a person or other sentient entity, controls the shared Path by moving the Theme during the motion. In other words, the Agent has overall motion in directing the motion of the Theme.  The Carrier may be a separate entity, or it may be the Agent's body. The Constant_location may be a subregion of the Agent's body or (a subregion of) a vehicle that the Agent uses.",
    "Communication": "A Communicator conveys a Message to an Addressee; the Topic and Medium of the communication also may be expressed.  This frame includes no specification of the method of communication (speech, writing, gesture, etc.).  This frame and the frames that inherit the general Communication frame can add elaboration to the Medium in a variety of ways (in French, on the radio program, in a letter) or to the Manner of communication (babble, rant, shout, whisper). There are also frames related to Communication that either do not inherit all of the FEs of this frame or do not inherit them in a straightforward manner (such as Conversation, in which Communicator and Addressee alternate roles, and are often expressed by a single, plural NP).",
    "Containing": "In this frame a Container holds within its physical boundaries the Contents.",
    "Manufacturing": "A Producer produces a Product from a Resource for commercial purposes.",
    "Social_event": "A Social_event occurs at which Attendees are present to conduct a social function or joint activity.  The Social_event is often a party or celebration, in which case it is possible to express someone who is being honored (the Honoree) or its function may be to celebrate an Occasion at which Attendees are present. Often, a specific Attendee, the Host, provides a venue for people to gather.",
    "Robbery": "These are words describing situations in which a Perpetrator wrongs a Victim by taking something (Goods) from them.  In some cases, the Source location from which the Goods were taken is used to metonymically refer to the Victim.  The robbery can be done in a particular Manner (for example, forcefully) and via a specific Means (for example, by threatening the Victim).",
    "Competition": "This frame is concerned with the idea that people (Participant_1, Participant_2, or Participants) participate in an organized, rule-governed activity (the Competition) in order to achieve some advantageous outcome (often the Prize).  Rank and Score are different criteria by which the degree of achievement of the advantageous outcome is judged.",
    "Writing": "An Author creates a Text, either written, such as a letter, or spoken, such as a speech,  that contains meaningful linguistic tokens, and may have a particular Addressee in mind.  The Text may include information about its topic, although the latter is not an FE in this frame.",
    "Rescuing": "An Agent saves a Patient or an Asset from a Harmful_situation.",
    "Judgment_communication": "A Communicator communicates a judgment of an Evaluee to an Addressee.  The judgment may be positive (e.g. praise) or negative (e.g. criticize), and this is indicated by the semantic types Positive and Negative attached to the lexical units.  This frame does not contain words where Evaluee and the Addressee are necessarily the same .",
    "Change_tool": "An Agent changes Tools, from the Old_tool to a New_tool.  The Tools may include vehicles, services providers, or more proto-typical implements.",
    "Hold": "The words in this frame describe the manipulation of an Entity by an Agent.  Generally, this implies that the Entity is not deeply or permanently physically affected, nor is it overall moved from one place to another.",
    "Being_in_operation": "A Device or machine is in (or out of) service. Note that being broken or functional is a separate issue from being turned on or off. This latter notion is what the present frame is concerned with.  The Time when and the Place where the Device is in use may be specified, as may be the Purpose a backgrounded human User had in turning the Device on or off.",
    "Recording": "An Agent sets down in permanent form information about the occurrence of a Phenomenon. Alternatively, the Agent records that an Entity had a particular Value for one of its Attributes.",
    "Carry_goods": "A Distributor sells, lends, or otherwise distributes a class of Goods. In the prototypical case, the Distributor is a retailer who generally keeps some type of Goods on site for the purpose of selling it to a buyer. Extensions include lending Goods (e.g., libraries, movie rental outlets), organization-internal distribution (as in a hospital), or other non-commercial distribution centers. The Goods are constrained to be a type of item (e.g., canned goods, antique dressers) rather than a particular or unique item (e.g., Smith's last self-portrait, that guitar I saw here last week). Note that a Distributor may carry some particular goods, but may not have it on hand at that exact moment.",
    "Cost": "A Payer gives up (or potentially gives up) the use of an Asset (generally money) in order to achieve an Intended_event.  This event is often more specifically described as gaining possession of some Goods or receiving a Service.  In the majority of cases, the Payer is described generically (INI), and the situation depicted answers the question of how much of an Asset would have to be given up to receive the Goods or bring about the Intended_event.",
    "Departing": "An object (the Theme) moves away from a Source. The Source may be expressed or it may be understood from context, but its existence is always implied by the departing word itself.",
    "GiveUp": "An Agent leaves behind a Theme effectively rendering it no longer within their control or of the normal security as one's property.",
    "Change_of_leadership": "This frame concerns the appointment of a New_leader or removal from office of an Old_leader.  The Selector brings about the change in leadership, for example, by electing or overthrowing a leader. Some words in the frame describe the successful removal from office of a leader (e.g. depose, oust), others simply the attempt (e.g. uprising, rebellion).",
    "Escaping": "A Self-moving Escapee departs from an Undesirable_location.",
    "Aiming": "An Agent adjusts an Instrument to enable it to interact directly with a difficult-to-access Target_location.  Usually, there is a Targeted entity at the Target_location which is mentioned in its place.",
    "Hindering": "In this frame a Hindrance makes it more difficult for a Protagonist to complete their intended Action or a Hindrance directly affects an Action where the Action can be a natural act or the actions of many individuals in a collective endeavor.  Crucially, these lexical units do not entail that the Protagonist was unable to complete the Action or that the Action did not occur. The Hindrance may indicate a lack of enablement or an obstacle on the natural progression of the Protagonist or Action",
    "Preserving": "In this frame an  Agent preserves a Patient in order to prevent it from decaying.   A Medium may be used.   Bill mummified John.  Tess pickled the beets  in vinegar.  The Smiths dried the apples.",
    "Create_artwork": "A Creator creates an artifact that is typically an iconic Representation of an actual or imagined entity or event. The Representation may also be evocative of an idea while not based on resemblance.",
    "Openness": "A Useful_location is accessible to some (possibly generic) Theme despite a potential Barrier, or is not accessible because of the Barrier.",
    "Connect": "A Figure is located in contact with a Ground.  With some words that evoke this frame, the Figure is also asserted to be fully or partially supported by the Ground (e.g. on), while in others a support relation is either denied (e.g. to, as in \"she put her hand to the wall\") or unspecified (e.g. against).  In addition, some LUs assert a direction in which to find the Figure from the Ground (e.g. atop).",
    "Reveal_secret": "A Speaker reveals Information that was previously secret to an Addressee. In some cases, the Addressee is expected to keep the Information from other parties. The Information may be damaging to the reputation of the Speaker. Instead of (or in addition to) a Speaker, a Medium may also be mentioned. Likewise, a Topic may be stated instead of Information. Some lexical units in this frame imply that the Addressee has already been confronted with the Information.",
    "Response": "An Agent performs a Response action in consequence of a Trigger event. In many cases, a non-agentive Responding_entity causes the Response after the Trigger occurs.",
    "Court_examination": "A Questioner asks a Witness (or defendant) questions in the context of a court procedure.",
    "Scrutiny": "This frame concerns a Cognizer (a person or other intelligent being) paying close attention to something, the Ground, in order to discover and note its salient characteristics.  The Cognizer may be interested in a particular characteristic or entity, the Phenomenon, that belongs to the Ground or is contained in the Ground (or to ensure that such a property of entity is not present).",
    "Lighting": "An Emitter emits a Beam of light from a Source, along a Path, and/or towards a Goal.  Essentially, this frame denotes the (semi-)fictive motion of the the Beam.",
    "Criminal_investigation": "This frame describes the process that involves the inquiry and determination by an authority, the Investigator, of the circumstances surrounding an Incident perpetrated by a Suspect.",
    "Hiding_objects": "An Agent causes a Hidden_object to become perceptually inaccessible to potential perceivers by placing it in a Hiding_place or putting in place an Obstruction that screens the object.",
    "Confronting_problem": "An Agent becomes involved in an Issue which has negative consequences for them. The Agent will normally respond to resolve the Issue.",
    "Renting": "A Lessee gains the use of Goods owned by a Lessor by payment to the Lessor.",
    "Breathing": "An Agent causes Air to move in a direction, usually specifying either in or out of the body.",
    "Patrolling": "An individual or group, the Patrol moves through and examines a Ground in order to ensure that it is in a generally Desired_state_of_affairs, particularly that it is safe and contains no dangerous Unwanted_entity. Rather than moving through the Ground, the Patrol may simply move such that all the (relevant portions of) Ground can be observed and checked.",
    "Arrest": "Authorities charge a Suspect, who is under suspicion of having committed a crime (the Charges), and take him/her into custody.The police arrested Harry on charges of manslaughter.",
    "Convincing": "A Speaker succeeds in getting an Addressee to believe or plan to execute the Content the Speaker has in mind. In most cases, the information is related to some course of action for the Addressee, and the words of this frame imply that the Addressee has formed an intention to act consistently with the Content. There is no implication that the Addressee actually acts upon the intention formed. In the case of convince and persuade, the act that the Speaker wishes the Addressee to perform can be the adoption of a belief, which may be expressed as a that-clause or as an of-PP complement.",
    "Commerce_sell": "These are words describing basic commercial transactions involving a buyer and a seller exchanging money and goods, taking the perspective of the seller.  The words vary individually in the patterns of frame element realization they allow. For example, the typical patterns for SELL: SELLER sells GOODS to BUYER for MONEY.",
    "Cure": "This frame deals with a Healer treating and curing an Affliction (the injuries, disease, or pain) of the Patient, sometimes also mentioning the use of a particular Treatment or Medication. This frame differs from Medical_intervention in that this frame deals only with cases in which the Patient is cured of the Affliction, not just treated for the Affliction.",
    "Temporary_stay": "A Guest stays for a time at a Location, which is not his or her permanent residence, for some Duration. The Location is often the permanent residence of a Host.",
    "Dispersal": "An Agent or a Cause disperses or scatters Individuals from the Source,a relatively confined space, to a the Goal_area, a broader space.",
    "Collaboration": "Partner_1 and Partner_2 or a group of Partners  work together in some Undertaking. The Partners are taken to be of equal status even when expressed disjointly.",
    "Extradition": "A Suspect in a Current_jurisdiction is forced by Authorities (of the Current_jurisdiction) to go to the Crime_jurisdiction, i.e. the jurisdiction which requested that the Suspect be handed over for trial for a crime which he or she is suspected to have committed in the Crime_jurisdiction.  The purpose or reason for the extradition may also be expressed.",
    "Change_sentiment": "An Agent intentionally seeks to bring about an internal mental or emotional state in the Experiencer.  This frame in closely related to  Experiencer_obj.",
    "Commitment": "A Speaker makes a commitment to an Addressee to carry out some future action.  This may be an action desirable (as with promise) or not desirable (as with threaten) to the Addressee. Some of the words in this frame allow an Addressee to be expressed.",
    "Commerce_pay": "This frame involves Buyers paying Money for Goods.  In this frame the Money is the direct object, and is mapped to the theme of the transfer.",
    "Filling": "These are words relating to filling containers and covering areas with some thing, things or substance, the Theme. The area or container can appear as the direct object with all these verbs, and is designated Goal because it is the goal of motion of the Theme. Corresponding to its nuclear argument status, it is also affected in some crucial way, unlike goals in other frames.",
    "Becoming": "An Entity ends up with some Final_quality--a new fact about the Entity. Alternatively, based on a cluster of changes of characteristics, the Entitynewly meets the conditions for being a member of a Final_category.",
    "Achieve": "After a period in which the Agent has been working on a Goal, the Agent manages to attain it.  The Goal may be a desired state, or be conceptualized as an event.",
    "Practice": "An Agent enacts an Action that is intended to be performed again at one or more later Occasions.  The goal of practicing is to ensure that the action at the later Occasion(s) comes off flawlessly.",
    "Cause_change_of_strength": "An Agent causes a Patient to be more strong, often resulting in something that is more secure and safe.",
    "Supply": "A Supplier gives a Theme to a Recipient to fulfill a need or purpose (Imposed_purpose) of the Recipient.",
    "Cause_to_amalgamate": "These words refer to an Agent joining Parts to form a Whole.  (The Parts may also be encoded as Part_1 and Part_2.)  There is a symmetrical relationship between the components that undergo the process, and afterwards the Parts are consumed and are no longer distinct entities that are easily discernable or separable in the Whole.",
    "Scouring": "A Searcher looks all over a Ground in order to find a Sought_entity. The Sought_entity is not presupposed to exist. The search activity is not concerned with the state of the Ground, which is the case in the Inspecting frame, but only with the finding of the Sought_entity, which is desirable.",
    "Violence": "The words in this frame describe acts (or situations characterized by acts) that cause injury or harm. The acts may involve an Aggressor or Cause injuring a Victim, or Aggressors causing each other harm.",
    "Reforming_a_system": "Because it no longer functions adequately under the given circumstances, an Agent (or non-Agentive Cause) undertakes steps to change the structural makeup of a complex Entity with interdependent parts, for instance an institution or a system of laws. The Degree of change is typically gradual and partial rather than revolutionary and total. Note that with some LUs the Entity can be unexpressed when it is identical to the Agent.",
    "Come_together": "In this frame a group of Individuals meet to form a Configuration. The Individuals or the Configuration may be expressed as the external argument of the predicates in this frame. In this frame, it is ambiguous whether or not the Individuals intentionally come together.  In an alternative construal, a grammatically more prominent Party_1 congregates with a Party_2, expressed as an oblique phrase. If this asymmetric construal is chosen, Purpose relates only to Party_1.",
    "Wearing": "The words in this frame refer to what Clothing the Wearer (or a specific Body_part of the Wearer) has on.",
    "Cause_to_make_progress": "An Agent works on a Project so that it reaches a more advanced and desirable state.",
    "Legality": "Words in this frame describe the status of an Action with respect to a Code of laws or rules. An Object may also be in violation or compliance of the Code by virtue of its existence, location or possession.",
    "Employment": "An Employee has a Position doing work in a particular Field, or doing work on a particular Task, for which an Employer gives Compensation to the Employee.",
    "Rite": "This frame concerns rituals performed in line with religious beliefs or tradition.",
    "Publishing": "A Publisher makes a Work of an Author (or authors) available to some public Audience for general enjoyment, examination, and reference. The Medium of a Work can vary; examples include books, TV programs, movies, and radio shows. Publication normally involves a number of other events, such as editing and advertising of the Work, and mass production and sales of a represenation of the Work; thus in the most elaborated version of publication, there are a number of other potential roles, such as editor, publicist/advertizer, distributor, printer, etc., but none of these show up as separate, syntactically distinguished roles for the LUs in this frame.",
    "Adducing": "A Speaker mentions a Specified_entity filling a Role, thereby providing information which supports a point of the Speaker.",
    "Exchange": "Two parties, the Exchangers, each give and receive from the other Themes. The parties are also construable separately as Exchanger_1 and Exchanger_2,  in which case the Themes may be construed separately, too, as Theme_1 and Theme_2.",
    "Exchange_currency": "A Money_owner exchanges Sum_1 in the  Source_currency for Sum_2 in the Target_currency at some Exchange_service.",
    "Ratification": "A Ratifier responds to a Proposal constructed by another party to make it binding over the Ratifier's jurisdiction or constituency.",
    "Sign_agreement": "A Signatory signs an Agreement document, thereby taking on a commitment encoded in the Agreement.",
    "Commerce_buy": "These are words describing a basic commercial transaction involving a Buyer and a Seller exchanging Money and Goods, taking the perspective of the Buyer.  The words vary individually in the patterns of frame element realization they allow.  For example, the typical pattern for the verb BUY:",
    "Imposing_obligation": "A Duty is imposed on a Responsible_party according to a Principle which regulates how the Responsible_party should respond to a Situation.  The Situation may be expressed metonymically by reference to an Obligator, whose action invokes the Principle.  It is only rarely the case that the Principle and the Situation/Obligator are both expressed overtly.",
    "Rewards_and_punishments": "An Agent (the punisher or rewarder) performs a Response_action on an Evaluee for a Reason, the Evaluee's actions or beliefs.   Means and Instrument may also be indicated.",
    "Institutionalization": "A Patient is committed to the care of a medical Facility by a proper Authority. Regardless of whether the Patient agrees or does not agree with their placement in the Facility, the Authority judges that it is in the best interest of the Patient or his environment that the Patient receive treatment in the Facility.",
    "Testing": "A Tester uses a concrete or conceptual Product in order to determine either whether it works or to find out how well or in which manner it works. The Tester may have particular Unwanted_characteristics in mind that they are specifically looking for. The operational test may also be carried out under a particular set of Circumstances that are typically relevant to the functioning of the Product.",
    "Examination": "This frame deals with testing or examination of someone's Knowledge or skill in a particular area.  An Examiner conducts an Examination to an Examinee to determine the Examinee's Knowledge and/or determine their Qualification for some privilege; this proceeds either by the Examinee demonstrating a skill or by writing responses to questions.",
    "Ingestion": "An Ingestor consumes food or drink (Ingestibles), which entails putting the Ingestibles in the mouth for delivery to the digestive system.  This may include the use of an Instrument.  Sentences that describe the provision of food to others are NOT included in this frame.",
    "Labeling": "A Speaker uses as a Label to refer to an Entity. The Label is not a conventional name for the Entity but a description categorizing the Entity and thereby  expressing a judgment.",
    "Kidnapping": "The words in this frame describe situations in which a Perpetrator carries off and holds the Victim against his or her will by force.",
    "Submitting_documents": "A Submittor gives Documents to an Authority so that they can be processed as part of an application, evaluation or other official or bureaucratic process.",
    "Prison": "This Frame deals with Penal_institutions. They are run by an Operator and may be intended to hold certain kinds of Inmates.  Penal_institutions may have a special Name and their Location may also be indicated.",
    "Justifying": "An Agent has done or omitted to do an Act or is responsible for the obtaining of a State_of_affairs, which a Judge deems to constitute a violation of an obligation or a moral guideline. The Agent gives a Reason why the Act or omission or State_of_affairs was licit despite appearances.",
    "Emergency": "This frame characterizes the situation or state of affairs in which someone should or must act to prevent a Undesirable_event from occurring. Often, an Entity affected by the Undesirable_event is more salient than the event itself and is mentioned in its place.",
    "Terrorism": "A Terrorist commits a violent or otherwise harmful Act upon a Victim in order to coerce or terrorize a government or populace. The Act may be committed in particular for political or ideological reasons, and is often directed at civilians, as opposed to government or military officials. It is most often in violation of one or many laws.",
    "Vocalizations": "This frame is concerned with the sounds produced by animate entities by means of their vocal tracts. Descriptions of sounds from artifacts meant to emulate such sounds, or to act as vocalizing animals or people, are also treated here as figurative language.",
    "Risk": "An Agent performs some Action which is considered imprudent.  This frame is distinct from Attempt in that the danger that the Agent puts themselves in by performing the Action is profiled.  The danger is not spelled out, but generally the Action has a possibility or likelihood of causing social or physical harm to the Agent.",
    "Resolve_problem": "An Agent resolves an outstanding Problem by finding its solution, explanation, answer, etc.  Alternatively, some non-agentive Cause may resolve the Problem.  The Means, Degree, Time and Place may also be expressed.",
    "Revenge": "This frame concerns the infliction of punishment in return for a wrong suffered. An Avenger performs a Punishment on a Offender as a consequence of an earlier action by the Offender, the Injury. The Avenger inflicting thePunishment need not be the same as the Injured_Party who suffered the Injury,  but the Avenger does have to share the judgment that the Offender's action was wrong. The judgment that the Offender had inflicted an Injury  is made without regard to the law.",
    "Limiting": "An Agent or Cause limits a Range_of_options to having a certain Characteristic. The Characteristic may be that only certain types of the Range_of_options may be acceptable, or (in the case of a plural or mass Range_of_options) that only certain cardinalities or quanties are acceptable. Alternatively, the Degree to which the Range_of_options is limited may be mentioned.",
    "Research": "A Researcher (an individual a group or institution) attempts to answer a Question by means of consulting literature,  observation, or conducting experiments in a particular Field pertinent to the Question. The Question may be underspecified in the form of a Topic.",
    "Having_or_lacking_access": "A Theme has access to a Useful_location or is blocked from it by a Barrier.",
    "Theft": "These are words describing situations in which a Perpetrator takes Goods from a  Victim or a Source. The Means by which this is accomplished may also be expressed.",
    "Incident": "A State_of_affairs (a state or event) either holds or occurs, and is presented as being causally independent of other (implicit) states or events that might otherwise have been expected to be causally related to the State_of_affairs. The Time or Place may also be mentioned.",
    "Award": "The existence of a State_of_affairs is sufficient reason for taking an Action . The agent who is justified in taking the suggested Action is not part of the immediate scene, however."
}