{
    "Conflict_Attack": "An ATTACK Event is defined as a violent physical act causing harm or damage. ATTACK Events include any such Event not covered by the INJURE or DIE subtypes, including Events where there is no stated agent. The ATTACK Event type includes less specific violence-related nouns such as ‘conflict’, ‘clashes’, and ‘fighting’. ‘Gunfire’, which has the qualities of both an Event and a weapon, should always be tagged as an ATTACK Event, if only for the sake of consistency. A 'coup' is a kind of ATTACK (and so is a 'war').",
    "Movement_Transport": "A TRANSPORT Event occurs whenever an ARTIFACT (WEAPON or VEHICLE) or a PERSON is moved from one PLACE (GPE, FACILITY, LOCATION) to another.",
    "Life_Die": "A DIE Event occurs whenever the life of a PERSON Entity ends. DIE Events can be accidental, intentional or self-inflicted.",
    "Life_Be-Born": "BE-BORN Event occurs whenever a PERSON Entity is given birth to. Please note that we do not include the birth of other things or ideas.",
    "Life_Marry": "MARRY Events are official Events, where two people are married under the legal definition.",
    "Personnel_End-Position": "An END-POSITION Event occurs whenever a PERSON Entity stops working for (or changes offices within) an ORGANIZATION or GPE. The change of office case will only be taggable when the office being left is explicitly mentioned within the scope of the Event. This includes government officials ending terms, whether elected or appointed.",
    "Transaction_Transfer-Ownership": "TRANSFER-OWNERSHIP Events refer to the buying, selling, loaning, borrowing, giving, or receiving of artifacts or organizations.",
    "Justice_Arrest-Jail": "A JAIL Event occurs whenever the movement of a PERSON is constrained by a state actor (a GPE, its ORGANIZATION subparts, or its PERSON representatives). An ARREST Event occurs whenever a state actor (GPE, ORGANIZATION subpart, or PERSON representative) takes official custody of a PERSON Entity for the purposes of evaluating legal liability in a criminal activity. ",
    "Personnel_Start-Position": "A START-POSITION Event occurs whenever a PERSON Entity begins working for (or changes offices within) an ORGANIZATION or GPE. This includes government officials starting their terms, whether elected or appointed.",
    "Transaction_Transfer-Money": "TRANSFER-MONEY Events refer to the giving, receiving, borrowing, or lending money when it is not in the context of purchasing something. The canonical examples are: (1) people giving money to organizations (and getting nothing tangible in return); and (2) organizations lending money to people or other orgs.",
    "Life_Injure": "An INJURE Event occurs whenever a PERSON Entity experiences physical harm. INJURE Events can be accidental, intentional or self-inflicted.",
    "Contact_Phone-Write": "A PHONE-WRITE Event occurs when two or more people directly engage in discussion which does not take place ‘face-to-face’. To make this Event less open-ended, we limit it to written or telephone communication where at least two parties are specified. Communication that takes place in person should be considered a MEET Event. The very common ‘PERSON told reporters’ is not a taggable Event, nor is ‘issued a statement’. A PHONE-WRITE Event must be explicit phone or written communication between two or more parties.",
    "Contact_Meet": "A MEET Event occurs whenever two or more Entities come together at a single location and interact with one another face-to-face. MEET Events include talks, summits, conferences, meetings, visits, and any other Event where two or more parties get together at some location.",
    "Business_START-ORG": "A START-ORG Event occurs whenever a new ORGANIZATION is created.",
    "Conflict_Demonstrate": "A DEMONSRATE Event occurs whenever a large number of people come together in a public area to protest or demand some sort of official action. DEMONSTRATE Events include, but are not limited to, protests, sit-ins, strikes, and riots.",
    "Life_Divorce": "A DIVORCE Event occurs whenever two people are officially divorced under the legal definition of divorce. We do not include separations or church annulments."
}